{
  "name": "Matt \"Maylor\" Taylor",
  "pageTitle": "About Matt Maylor Taylor",
  "pageDescription": "Learn more about Matt Taylor's background, experience, and journey.",
  "timeline": [
    {
      "year": "February 2026",
      "title": "CompTIA Security+ Certified",
      "isLeft": true,
      "content": [
        {
          "type": "paragraph",
          "text": "Achieved CompTIA Security+ certification, validating expertise in threat landscape assessment, vulnerability management, access control mechanisms, and cryptographic implementations. Demonstrated mastery across domains including identity and access management, risk assessment frameworks, and compliance protocols essential for modern software architecture. You can view my credential here.",
          "links": [
            {
              "text": "here",
              "url": "https://www.credly.com/users/matt-taylor.8ec9f95b/edit#credly"
            }
          ]
        }
      ]
    },
    {
      "year": "July 2023",
      "title": "Software Engineer III at Polestar Defense",
      "isLeft": false,
      "content": [
        {
          "type": "paragraph",
          "text": "As Software Engineer III, architect and deploy mission-critical systems utilizing modern cloud infrastructure and distributed computing paradigms. Lead technical initiatives spanning full-stack development, DevOps automation, and infrastructure-as-code implementations. Establish best practices for CI/CD pipelines and implement comprehensive monitoring and observability solutions for high-availability systems serving the maritime and defense sectors."
        }
      ]
    },
    {
      "year": "December 2018",
      "title": "Certified Scrum Master",
      "isLeft": true,
      "content": [
        {
          "type": "paragraph",
          "text": "Earned Certified Scrum Master (CSM) credential to formalize expertise in Agile methodologies and servant leadership. Specialize in optimizing sprint cycles, facilitating cross-functional collaboration, and implementing Lean principles to drive team velocity and product delivery efficiency. View my credential here.",
          "links": [
            {
              "text": "CSM",
              "url": "https://www.scrumalliance.org/get-certified/practitioners/csm-certification"
            },
            {
              "text": "ScrumAlliance",
              "url": "https://www.scrumalliance.org/"
            },
            {
              "text": "here",
              "url": "http://bcert.me/sbyourhga"
            }
          ]
        },
        {
          "type": "image",
          "src": "/images/seal-csm.png",
          "alt": "CSM Seal",
          "width": 150,
          "height": 150
        }
      ]
    },
    {
      "year": "Summer 2018",
      "title": "Senior Software Engineer at Bovsi Studios",
      "isLeft": false,
      "content": [
        {
          "type": "paragraph",
          "text": "As Senior Software Engineer at Bovsi Studios, led architectural decisions and technical strategy for client engagements. Designed scalable microservices architectures, mentored junior developers, and established engineering best practices across the organization. Drove project planning initiatives and implemented process improvements that accelerated time-to-market for client solutions.",
          "links": [
            {
              "text": "Matthew Parks",
              "url": "https://www.linkedin.com/in/matthew-parks-bovsi"
            },
            {
              "text": "Bovsi Studios",
              "url": "https://bovsistudios.com/"
            }
          ]
        }
      ]
    },
    {
      "year": "2014 - 2018",
      "title": "Lead Developer at Presence.io",
      "isLeft": true,
      "content": [
        {
          "type": "paragraph",
          "text": "As Lead Developer, spearheaded architectural refactoring of critical systems using .NET Core, C#, and modern web standards. Engineered high-performance RESTful APIs implementing repository patterns and dependency injection for maintainability. Optimized database queries and indexing strategies to improve system throughput and reduce latency across the platform.",
          "links": [
            {
              "text": "Presence.io",
              "url": "http://presence.io"
            }
          ]
        },
        {
          "type": "paragraph",
          "text": "Served as technical authority on backend architecture decisions, API design patterns, and data persistence strategies. Collaborated directly with C-level stakeholders to translate business requirements into technical specifications. Owned the mobile API roadmap and drove cross-functional initiatives with product leadership, including CEO and product owner Reuben Pressman, to deliver feature-rich solutions while maintaining code quality and system reliability.",
          "links": [
            {
              "text": "Reuben Pressman",
              "url": "https://www.linkedin.com/in/reubenpressman/"
            }
          ]
        }
      ]
    },
    {
      "year": "2012 - 2014",
      "title": "IT Administrator at Applied Technology Resources",
      "isLeft": false,
      "content": [
        {
          "type": "paragraph",
          "text": "As Systems Engineer at Applied Technology Resources, managed enterprise infrastructure spanning network administration, systems maintenance, and database administration. Progressed from infrastructure support to full-stack development, establishing myself as the technical authority for systems optimization.",
          "links": [
            {
              "text": "Applied Technology Resources",
              "url": "https://www.appliedtechres.com/"
            }
          ]
        },
        {
          "type": "paragraph",
          "text": "Designed and implemented database schemas for critical business applications using SQL and MySQL with emphasis on query optimization and performance tuning. Developed custom applications using .NET and VB to optimize business workflows and automate repetitive processes. Created internal tools and utilities that measurably improved operational efficiency across departments and reduced manual overhead."
        }
      ]
    },
    {
      "year": "Fall 2012",
      "title": "Moved to St Petersburg, FL",
      "isLeft": true,
      "content": [
        {
          "type": "paragraph",
          "text": "After college, I moved to St Petersburg, FL because one of my brothers lived nearby. He and his wife helped me get on my feet until I was able to live on my own in the greatest city in Florida."
        },
        {
          "type": "iframe",
          "src": "https://www.google.com/maps/embed/v1/place?q=place_id:ChIJQao6aWPmwogR_4vUvANAzAQ&zoom=10&key=AIzaSyD4WASEzkM6m3h_2pd-1Uyk8mHLnbRuxNY",
          "width": "100%",
          "height": 300
        }
      ]
    },
    {
      "year": "2007 - 2011",
      "title": "University of Alabama",
      "isLeft": false,
      "content": [
        {
          "type": "paragraph",
          "text": "Graduated from The University of Alabama. I completed 1.5 years of computer programming classes before realizing the school's program was not geared towards marketable skills. I moved my credits to the College of Business and I finished my Marketing/Business Degree with a 3.5 GPA.",
          "links": [
            {
              "text": "The University of Alabama",
              "url": "https://en.wikipedia.org/wiki/University_of_Alabama"
            }
          ]
        }
      ]
    },
    {
      "year": "Fall 2007",
      "title": "Moved to Tuscaloosa, Alabama",
      "isLeft": true,
      "content": [
        {
          "type": "paragraph",
          "text": "Moved to Tuscaloosa, Alabama for college at The University of Alabama. Roll Tide!"
        },
        {
          "type": "iframe",
          "src": "https://www.google.com/maps/embed/v1/place?q=place_id:ChIJZ0DCkS6viIgRWCuJFv37q6w&zoom=5&key=AIzaSyD4WASEzkM6m3h_2pd-1Uyk8mHLnbRuxNY",
          "width": "100%",
          "height": 300
        }
      ]
    }
  ]
}
