[
  {
    "id": "d1-001",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Technical Controls",
    "back": {
      "level1": "Technology-based security controls implemented through hardware or software",
      "level2": "Controls deployed using technology to protect systems and data. Examples: firewalls (block unauthorized network traffic), encryption (protect data confidentiality), antivirus (detect/remove malware), access control lists (restrict access), intrusion detection systems (monitor for attacks), authentication systems (verify identity). Also called logical controls.",
      "level3": "Exam tip: Technical = technology-based (firewalls, encryption, IDS, ACLs, antivirus). Contrasts with managerial (policies), operational (people), physical (locks). Know that most security tools are technical controls. Questions often ask to categorize controls: if it's software/hardware doing the protecting, it's technical. Examples: firewall blocking port (technical), security policy requiring firewall (managerial), admin configuring firewall (operational)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Control Categories", "Logical Controls", "Managerial Controls", "Physical Controls"]
    }
  },
  {
    "id": "d1-002",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Managerial Controls",
    "back": {
      "level1": "Administrative controls including policies, procedures, and governance",
      "level2": "Controls implemented through organizational management and administration. Examples: security policies (acceptable use, password requirements), risk assessments, security awareness training programs, change management processes, incident response plans, background checks, governance frameworks. Also called administrative controls. Focus on planning and oversight.",
      "level3": "Exam tip: Managerial = policies and procedures (the rules and planning). Think paperwork and management decisions. Examples: security policy, risk assessment, training program, governance framework, strategic planning. Know that managerial controls tell people WHAT to do, operational controls are people DOING it. Questions test categorizing: written policy = managerial, security guard implementing policy = operational. Remember: managerial controls are oversight and planning activities."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Control Categories", "Administrative Controls", "Policies", "Governance"]
    }
  },
  {
    "id": "d1-003",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Operational Controls",
    "back": {
      "level1": "Controls implemented and executed by people in day-to-day operations",
      "level2": "Security controls carried out by individuals as part of their job functions. Examples: security guards conducting patrols, operators performing backups, staff executing incident response procedures, administrators reviewing logs, personnel conducting security awareness training sessions, backup verification. These controls require human action to execute.",
      "level3": "Exam tip: Operational = people DOING things (guards, backups, training sessions, log reviews). Key distinction: managerial controls are PLANS (security policy), operational controls are EXECUTION (security guard following that policy). Know that operational controls are day-to-day activities by people. Questions test: guard patrolling = operational, policy requiring patrols = managerial, door lock = physical, surveillance camera = technical. Remember operational = operations performed by people."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Control Categories", "Managerial Controls", "Security Operations"]
    }
  },
  {
    "id": "d1-004",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Physical Controls",
    "back": {
      "level1": "Tangible controls that restrict physical access to facilities and resources",
      "level2": "Controls that physically prevent or detect unauthorized access to buildings, rooms, and equipment. Examples: locks and keys, fencing and gates, security guards, access badges and card readers, mantraps/access control vestibules, bollards (vehicle barriers), video surveillance cameras, motion detectors, environmental controls (HVAC, fire suppression).",
      "level3": "Exam tip: Physical = tangible things you can touch (locks, fences, cameras, guards as physical presence). Protects against physical access and environmental threats. Know the crossover: camera is physical control (the device) but video monitoring is detective control (what it does). Questions test: locked door = physical, firewall = technical, guard = physical (presence) and operational (action). Common examples: fences, locks, badges, bollards, mantraps, cameras, lighting."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Control Categories", "Physical Security", "Access Control"]
    }
  },
  {
    "id": "d1-005",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Preventive Controls",
    "back": {
      "level1": "Controls that stop security incidents before they occur",
      "level2": "Proactive controls designed to prevent security breaches and attacks. Examples: firewall blocking unauthorized traffic, encryption preventing data exposure, locked doors preventing physical entry, security awareness training preventing social engineering, antivirus blocking malware execution, access controls preventing unauthorized access, authentication systems preventing unauthorized login.",
      "level3": "Exam tip: Preventive = STOPS incidents before they happen (most proactive control type). Goal is to prevent security events from occurring. Know that preventive is most desirable but can't catch everything (need detective controls too). Questions test identifying control type: firewall blocking traffic = preventive, IDS alerting on attack = detective, antivirus removing malware = corrective. Remember: if it PREVENTS the bad thing from happening, it's preventive."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Control Types", "Proactive Security", "Detective Controls"]
    }
  },
  {
    "id": "d1-006",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Detective Controls",
    "back": {
      "level1": "Controls that identify and alert when security incidents occur",
      "level2": "Reactive controls that discover security breaches during or after occurrence. Examples: intrusion detection systems (IDS) alerting on attacks, security cameras recording activity, log monitoring detecting anomalies, motion sensors triggering alarms, security audits finding violations, antivirus detecting (but not yet removing) malware, SIEM correlation alerts.",
      "level3": "Exam tip: Detective = IDENTIFIES incidents (alerts/detects but doesn't prevent or fix). Goal is to discover security events. Know detective vs preventive: IDS detects = detective, IPS prevents = preventive (and detective). Detective vs corrective: IDS detects = detective, antivirus removes = corrective. Questions test: log monitoring = detective, firewall blocking = preventive, backup restoration = corrective, warning sign = deterrent. Remember: detective finds problems but doesn't stop or fix them."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Control Types", "IDS", "Monitoring", "Preventive Controls"]
    }
  },
  {
    "id": "d1-007",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Corrective Controls",
    "back": {
      "level1": "Controls that repair damage and restore systems after security incidents",
      "level2": "Reactive controls that fix problems after detection. Examples: antivirus removing malware, backup restoration after data loss, system patches fixing vulnerabilities, incident response procedures containing breaches, file quarantine, password reset after compromise, disaster recovery processes, restoring from known-good configurations.",
      "level3": "Exam tip: Corrective = FIXES/REPAIRS after incident (most reactive). Goal is to restore to normal state. Know that corrective controls activate AFTER detective controls find problems. Questions test: backup restoration = corrective, detecting the need for backup = detective, preventing data loss = preventive. Common corrective examples: antivirus removal, patches, backups, incident response, system restoration. Remember: corrective repairs damage AFTER it happens."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Control Types", "Recovery", "Incident Response", "Detective Controls"]
    }
  },
  {
    "id": "d1-008",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Deterrent Controls",
    "back": {
      "level1": "Controls that discourage potential attackers from attempting malicious actions",
      "level2": "Psychological controls that make attackers think twice before acting. Examples: warning signs and banners, visible security cameras, security guard presence, alarm system signs, login banners stating monitoring/prosecution, locks (visible deterrent), lighting, fencing with warning notices. May not physically prevent but create hesitation.",
      "level3": "Exam tip: Deterrent = DISCOURAGES attacks (psychological impact). Goal is to make attacker choose easier target. Know that same control can be multiple types: camera is deterrent (visible presence discourages) and detective (records activity). Warning signs are pure deterrent (no technical capability). Questions test: 'This area monitored by video surveillance' sign = deterrent, actual camera = detective + deterrent, guard shack = deterrent + preventive. Remember: deterrent relies on perception to discourage action."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Control Types", "Physical Security", "Preventive Controls"]
    }
  },
  {
    "id": "d1-009",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Compensating Controls",
    "back": {
      "level1": "Alternative controls when primary security measures aren't feasible",
      "level2": "Controls deployed when preferred security controls cannot be implemented due to technical, operational, or cost constraints. Must provide equivalent or similar protection through different means. Examples: network monitoring when system can't be patched, network segmentation when encryption isn't possible, increased logging when real-time detection unavailable.",
      "level3": "Exam tip: Compensating = alternative providing EQUIVALENT protection. Used when primary control is impractical (legacy system can't be patched, business requirement prevents preferred control, cost prohibitive). Know that compensating controls must provide SIMILAR protection level - not just 'something else'. Questions test: can't patch legacy system → isolate network + IPS monitoring = compensating controls. Remember: compensating provides similar security through different method. Must document for compliance audits."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Control Types", "Risk Management", "Alternative Controls"]
    }
  },
  {
    "id": "d1-010",
    "domain": 1,
    "section": "Security Controls",
    "type": "concept",
    "front": "Directive Controls",
    "back": {
      "level1": "Controls that direct, confine, or control actions of subjects through mandatory requirements",
      "level2": "Administrative controls that mandate specific behaviors through policies and procedures. Examples: security policies requiring VPN use, acceptable use policies, standard operating procedures, compliance requirements, mandatory security training, password policies, data classification requirements. Tell people what they must do.",
      "level3": "Exam tip: Directive = DIRECTS behavior through mandatory policies (tells people what to do). Similar to managerial but more specific about required actions. Examples: policy requiring MFA, AUP mandating password complexity, SOP for incident response. Know that directive controls set expectations and requirements. Questions test: 'Employees must use VPN for remote access' = directive policy. Remember: directive controls direct/mandate specific actions through policy."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": false,
      "relatedTerms": ["Control Types", "Policies", "Managerial Controls"]
    }
  },
  {
    "id": "d1-011",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "CIA Triad - Confidentiality",
    "back": {
      "level1": "Ensuring information is not disclosed to unauthorized individuals or systems",
      "level2": "Protecting sensitive information from unauthorized access and disclosure. Maintains privacy and secrecy. Implemented through: encryption (protects data at rest and in transit), access controls (authentication, authorization), data classification (identify what needs protection), steganography (hide data), permissions, need-to-know policies.",
      "level3": "Exam tip: Confidentiality = keep secrets SECRET (prevent unauthorized disclosure). Violated by: data breach, eavesdropping, shoulder surfing, improper access, stolen credentials. Protected by: encryption, access controls, classification, least privilege, need-to-know. Questions test: encryption protects confidentiality, hashing protects integrity, redundancy provides availability. Common exam scenario: encrypt laptop hard drive protects confidentiality if stolen. Remember: confidentiality is about WHO can access data."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["CIA Triad", "Encryption", "Access Control", "Integrity", "Availability"]
    }
  },
  {
    "id": "d1-012",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "CIA Triad - Integrity",
    "back": {
      "level1": "Ensuring data accuracy, consistency, and trustworthiness over its lifecycle",
      "level2": "Protecting information from unauthorized modification or destruction. Ensures data hasn't been tampered with. Implemented through: hashing (detect changes via checksums), digital signatures (verify origin and integrity), version control (track changes), access controls (prevent unauthorized modification), input validation (prevent corruption).",
      "level3": "Exam tip: Integrity = data is ACCURATE and UNMODIFIED (hasn't been tampered with). Violated by: unauthorized changes, malware corruption, transmission errors, improper access. Protected by: hashing (MD5, SHA-256), digital signatures, checksums, version control, change control. Questions test: hashing verifies integrity, encryption provides confidentiality, backups ensure availability. Know that integrity includes both preventing unauthorized changes AND detecting if changes occurred. Remember: integrity is about WHAT data is (accuracy/trustworthiness)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["CIA Triad", "Hashing", "Digital Signatures", "Confidentiality", "Availability"]
    }
  },
  {
    "id": "d1-013",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "CIA Triad - Availability",
    "back": {
      "level1": "Ensuring authorized users have reliable and timely access to information and resources",
      "level2": "Ensuring systems, data, and services are accessible when needed. Prevents disruption. Implemented through: redundancy (RAID, clustering), fault tolerance (failover systems), backups and disaster recovery, load balancing, DDoS protection, environmental controls (power, cooling), preventive maintenance, business continuity planning.",
      "level3": "Exam tip: Availability = systems are ACCESSIBLE when needed (uptime/reliability). Violated by: DDoS attacks, hardware failure, natural disasters, ransomware, power outages, misconfigurations. Protected by: redundancy, backups, fault tolerance, clustering, load balancers, generators, business continuity. Questions test: RAID improves availability, encryption protects confidentiality, hashing ensures integrity. Know that availability balances with security - too restrictive security can reduce availability. Remember: availability is about WHEN data is accessible (reliability)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["CIA Triad", "Redundancy", "Business Continuity", "Confidentiality", "Integrity"]
    }
  },
  {
    "id": "d1-014",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Non-repudiation",
    "back": {
      "level1": "Proof that action or event occurred, preventing denial of involvement",
      "level2": "Assurance that someone cannot deny authenticity of their actions. Provides proof of origin (sender can't deny sending) and proof of delivery (recipient can't deny receiving). Implemented through: digital signatures (cryptographic proof), audit logs (track activities), timestamps, video recordings, witnessed signatures, email read receipts.",
      "level3": "Exam tip: Non-repudiation = can't deny it (proof you did it). Digital signatures provide non-repudiation - sender can't deny signing document because only they have private key. Audit logs provide non-repudiation of actions. Know difference: authentication proves who you are NOW, non-repudiation proves you DID something previously. Questions test: digital signature provides non-repudiation, symmetric encryption doesn't (shared key = both could have encrypted). Remember: non-repudiation requires something unique to actor (private key, biometric, witnessed signature)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Digital Signatures", "Audit Logs", "Accountability", "Authentication"]
    }
  },
  {
    "id": "d1-015",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "AAA - Authentication",
    "back": {
      "level1": "Verifying the identity of users, devices, or systems",
      "level2": "Process of proving identity through credentials. Three factor types: something you know (password, PIN), something you have (smart card, token, phone), something you are (biometric - fingerprint, face, iris). Methods: passwords, MFA, certificates, biometrics, smart cards, Kerberos tickets, RADIUS authentication.",
      "level3": "Exam tip: Authentication = proving WHO you are (identity verification). Know authentication factors: knowledge (password), possession (token), inherence (biometric). MFA requires factors from DIFFERENT categories - password + security question is NOT MFA (both knowledge). Common authentication: username/password (single factor), password + SMS code (MFA). Questions test: authentication answers WHO, authorization answers WHAT (permissions), accounting tracks WHEN/WHERE. Remember: authentication happens BEFORE authorization."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["AAA", "MFA", "Authorization", "Accounting", "Identity"]
    }
  },
  {
    "id": "d1-016",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "AAA - Authorization",
    "back": {
      "level1": "Determining what authenticated users are allowed to access or do",
      "level2": "Process of granting permissions to resources based on identity. Occurs AFTER authentication. Defines allowed actions and accessible resources. Implemented through: access control lists (ACLs), permissions, role-based access control (RBAC), mandatory access control (MAC), least privilege principle, need-to-know basis.",
      "level3": "Exam tip: Authorization = WHAT you can do (permissions/access rights). Happens after authentication proves WHO you are. Examples: file permissions (read, write, execute), application access (can view reports but not modify), network access (allowed subnets). Know the order: authenticate first (prove identity), then authorize (grant permissions based on identity). Questions test: authentication verifies identity, authorization grants permissions, accounting tracks usage. Remember: authorization is about permissions/privileges."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["AAA", "Authentication", "Accounting", "Access Control", "Permissions"]
    }
  },
  {
    "id": "d1-017",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "AAA - Accounting",
    "back": {
      "level1": "Tracking and recording user activities and resource usage",
      "level2": "Process of monitoring and recording what authenticated users do. Creates audit trail for security, compliance, and forensics. Tracks: login/logout times, resources accessed, actions performed, data modified, commands executed. Implemented through: log files, SIEM systems, audit trails, session recording, database activity monitoring.",
      "level3": "Exam tip: Accounting = TRACKING what users do (activity monitoring/logging). Answers: when did they login, what did they access, what actions taken, when did they logout. Essential for: forensics (investigate incidents), compliance (prove controls work), billing (cloud usage), troubleshooting. Know AAA order: authenticate WHO → authorize WHAT → account WHEN/WHERE. Questions test: accounting provides audit trail, authentication proves identity, authorization grants access. Remember: accounting is monitoring and logging for non-repudiation."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["AAA", "Authentication", "Authorization", "Audit Logs", "SIEM"]
    }
  },
  {
    "id": "d1-018",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Gap Analysis",
    "back": {
      "level1": "Comparing current security state against desired state to identify deficiencies",
      "level2": "Process of evaluating existing security controls and comparing them to requirements, standards, or best practices. Identifies security gaps that need remediation. Steps: define desired state (compliance requirement, security framework), assess current state (what controls exist), identify gaps (missing or inadequate controls), prioritize remediation, create action plan.",
      "level3": "Exam tip: Gap analysis = current state vs. desired state comparison (what's missing?). Use cases: compliance assessment (are we meeting PCI DSS?), security maturity (how do we compare to NIST CSF?), risk assessment component. Outputs: list of deficiencies, prioritized remediation plan. Know that gap analysis answers: what controls are missing, what controls are inadequate, what should be implemented. Questions test understanding gap analysis identifies security deficiencies by comparing current vs. target state."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Risk Assessment", "Compliance", "Security Audit", "Remediation"]
    }
  },
  {
    "id": "d1-019",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Defense in Depth",
    "back": {
      "level1": "Layered security approach with multiple defensive measures at different levels",
      "level2": "Security strategy implementing multiple layers of controls so if one fails, others still protect. No single point of failure. Layers: physical (locks, guards), network (firewalls, IDS), host (antivirus, hardening), application (input validation, authentication), data (encryption, classification). Medieval castle model: moat, walls, towers, guards, inner keep.",
      "level3": "Exam tip: Defense in depth = multiple layers (don't rely on single control). Example: perimeter firewall → DMZ → internal firewall → host firewall → application authentication → encryption. If attacker bypasses firewall, IDS detects; if bypasses both, host controls prevent damage. Know this is also called 'layered security' or 'diversity of defense'. Questions test: defense in depth uses redundant controls at different layers, single strong firewall is NOT defense in depth. Remember: assumes perimeter will be breached, multiple layers limit damage."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Layered Security", "Security Architecture", "Redundancy"]
    }
  },
  {
    "id": "d1-020",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Least Privilege",
    "back": {
      "level1": "Users granted minimum access rights necessary to perform job functions",
      "level2": "Security principle where users, processes, and systems receive only permissions essential for their tasks. No more, no less. Limits damage from accidents, errors, or malicious actions. Implemented through: role-based access, time-based access, just-in-time (JIT) elevation, regularly reviewing permissions, removing unnecessary access.",
      "level3": "Exam tip: Least privilege = minimum necessary access (reduces risk/blast radius). Benefits: limits damage if account compromised, prevents accidental changes, reduces insider threat risk, simplifies compliance. Example: developer needs read access to production database for troubleshooting (not admin). Know that least privilege requires access reviews - creeping permissions as users change roles. Questions test: admin rights for all users violates least privilege, temporary elevation for specific tasks follows least privilege. Remember: only what's needed, when it's needed."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Access Control", "JIT", "RBAC", "Security Principle"]
    }
  },
  {
    "id": "d1-021",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Separation of Duties",
    "back": {
      "level1": "Dividing critical functions among different people to prevent fraud and errors",
      "level2": "Security principle requiring multiple people to complete sensitive tasks. No single person can compromise system or commit fraud alone. Requires collusion for malicious activity. Examples: one person initiates payment, different person approves; developer can't deploy own code; admin can't create AND approve accounts. Also called dual control or two-person rule.",
      "level3": "Exam tip: Separation of duties = divide critical functions (require collusion for fraud). Classic example: one person writes checks, different person reconciles bank statement. Know that SoD prevents: fraud (requires multiple people), errors (second person reviews), insider threat (no single point of compromise). Questions test: developer shouldn't approve own code, admin shouldn't audit own actions. Related: job rotation detects violations, least privilege limits access. Remember: critical tasks split among multiple people."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Job Rotation", "Fraud Prevention", "Dual Control", "Security Principle"]
    }
  },
  {
    "id": "d1-022",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Deception Technologies - Honeypot",
    "back": {
      "level1": "Decoy system designed to attract and detect attackers",
      "level2": "Intentionally vulnerable system with no legitimate purpose, deployed to lure attackers and study their methods. Any access is suspicious (no legitimate users). Types: low-interaction (emulated services, limited functionality, safer), high-interaction (real system, full OS, more realistic but riskier). Logs all attacker activity for analysis. Used for threat intelligence and early warning.",
      "level3": "Exam tip: Honeypot = decoy/trap for attackers (detect and study). Purpose: waste attacker time, gather threat intelligence, early warning (if honeypot accessed, network may be compromised). Know risks: if poorly configured, can become attack platform against others. Placement: outside firewall (internet threats) or inside (insider threats). Legal/ethical: must ensure doesn't entrap or facilitate attacks. Questions test: honeypot has no legitimate users so any access is suspicious, differs from production (has real users)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Deception", "Threat Intelligence", "Honeynet", "Detection"]
    }
  },
  {
    "id": "d1-023",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Physical Security - Bollards",
    "back": {
      "level1": "Short vertical posts designed to prevent vehicle access while allowing pedestrian traffic",
      "level2": "Physical barriers protecting buildings and areas from vehicle-based attacks. Concrete, steel, or reinforced posts embedded in ground. Prevents: ramming attacks, vehicle bombs, accidental crashes. Placed around: government buildings, embassies, crowded areas, critical infrastructure. Can be fixed (permanent) or removable/retractable (flexible access).",
      "level3": "Exam tip: Bollards = vehicle barriers (prevent car/truck attacks). Use cases: protect building entrances from vehicle ramming, protect pedestrian areas, control vehicle access to restricted zones. Know that bollards are physical + preventive control (physically block vehicles from entering). Questions test: bollard prevents vehicle access but allows pedestrians, fencing blocks both. Remember: bollards specifically for vehicle threats (ramming, bombs)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Physical Security", "Vehicle Barriers", "Preventive Control"]
    }
  },
  {
    "id": "d1-024",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Access Control Vestibule (Mantrap)",
    "back": {
      "level1": "Small room with two interlocking doors preventing tailgating and ensuring single-person authentication",
      "level2": "Physical security control with two doors that cannot be open simultaneously. Person enters first door, authenticates (badge, biometric), first door locks, then second door opens. Prevents: tailgating/piggybacking (following authorized person), unauthorized entry, ensures each person authenticated individually. Common in: data centers, secure facilities, banks.",
      "level3": "Exam tip: Mantrap/vestibule = two interlocking doors (prevents tailgating). Process: enter door 1 → door 1 closes/locks → authenticate → door 2 opens → enter → door 2 closes before door 1 can reopen. Know that only ONE door open at time - if both open, security alarm. Purpose: force individual authentication, prevent piggybacking. Questions test: mantrap prevents tailgating by ensuring only one person enters at time. Remember: anti-tailgating device with dual authentication points."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Physical Security", "Anti-Tailgating", "Access Control"]
    }
  },
  {
    "id": "d1-025",
    "domain": 1,
    "section": "Change Management",
    "type": "concept",
    "front": "Change Management Process",
    "back": {
      "level1": "Structured approach to modifying IT systems ensuring changes are controlled and documented",
      "level2": "Formal process for managing changes to systems and configurations. Steps: request change → assess impact → get approval → test in safe environment → implement during maintenance window → verify success → document. Prevents: unauthorized changes, service disruptions, security vulnerabilities. Includes: change advisory board (CAB), approval workflow, backout plan.",
      "level3": "Exam tip: Change management = formal process to control changes (prevents chaos). Key components: request (who, what, why), impact analysis (risks, affected systems), approval (CAB/management), testing (verify before production), maintenance window (minimize disruption), backout plan (if change fails), documentation. Know that emergency changes may have expedited process but still need approval/documentation. Questions test: all changes require approval, testing happens before production, backout plan prepared before implementation."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["CAB", "Impact Analysis", "Backout Plan", "ITIL"]
    }
  },
  {
    "id": "d1-026",
    "domain": 1,
    "section": "Change Management",
    "type": "concept",
    "front": "Impact Analysis",
    "back": {
      "level1": "Evaluating potential effects of proposed change on systems, security, and operations",
      "level2": "Assessment performed before implementing change to understand consequences. Evaluates: affected systems and users, security implications, dependencies, required downtime, rollback complexity, risks if change fails or succeeds. Assigns risk level (high, medium, low). Helps decide if change should proceed and when to schedule.",
      "level3": "Exam tip: Impact analysis = what will change affect? (identify risks/dependencies before implementation). Questions answered: what systems affected, how many users impacted, what's the risk level, what dependencies exist, can we roll back. Know that high-impact changes need more testing, approval levels, longer maintenance windows. Questions test: impact analysis done BEFORE change implementation, helps determine change approval/timing. Remember: understand consequences before making change."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Change Management", "Risk Assessment", "Dependencies"]
    }
  },
  {
    "id": "d1-027",
    "domain": 1,
    "section": "Change Management",
    "type": "concept",
    "front": "Backout Plan",
    "back": {
      "level1": "Documented procedure to revert systems to previous state if change fails",
      "level2": "Rollback plan prepared before implementing change. Defines steps to undo change and restore original configuration. Includes: restore from backup, uninstall patches/updates, revert configuration changes, restore database, switch back to previous version. Must be tested to ensure it works. Critical for change approval.",
      "level3": "Exam tip: Backout plan = how to UNDO change if it fails (rollback procedure). Must be prepared BEFORE implementing change (not after failure). Examples: uninstall patch, restore VM snapshot, revert configuration file, restore database backup. Know that backout plan should be tested - untested rollback might fail when needed. Questions test: backout plan required before change approval, defines reversion procedure, may involve backups/snapshots. Remember: hope change succeeds, prepare to roll back."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Change Management", "Rollback", "Recovery", "Risk Mitigation"]
    }
  },
  {
    "id": "d1-028",
    "domain": 1,
    "section": "Change Management",
    "type": "concept",
    "front": "Maintenance Window",
    "back": {
      "level1": "Scheduled time period for system changes with minimal business impact",
      "level2": "Pre-planned time when changes and maintenance can be performed. Typically during low-usage periods: nights, weekends, holidays. Allows: system downtime, reboots, testing, troubleshooting without affecting business operations. Users notified in advance. Critical changes scheduled during maintenance windows to minimize disruption.",
      "level3": "Exam tip: Maintenance window = scheduled low-impact time for changes (minimize disruption to users/business). Common: overnight (2 AM - 6 AM), weekends, holidays. Know that emergency changes might happen outside window but planned changes wait for window. Includes: advance user notification, scheduled downtime, time for implementation + testing + rollback if needed. Questions test: maintenance windows reduce business impact by scheduling during low-usage times. Remember: when changes happen matters as much as what changes happen."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Change Management", "Downtime", "Scheduling"]
    }
  },
  {
    "id": "d1-029",
    "domain": 1,
    "section": "Change Management",
    "type": "acronym",
    "front": "CAB",
    "back": {
      "level1": "Change Advisory Board - Group that reviews and approves proposed changes",
      "level2": "Committee of stakeholders who evaluate change requests and approve/reject based on risk, impact, and business needs. Members: IT managers, security team, business representatives, technical leads. Reviews: impact analysis, test results, backout plans, schedule. Ensures changes align with business goals and don't introduce unacceptable risk.",
      "level3": "Exam tip: CAB = change approval committee (group decision on changes). Meets regularly to review change requests. Responsibilities: assess risk, evaluate impact, approve/reject/defer changes, prioritize implementation, ensure proper planning. Know that CAB prevents unauthorized or poorly planned changes. Emergency CAB (ECAB) for urgent changes requiring fast approval. Questions test: CAB reviews changes before implementation, includes stakeholders from multiple areas, makes approval decisions. Remember: CAB is governance for change process."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Change Management", "Approval Process", "Governance"]
    }
  },
  {
    "id": "d1-030",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Symmetric Encryption",
    "back": {
      "level1": "Encryption using single shared secret key for both encryption and decryption",
      "level2": "Cryptographic method where same key encrypts and decrypts data. Fast and efficient for large amounts of data. Challenge: secure key distribution (how to share key safely). Examples: AES (current standard), DES (obsolete), 3DES (legacy), Blowfish, Twofish. Used for: disk encryption, file encryption, bulk data encryption, VPN data channel.",
      "level3": "Exam tip: Symmetric = one shared key (same key encrypts and decrypts). Advantages: FAST (efficient for bulk data), less CPU intensive, good for encrypting large files/disks. Disadvantages: key distribution problem (how to securely share key), scalability (need unique key for each pair of users - N users need N(N-1)/2 keys). Know symmetric is faster than asymmetric. Questions test: symmetric uses shared key, faster than asymmetric, key distribution challenge, use asymmetric to exchange symmetric key."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["AES", "Asymmetric Encryption", "Key Distribution", "Encryption"]
    }
  },
  {
    "id": "d1-031",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Asymmetric Encryption",
    "back": {
      "level1": "Encryption using mathematically-related public and private key pair",
      "level2": "Cryptographic method using two keys: public key (freely shared) and private key (kept secret). Data encrypted with public key can only be decrypted with private key, and vice versa. Slower than symmetric. Examples: RSA, ECC, DSA. Used for: key exchange (share symmetric keys), digital signatures, authentication, email encryption (S/MIME, PGP).",
      "level3": "Exam tip: Asymmetric = key pair (public + private). Public key encrypts OR verifies signatures, private key decrypts OR creates signatures. Advantages: solves key distribution (public key can be shared freely), provides digital signatures, enables key exchange. Disadvantages: SLOW (100-1000x slower than symmetric), not practical for bulk data. Know hybrid approach: asymmetric exchanges symmetric key, then symmetric encrypts data. Questions test: asymmetric has public/private keys, slower than symmetric, used for key exchange."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["RSA", "ECC", "Symmetric Encryption", "Public Key", "Private Key"]
    }
  },
  {
    "id": "d1-032",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "AES",
    "back": {
      "level1": "Advanced Encryption Standard - Current U.S. government symmetric encryption standard",
      "level2": "Symmetric block cipher selected by NIST in 2001 to replace DES. Key sizes: 128-bit, 192-bit, or 256-bit. Block size: 128 bits. Fast, secure, widely supported. Used for: disk encryption (BitLocker, FileVault), VPNs, Wi-Fi (WPA2/WPA3), file encryption. Also called Rijndael algorithm.",
      "level3": "Exam tip: AES is current encryption standard (replaced DES/3DES). Key lengths: 128, 192, 256 bits (longer = more secure but slower). AES-256 is strongest commonly used symmetric encryption. Know that AES is: fast, secure (no known practical attacks), government approved, widely implemented in hardware. Questions test: AES is current standard, symmetric algorithm, used for bulk encryption. Remember: AES is default choice for symmetric encryption."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Symmetric Encryption", "DES", "Block Cipher", "NIST"]
    }
  },
  {
    "id": "d1-033",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "RSA",
    "back": {
      "level1": "Rivest-Shamir-Adleman - Asymmetric encryption algorithm",
      "level2": "Public-key cryptosystem used for encryption and digital signatures. Based on difficulty of factoring large prime numbers. Key sizes: 1024-bit (deprecated), 2048-bit (minimum), 4096-bit (high security). Used for: digital signatures, encrypting symmetric keys, SSL/TLS certificates, email encryption (PGP, S/MIME), code signing.",
      "level3": "Exam tip: RSA = most common asymmetric algorithm. Security based on prime factorization difficulty (quantum computers threaten this). Key size requirements increasing: 1024-bit obsolete, 2048-bit current minimum, 3072+ for long-term security. Know RSA is SLOW - encrypt small data (like symmetric keys) not large files. Common use: encrypt AES key with RSA public key, send to recipient who decrypts with RSA private key, then use AES for actual data. Questions test: RSA is asymmetric, slower than AES, used for key exchange and signatures."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Asymmetric Encryption", "Digital Signatures", "ECC", "Public Key"]
    }
  },
  {
    "id": "d1-034",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "ECC",
    "back": {
      "level1": "Elliptic Curve Cryptography - Efficient asymmetric encryption using elliptic curves",
      "level2": "Public-key cryptography based on algebraic structure of elliptic curves. Much more efficient than RSA - 256-bit ECC provides security equivalent to 3072-bit RSA. Smaller keys mean: faster operations, less power consumption, less storage/bandwidth. Used in: mobile devices, IoT, SSL/TLS (ECDHE), Bitcoin, smart cards.",
      "level3": "Exam tip: ECC = efficient asymmetric (smaller keys, same security as RSA). Advantage: 256-bit ECC ≈ 3072-bit RSA security (6x more efficient). Benefits: faster, less power, smaller keys (critical for mobile/IoT). Variants: ECDH (key exchange), ECDHE (ephemeral key exchange for PFS), ECDSA (digital signatures). Know ECC is becoming standard for resource-constrained devices. Questions test: ECC more efficient than RSA, smaller key sizes, used in mobile/IoT. Remember: ECC = modern efficient alternative to RSA."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Asymmetric Encryption", "RSA", "ECDHE", "Mobile Security"]
    }
  },
  {
    "id": "d1-035",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Hashing",
    "back": {
      "level1": "One-way cryptographic function creating fixed-size unique fingerprint of data",
      "level2": "Algorithm that takes input of any size and produces fixed-length output (hash/digest). Properties: one-way (can't reverse), deterministic (same input = same hash), avalanche effect (small change = completely different hash), collision-resistant (hard to find two inputs with same hash). Used for: password storage, integrity verification, digital signatures, file deduplication.",
      "level3": "Exam tip: Hashing is ONE-WAY (can't decrypt hash back to original). Purpose: verify INTEGRITY (data hasn't changed) not confidentiality (doesn't hide data). Common algorithms: MD5 (128-bit, obsolete), SHA-1 (160-bit, deprecated), SHA-256 (256-bit, current), SHA-512 (512-bit). Know hashing vs encryption: hash is one-way and fixed-length, encryption is two-way and variable-length. Questions test: hashing for integrity, encryption for confidentiality, hashing can't be reversed."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Integrity", "SHA-256", "MD5", "Digital Signatures"]
    }
  },
  {
    "id": "d1-036",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "SHA-256",
    "back": {
      "level1": "Secure Hash Algorithm 256-bit - Current secure hashing standard",
      "level2": "Cryptographic hash function producing 256-bit (32-byte) output. Part of SHA-2 family (also includes SHA-224, SHA-384, SHA-512). No known collision vulnerabilities. Used for: password hashing (with salt), file integrity, digital signatures, blockchain (Bitcoin), certificate fingerprints, HMAC.",
      "level3": "Exam tip: SHA-256 is current secure hash standard (replaced MD5 and SHA-1). Know SHA family: SHA-1 (deprecated, 160-bit collisions found), SHA-2 family (SHA-256, SHA-384, SHA-512 - all secure), SHA-3 (newest, different design). Questions often compare: MD5 obsolete (collisions), SHA-1 deprecated (weak), SHA-256 current standard (secure). Common use: hash password with salt before storing. Remember: SHA-256 for integrity verification and secure password hashing."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Hashing", "SHA-2", "MD5", "Integrity"]
    }
  },
  {
    "id": "d1-037",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Digital Signatures",
    "back": {
      "level1": "Cryptographic technique verifying authenticity, integrity, and non-repudiation of messages",
      "level2": "Uses asymmetric cryptography to prove document origin and integrity. Process: sender hashes document, encrypts hash with private key (signature), attaches to document. Receiver decrypts signature with sender's public key, hashes document, compares hashes. If match, document is authentic and unmodified. Only sender has private key, so provides non-repudiation.",
      "level3": "Exam tip: Digital signature = hash encrypted with PRIVATE key (proves who sent it). Verification: decrypt with PUBLIC key, compare to document hash. Provides: authentication (proves sender identity), integrity (detects tampering), non-repudiation (can't deny signing). Know the process: sender signs with private key, recipient verifies with public key. Used in: code signing, email (S/MIME), documents (DocuSign), certificates. Questions test: signature uses private key, verification uses public key, provides non-repudiation."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Asymmetric Encryption", "Non-repudiation", "PKI", "Integrity"]
    }
  },
  {
    "id": "d1-038",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Salting",
    "back": {
      "level1": "Adding random data to passwords before hashing to prevent rainbow table attacks",
      "level2": "Security technique adding random string (salt) to password before hashing. Each user gets unique random salt stored with hash. Same password with different salts produces different hashes. Defeats: rainbow tables (pre-computed hashes), password reuse across users, revealing users with same password. Salt doesn't need to be secret, just unique.",
      "level3": "Exam tip: Salting prevents rainbow table attacks (pre-computed hash tables). Process: generate random salt → concatenate with password → hash combined string → store salt + hash. Know that salt is stored in clear (not secret) - security comes from randomness and uniqueness. Without salt: identical passwords = identical hashes (attacker cracks one, cracks all). With salt: identical passwords = different hashes. Questions test: salting prevents rainbow tables, salt is unique per user, salt stored with hash."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Password Hashing", "Rainbow Tables", "Key Stretching"]
    }
  },
  {
    "id": "d1-039",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "PBKDF2",
    "back": {
      "level1": "Password-Based Key Derivation Function 2 - Key stretching algorithm",
      "level2": "Key derivation function making password hashing slower through iteration. Applies pseudorandom function (HMAC) thousands/millions of times with salt. Iterations configurable (more = slower = more secure). Makes brute force attacks computationally expensive. Part of PKCS #5 standard. Used in: WPA2, encrypted file systems, password storage.",
      "level3": "Exam tip: PBKDF2 = key stretching (intentionally SLOW hashing). Purpose: make brute force impractical by requiring many iterations per guess. Know key stretching concepts: take weak password, make it stronger through computational cost. PBKDF2 settings: number of iterations (100,000+ recommended), salt (random), hash function (SHA-256). Questions test: PBKDF2 slows password cracking through iterations, uses salt to prevent rainbow tables, makes weak passwords more resistant to brute force. Remember: PBKDF2 trades speed for security."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Key Stretching", "Password Hashing", "Bcrypt", "HMAC"]
    }
  },
  {
    "id": "d1-040",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Bcrypt",
    "back": {
      "level1": "Password hashing function based on Blowfish cipher with adaptive cost",
      "level2": "Key derivation function specifically designed for password hashing. Based on Blowfish encryption. Features: automatic salt generation, configurable work factor (cost parameter), intentionally slow and memory-intensive. Work factor adjustable as computers get faster. More resistant to brute force than PBKDF2. Used in: web applications, authentication systems.",
      "level3": "Exam tip: Bcrypt = adaptive password hashing (cost factor increases over time). Advantage over PBKDF2: more resistant to GPU/ASIC attacks (memory-hard). Work factor/cost: determines iteration count, can increase as hardware improves (future-proof). Know that bcrypt automatically handles: salting, iterations, output format. Questions test: bcrypt for password hashing, adaptive cost parameter, more secure than simple hashing, resistant to brute force. Remember: bcrypt is specifically designed for passwords (don't use general hash like SHA-256 alone)."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Password Hashing", "Key Stretching", "PBKDF2", "Salting"]
    }
  },
  {
    "id": "d1-041",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Perfect Forward Secrecy (PFS)",
    "back": {
      "level1": "Property ensuring past session keys cannot be compromised even if long-term keys are stolen",
      "level2": "Cryptographic property where session keys are ephemeral (temporary) and not derived from long-term keys. Even if server's private key is compromised later, past communications remain secure because session keys were temporary and discarded. Implemented using ephemeral Diffie-Hellman (DHE or ECDHE). Each session gets unique key.",
      "level3": "Exam tip: PFS = past sessions safe even if current key compromised (session keys independent). Without PFS: steal server private key → decrypt all past TLS traffic recorded. With PFS: steal server private key → can't decrypt past traffic (session keys already destroyed). Implementation: use ephemeral key exchange (DHE, ECDHE) - temporary keys for each session. Know that PFS requires: ephemeral keys, keys discarded after session. Questions test: PFS protects past communications, requires ephemeral key exchange, ECDHE provides PFS."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Ephemeral Keys", "ECDHE", "TLS", "Key Exchange"]
    }
  },
  {
    "id": "d1-042",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Data at Rest",
    "back": {
      "level1": "Data stored on physical media when not actively being transmitted or processed",
      "level2": "Data residing on storage devices: hard drives, SSDs, USB drives, backup tapes, databases, file servers, cloud storage. Vulnerable to: physical theft, unauthorized access, insider threats. Protection: full disk encryption (FDE), file-level encryption, database encryption, encrypted backups, access controls, physical security.",
      "level3": "Exam tip: Data at rest = stored data (on disks/storage). Encryption options: full disk encryption/FDE (BitLocker, FileVault - encrypts entire disk), file-level (encrypt specific sensitive files), database encryption (TDE - transparent data encryption). Know threats: laptop theft (use FDE), unauthorized access (use access controls + encryption), backup media theft (encrypt backups). Questions test: FDE protects data at rest, TLS protects data in transit. Remember: at rest = sitting on storage device."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Encryption", "FDE", "Data States", "Data in Transit"]
    }
  },
  {
    "id": "d1-043",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Data in Transit",
    "back": {
      "level1": "Data actively moving across network between systems",
      "level2": "Data traveling over networks: internet, LAN, WAN, wireless, email transfers, web traffic, file uploads/downloads, API calls. Also called data in motion. Vulnerable to: eavesdropping, man-in-the-middle attacks, packet sniffing, session hijacking. Protection: TLS/SSL (HTTPS), VPN (IPSec, SSL VPN), encrypted email (S/MIME), SSH/SFTP.",
      "level3": "Exam tip: Data in transit = data traveling over network (in motion). Encryption protocols: TLS/SSL for web (HTTPS), VPN for network tunnels (IPSec), SSH for remote access and file transfer. Know that in transit is most vulnerable to interception - use encryption. Questions test: TLS protects data in transit, FDE protects at rest, securing data in transit prevents eavesdropping. Remember: in transit = moving across network, encrypt the transmission."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["TLS", "VPN", "Data States", "Data at Rest", "Encryption"]
    }
  },
  {
    "id": "d1-044",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Data in Use",
    "back": {
      "level1": "Data actively being processed in memory or CPU",
      "level2": "Data currently in RAM, CPU cache, or being processed by application. Also called data in processing. Most vulnerable state - data must be decrypted to be processed. Vulnerable to: memory scraping, RAM dumps, cold boot attacks, process injection. Limited protection options: application-level encryption, memory encryption, secure enclaves (Intel SGX, ARM TrustZone), process isolation.",
      "level3": "Exam tip: Data in use = in RAM/CPU (currently being processed). HARDEST to protect because data must be decrypted to use it. Classic example: Target breach (110 million credit cards scraped from RAM at POS terminals - data encrypted at rest and in transit but vulnerable in memory). Know that full homomorphic encryption (future technology) would allow processing encrypted data. Questions test: data in use is most vulnerable state, in RAM during processing, harder to protect than at rest or in transit."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Data States", "Memory Scraping", "RAM", "Encryption"]
    }
  },
  {
    "id": "d1-045",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Obfuscation",
    "back": {
      "level1": "Making data or code difficult to understand but not truly encrypting it",
      "level2": "Technique to make information unclear or difficult to comprehend. Not true encryption - security through obscurity. Examples: code obfuscation (rename variables, add dead code), data masking (show partial info like ****1234), encoding (Base64), ROT13. Reversible if method known. Weak security - should not be sole protection.",
      "level3": "Exam tip: Obfuscation ≠ encryption (just makes hard to read, not cryptographically secure). Code obfuscation: make source code hard to reverse engineer (protect intellectual property, slow down analysis). Know that obfuscation provides minimal security - determined attacker can reverse. Common uses: protect software from reverse engineering, hide sensitive data in plain sight, slow down malware analysis. Questions test: obfuscation is not encryption, reversible, security through obscurity (weak). Remember: obfuscation makes unclear, encryption makes secure."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Encoding", "Steganography", "Encryption", "Security Through Obscurity"]
    }
  },
  {
    "id": "d1-046",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Steganography",
    "back": {
      "level1": "Hiding secret data within ordinary files like images, audio, or video",
      "level2": "Practice of concealing information inside other files. Hidden data embedded in carrier file (image, audio, video, document) using least significant bit manipulation or other techniques. File appears normal - hidden data not obvious. Can combine with encryption (encrypt then hide). Examples: hide text in image pixels, hide file in audio, watermarking.",
      "level3": "Exam tip: Steganography = hidden messages in plain sight (security through obscurity). Differs from encryption: encryption makes data unreadable, steganography hides existence of data. Detection: steganalysis (analyzing files for hidden data), comparing file hashes, checking file sizes. Know that steganography can hide: malware (hide payload in image), exfiltrated data (employee hiding stolen data in photos), covert communications. Questions test: steganography hides data in files, differs from encryption (which scrambles), can be combined with encryption."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Obfuscation", "Data Hiding", "Encryption", "Covert Channel"]
    }
  },
  {
    "id": "d1-047",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Tokenization",
    "back": {
      "level1": "Replacing sensitive data with non-sensitive substitute token",
      "level2": "Data security method replacing sensitive information with random token. Token has no mathematical relationship to original (unlike encryption). Original data stored securely in token vault. Token can be de-tokenized (mapped back) only by vault. Examples: credit card tokenization (PCI DSS compliance), SSN tokenization, PII protection in databases.",
      "level3": "Exam tip: Tokenization = replace sensitive data with random token (original in secure vault). Differs from encryption: encryption is mathematical transformation (can be decrypted), tokenization is random substitution (requires vault lookup). Use case: payment processing - replace card number with token, process transactions using token, original number stays in secure vault. Know that tokenization reduces PCI DSS scope (tokens aren't sensitive data). Questions test: tokenization uses random token (not mathematical), requires token vault, used for PCI compliance."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Data Protection", "PCI DSS", "Encryption", "Masking"]
    }
  },
  {
    "id": "d1-048",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Blockchain",
    "back": {
      "level1": "Distributed ledger technology using cryptographic hashes to chain blocks of transactions",
      "level2": "Decentralized database storing transaction records in sequential blocks. Each block contains: transactions, timestamp, hash of previous block, nonce. Hash links blocks creating chain. Distributed across many nodes (no central authority). Tampering detected: changing block changes hash, breaking chain. Used in: cryptocurrencies (Bitcoin), supply chain tracking, smart contracts.",
      "level3": "Exam tip: Blockchain = distributed ledger with cryptographic chaining (immutable transaction history). Key concepts: each block hashes previous block (chain integrity), consensus mechanism (nodes agree on valid transactions), distributed (no single point of failure/control), transparent (all can see), immutable (can't alter past blocks without detection). Know that blockchain provides: integrity (tampering detected), transparency (public ledger), decentralization (no central authority). Questions test: blockchain uses hashing for integrity, distributed ledger, basis for cryptocurrency."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Cryptocurrency", "Distributed Ledger", "Hashing", "Bitcoin"]
    }
  },
  {
    "id": "d1-049",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "TPM",
    "back": {
      "level1": "Trusted Platform Module - Hardware chip for cryptographic operations",
      "level2": "Dedicated microchip on motherboard providing hardware-based security functions. Capabilities: generate and store cryptographic keys (never exposed to OS), hardware random number generation, measured boot (verify boot integrity), platform attestation. Keys stored in TPM can't be extracted. Used for: full disk encryption (BitLocker), secure boot, device authentication.",
      "level3": "Exam tip: TPM = hardware security chip on motherboard (keys never leave chip). Use cases: FDE key storage (BitLocker uses TPM to store encryption key), measured boot (detect tampering), remote attestation (prove platform integrity). Know TPM vs HSM: TPM is single device (motherboard chip), HSM is enterprise/data center scale (hundreds of devices). Questions test: TPM is hardware chip, stores encryption keys securely, used for full disk encryption and secure boot. Remember: TPM = personal device crypto chip."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Hardware Security", "FDE", "HSM", "Secure Boot"]
    }
  },
  {
    "id": "d1-050",
    "domain": 1,
    "section": "Cryptography",
    "type": "acronym",
    "front": "HSM",
    "back": {
      "level1": "Hardware Security Module - Physical device for enterprise cryptographic operations",
      "level2": "Tamper-resistant hardware appliance for cryptographic key management and operations. Provides: key generation, secure key storage, encryption/decryption operations, digital signing. FIPS 140-2 certified. Used by: certificate authorities (CA key protection), payment processors (PIN verification), enterprises (code signing). Protects keys from compromise even with admin access.",
      "level3": "Exam tip: HSM = enterprise crypto appliance (data center scale). Use cases: CA/RA operations (protect root CA keys), SSL/TLS acceleration (offload crypto operations), code signing (protect signing keys), payment processing (PCI HSM for PIN handling). Know HSM vs TPM: HSM is enterprise/networked device for many systems, TPM is single device chip. HSMs are tamper-resistant - physical intrusion destroys keys. Questions test: HSM is hardware device, protects cryptographic keys, enterprise/CA use, tamper-resistant."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Hardware Security", "PKI", "TPM", "Key Management"]
    }
  },
  {
    "id": "d1-051",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Diffie-Hellman",
    "back": {
      "level1": "Key exchange protocol for securely sharing cryptographic keys over public channel",
      "level2": "Method for two parties to establish shared secret over insecure network without prior shared secrets. Uses asymmetric cryptography but establishes symmetric key for session. Vulnerable to man-in-the-middle without authentication. Variants: DHE (ephemeral keys), ECDH (elliptic curve), ECDHE (ephemeral + elliptic curve for PFS). Used in: VPN (IPSec IKE), TLS.",
      "level3": "Exam tip: Diffie-Hellman = secure key exchange over insecure channel (establish shared secret without prior communication). Process: both parties have public/private keys, exchange public keys, independently compute same shared secret. Weakness: susceptible to MITM (attacker intercepts and establishes separate sessions with each party) - requires authentication to prevent. Know variants: DHE provides PFS (ephemeral keys), ECDHE is elliptic curve version (more efficient). Questions test: Diffie-Hellman is key exchange, vulnerable to MITM, used in VPN/TLS."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Key Exchange", "ECDHE", "Perfect Forward Secrecy", "VPN"]
    }
  },
  {
    "id": "d1-052",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "acronym",
    "front": "NIST CSF",
    "back": {
      "level1": "NIST Cybersecurity Framework - Risk-based framework for improving security posture",
      "level2": "Voluntary framework providing guidance on managing cybersecurity risk. Six core functions: Govern (establish context), Identify (understand risks), Protect (implement safeguards), Detect (find incidents), Respond (take action), Recover (restore capabilities). Industry-agnostic, flexible, widely adopted. Based on existing standards (NIST SP 800-53, ISO 27001, CIS Controls).",
      "level3": "Exam tip: NIST CSF six functions (memorize order): Govern, Identify, Protect, Detect, Respond, Recover. Originally five (added Govern in 2.0). Know that CSF is: voluntary (not mandatory like some regulations), risk-based (tailored to organization), framework of frameworks (references other standards). Common in: critical infrastructure, government contractors, organizations wanting structured security program. Questions test: CSF has six functions, voluntary framework, risk-based approach. Remember: NIST CSF provides structure for cybersecurity programs."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Security Frameworks", "Risk Management", "NIST", "Governance"]
    }
  },
  {
    "id": "d1-053",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Job Rotation",
    "back": {
      "level1": "Security practice of periodically moving employees between different positions",
      "level2": "Control where employees regularly rotate through different roles or responsibilities. Purposes: detect fraud (violations discovered when new person takes over), prevent fraud (harder to maintain long-term scheme), cross-training (knowledge distribution), reduce burnout. Often combined with mandatory vacation. Common in: finance, administration, privileged access roles.",
      "level3": "Exam tip: Job rotation = move people between positions (fraud detection/prevention). How it detects fraud: continuous fraud schemes need daily maintenance - when person rotates, replacement discovers irregularities. Benefits: no single person becomes irreplaceable, multiple people know critical functions, fraud harder to maintain. Know job rotation vs separation of duties: SoD splits task among multiple people simultaneously, job rotation moves entire role over time. Questions test: job rotation detects fraud through role changes, provides cross-training, reduces single points of failure."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Fraud Detection", "Mandatory Vacation", "Separation of Duties", "Security Controls"]
    }
  },
  {
    "id": "d1-054",
    "domain": 1,
    "section": "Fundamental Security Concepts",
    "type": "concept",
    "front": "Mandatory Vacation",
    "back": {
      "level1": "Security control requiring employees to take consecutive time off while someone else performs duties",
      "level2": "Policy forcing employees (especially in sensitive roles) to take mandatory consecutive vacation days (typically 1-2 weeks annually) during which another person performs their duties. Fraud detection control - continuous schemes require daily attention to conceal, forced absence exposes irregularities. Employee must actually be away (not checking email).",
      "level3": "Exam tip: Mandatory vacation = DETECTIVE control for fraud (requires actual consecutive absence with duties reassigned). How it works: fraudulent activities often need daily maintenance (hide evidence, adjust records), when person forced away and replacement does job, fraud discovered. Know requirements: CONSECUTIVE days (not scattered), duties MUST be reassigned (someone else does work), employee actually absent (not remotely monitoring). Used with job rotation for comprehensive fraud prevention. Questions test: mandatory vacation detects fraud, requires consecutive time off with duties reassigned."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Fraud Detection", "Job Rotation", "Detective Control", "Insider Threat"]
    }
  },
  {
    "id": "d1-055",
    "domain": 1,
    "section": "Cryptography",
    "type": "concept",
    "front": "Key Escrow",
    "back": {
      "level1": "Secure storage of cryptographic keys with trusted third party for recovery",
      "level2": "Practice of storing copies of private encryption keys with trusted third party (escrow agent). Enables key recovery if: employee leaves, key lost, emergency access needed, legal/regulatory requirement. Common in: enterprise encryption (BitLocker recovery keys), encrypted communications, government requirements. Risk: escrow agent becomes attractive target for attackers.",
      "level3": "Exam tip: Key escrow = backup copies of keys held by trusted party (disaster recovery for encryption). Use cases: employee departure (company needs to decrypt their files), lost/forgotten keys (recovery without data loss), law enforcement access (controversial - government backdoor). Know risks: escrow is high-value target (compromise gives access to all encrypted data), trust required in escrow agent. Questions test: key escrow enables recovery of encrypted data, involves third-party storage, required for business continuity with encryption."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": false,
      "relatedTerms": ["Key Management", "Recovery", "Encryption", "Business Continuity"]
    }
  }
]
