[
  {
    "id": "d2-001",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Advanced Persistent Threat (APT)",
    "back": {
      "level1": "Sophisticated, well-funded threat actor conducting long-term targeted attacks",
      "level2": "Highly skilled attackers (often nation-state sponsored) who establish persistent presence in target networks to steal data or conduct espionage over extended periods. Characterized by: advanced tools, patience, specific targets, stealth, multiple attack vectors. Focus on high-value targets like governments, defense contractors, critical infrastructure.",
      "level3": "Exam tip: APTs are PERSISTENT (maintain long-term access), ADVANCED (sophisticated techniques), and TARGETED (specific organizations). Key characteristics: well-resourced, patient (months/years), use custom malware, employ multiple attack vectors, clean up tracks, often nation-state backed. Examples: Cozy Bear, Fancy Bear (Russia), Lazarus Group (North Korea), APT1 (China). Questions test knowing APT = long-term, sophisticated, typically state-sponsored threat focused on espionage/sabotage."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Nation-State", "Threat Actor", "Espionage", "Targeted Attack"]
    }
  },
  {
    "id": "d2-002",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Insider Threat",
    "back": {
      "level1": "Malicious or negligent threat from within the organization",
      "level2": "Current or former employees, contractors, or business partners who misuse authorized access to harm the organization. Types: Malicious (intentional sabotage, data theft, fraud), Negligent (careless with security, accidental data exposure), Compromised (external attacker using insider's credentials). Insiders have advantage of legitimate access, knowledge of systems, trust.",
      "level3": "Exam tip: Insider threats are DANGEROUS because they bypass perimeter defenses. Motivations: financial gain, revenge/disgruntlement, ideology, coercion. Indicators: unusual access patterns, large data downloads, accessing unrelated data, working odd hours, policy violations. Mitigations: least privilege, separation of duties, user behavior analytics (UEBA), monitoring privileged users, exit procedures, background checks, mandatory vacation. Questions test insider threat indicators and knowing insiders have authorized access making them hard to detect."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["UEBA", "Malicious Insider", "Negligent User", "Privilege Abuse"]
    }
  },
  {
    "id": "d2-003",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Hacktivist",
    "back": {
      "level1": "Attacker motivated by political, social, or ideological causes",
      "level2": "Individuals or groups conducting cyberattacks to promote political agenda, protest, or raise awareness for causes. Methods: website defacement, DDoS attacks, data leaks, disruption of services. Target organizations they oppose ideologically. Famous groups: Anonymous, LulzSec. Skill level varies from novice to sophisticated.",
      "level3": "Exam tip: Hacktivists are motivated by IDEOLOGY not financial gain. Characteristics: public attacks (want visibility), target organizations contradicting their beliefs, use disruptive tactics (DDoS, defacement, doxxing), claim responsibility publicly, variable sophistication. Compared to APTs: less persistent, noisier, less targeted precision, public not covert. Questions test knowing hacktivist motivation (ideology/protest) and typical tactics (DDoS, defacement, data leaks for exposure)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Anonymous", "DDoS", "Website Defacement", "Protest"]
    }
  },
  {
    "id": "d2-004",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Script Kiddie",
    "back": {
      "level1": "Inexperienced attacker using pre-made tools without understanding how they work",
      "level2": "Low-skill threat actors who use existing attack tools and scripts created by others. Limited technical knowledge, rely on automated tools, scripts, and exploits. Motivated by curiosity, recognition, or thrill. Targets are often opportunistic rather than specific. Can still cause damage despite low skill by using powerful tools.",
      "level3": "Exam tip: Script kiddies have LOW SKILL but can still be threats using readily available tools. Characteristics: use pre-built exploits, don't understand underlying technology, motivated by ego/recognition, opportunistic targets, noisy attacks (easily detected), limited persistence. Defenses: basic security (patching, firewall) stops most attacks. Questions test knowing script kiddie = low skill + automated tools, distinguishing from APT (sophisticated) or organized crime (professional)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Low Skill", "Automated Tools", "Opportunistic Attack"]
    }
  },
  {
    "id": "d2-005",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Organized Crime",
    "back": {
      "level1": "Financially motivated threat actors operating as criminal enterprises",
      "level2": "Professional criminal groups conducting cyberattacks for profit. Well-funded, organized operations with specialized roles (developers, money mules, call centers). Primary activities: ransomware, banking trojans, credit card theft, BEC (Business Email Compromise), cryptomining. Sophisticated operations with professional infrastructure and victim support (ransomware help desks).",
      "level3": "Exam tip: Organized crime is FINANCIALLY MOTIVATED with professional operations. Characteristics: profit-driven, sophisticated tooling, organized structure (like businesses), targets with money, professional infrastructure (C2, ransomware portals), negotiation processes. Common activities: ransomware-as-a-service (RaaS), BEC scams, banking malware, stolen credentials marketplace. Questions test knowing organized crime = financial motivation + professional operations, distinguishing from hacktivists (ideology) or nation-states (espionage)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Ransomware", "Financial Crime", "BEC", "RaaS"]
    }
  },
  {
    "id": "d2-006",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Nation-State Actor",
    "back": {
      "level1": "Government-sponsored threat actors conducting cyber operations for national interests",
      "level2": "State-sponsored groups conducting cyberattacks to advance national goals: espionage, sabotage, influence operations. Extremely well-resourced with custom tools, zero-days, and advanced techniques. Targets: governments, military, critical infrastructure, defense contractors, strategic industries. Patient, stealthy, persistent.",
      "level3": "Exam tip: Nation-states are MOST SOPHISTICATED threat actors. Characteristics: unlimited resources, custom malware, zero-day exploits, extreme patience (years-long operations), strategic targets, political motivations. Goals: intelligence gathering, IP theft, sabotage (Stuxnet), influence operations. Examples: China (IP theft), Russia (election interference), North Korea (financial/crypto), Iran (infrastructure). Questions test knowing nation-state = most advanced, state-sponsored, strategic goals beyond just financial gain."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["APT", "Espionage", "State-Sponsored", "Zero-Day"]
    }
  },
  {
    "id": "d2-007",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Shadow IT",
    "back": {
      "level1": "IT systems, devices, software, or services used without IT approval or knowledge",
      "level2": "Technology deployed by employees or departments without formal approval from IT/security. Examples: personal cloud storage for work files, unapproved SaaS apps, personal devices, rogue access points. Creates security risks: no security controls, data leakage, compliance violations, no support/patching, visibility gaps.",
      "level3": "Exam tip: Shadow IT is UNMANAGED technology posing security risks. Causes: users need functionality IT doesn't provide, IT approval too slow, convenience. Risks: data stored in unprotected locations, bypassing security controls (DLP, encryption), license/compliance violations, malware entry points, no backups. Discovery methods: CASB (Cloud Access Security Broker), network monitoring, expense reports. Mitigation: approved alternatives, user education, CASB enforcement, acceptable use policies. Questions test identifying shadow IT risks and knowing CASB helps discover/control it."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["CASB", "Rogue IT", "Unapproved Software", "Data Leakage"]
    }
  },
  {
    "id": "d2-008",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Phishing",
    "back": {
      "level1": "Social engineering attack using fraudulent emails to trick users into revealing information or clicking malicious links",
      "level2": "Email-based attack impersonating legitimate entities to steal credentials, distribute malware, or wire transfer fraud. Techniques: spoofed sender, urgency/fear tactics, malicious links/attachments, fake login pages. Variations: Spear phishing (targeted), Whaling (executives), Vishing (voice/phone), Smishing (SMS), Business Email Compromise (BEC).",
      "level3": "Exam tip: Phishing is MOST COMMON attack vector. Red flags: urgent language, spelling errors, suspicious sender, unexpected attachments, requests for credentials, mismatched URLs (hover to check), too good to be true offers. Spear phishing = targeted using personal info. Whaling = targeting executives/VIPs. BEC = impersonating executives for wire transfers. Defenses: user training, email filtering, DMARC/SPF/DKIM, anti-phishing tools, MFA (limits credential theft damage). Questions test identifying phishing indicators and knowing different phishing variants."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Spear Phishing", "Whaling", "Social Engineering", "BEC", "Credential Theft"]
    }
  },
  {
    "id": "d2-009",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Ransomware",
    "back": {
      "level1": "Malware that encrypts victim data and demands payment for decryption key",
      "level2": "Crypto-malware that encrypts files rendering them inaccessible, then demands ransom (typically cryptocurrency) for decryption. Modern ransomware: double extortion (encrypt + threaten to leak data), targets backups, fast encryption, C2 communication. Delivery: phishing, RDP exploitation, vulnerability exploitation. Ransomware-as-a-Service (RaaS) enables low-skill attackers.",
      "level3": "Exam tip: Ransomware is TOP CYBER THREAT currently. Attack flow: initial access (phish/RDP) → privilege escalation → lateral movement → exfiltrate data → encrypt systems → ransom demand. Defenses: offline backups (immutable), endpoint protection, network segmentation, MFA, user training, patch management, application whitelisting. Response: isolate immediately, DON'T pay (no guarantee, funds crime), restore from backups. Questions test ransomware characteristics and knowing proper response (isolate, don't pay, restore from backups)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Crypto-Malware", "Double Extortion", "RaaS", "Backup"]
    }
  },
  {
    "id": "d2-010",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "SQL Injection",
    "back": {
      "level1": "Code injection attack inserting malicious SQL commands into application input fields",
      "level2": "Web application vulnerability where attacker injects SQL code through user input (form fields, URL parameters) to manipulate database queries. Consequences: bypass authentication, retrieve sensitive data, modify/delete data, execute OS commands. Example: Login field with ' OR '1'='1 bypasses authentication.",
      "level3": "Exam tip: SQL injection is CRITICAL web vulnerability (OWASP Top 10). Attack methods: authentication bypass (always-true conditions), data extraction (UNION queries), blind SQLi (boolean/time-based), second-order injection. Prevention: parameterized queries/prepared statements (best), input validation, least privilege DB accounts, WAF, escape special characters, stored procedures. Testing: manual testing with quotes/boolean, automated scanners. Questions test knowing SQLi allows DB access through input and prevention using prepared statements."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Code Injection", "Web Application", "OWASP", "Prepared Statements"]
    }
  },
  {
    "id": "d2-011",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Cross-Site Scripting (XSS)",
    "back": {
      "level1": "Injection attack inserting malicious scripts into web pages viewed by other users",
      "level2": "Web vulnerability where attacker injects JavaScript into pages that execute in victim's browser. Types: Stored XSS (persistent - saved in DB), Reflected XSS (immediate - URL parameters), DOM-based XSS (client-side). Consequences: session hijacking (steal cookies), credential theft, website defacement, malware distribution, phishing.",
      "level3": "Exam tip: XSS exploits TRUST in website by victim's browser. Stored XSS most dangerous (affects all users viewing page). Reflected requires victim click malicious link. DOM-based purely client-side. Attack payload: <script>steal cookies</script>. Prevention: input validation, output encoding (escape HTML entities), Content Security Policy (CSP), HTTPOnly cookies (prevent JS access), sanitize user input. Questions test XSS types (stored/reflected/DOM) and knowing it executes in user's browser stealing sessions/credentials."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Web Application", "OWASP", "Session Hijacking", "CSP"]
    }
  },
  {
    "id": "d2-012",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Man-in-the-Middle (MitM)",
    "back": {
      "level1": "Attack where attacker intercepts communications between two parties without their knowledge",
      "level2": "Attacker positions themselves between victim and legitimate service to eavesdrop or manipulate communications. Methods: ARP poisoning, DNS spoofing, rogue Wi-Fi access points, SSL stripping. Consequences: credential theft, session hijacking, data theft, malware injection. Can be passive (eavesdrop) or active (modify traffic).",
      "level3": "Exam tip: MitM intercepts COMMUNICATION between parties. Attack scenarios: Evil twin (fake Wi-Fi), ARP spoofing (LAN), DNS poisoning (redirect to fake site), SSL stripping (downgrade HTTPS to HTTP). Prevention: encryption (TLS/SSL), certificate validation, VPN, HTTPS everywhere, mutual authentication, HSTS (HTTP Strict Transport Security). Detection: certificate warnings, unexpected ARP entries, DNS mismatches. Questions test MitM scenarios and knowing encryption/VPN prevents interception."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["ARP Poisoning", "SSL Stripping", "Evil Twin", "Interception"]
    }
  },
  {
    "id": "d2-013",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "DDoS (Distributed Denial of Service)",
    "back": {
      "level1": "Attack overwhelming target with traffic from multiple sources to make services unavailable",
      "level2": "Coordinated attack using botnet (compromised devices) to flood target with requests, exhausting resources and preventing legitimate access. Types: Volumetric (bandwidth exhaustion), Protocol (SYN flood, exploit TCP/IP), Application layer (HTTP flood, Slowloris). Amplification attacks use reflection to magnify traffic (DNS, NTP, Memcached).",
      "level3": "Exam tip: DDoS makes service UNAVAILABLE not compromise data. Attack types: Volumetric (overwhelm bandwidth - UDP flood), Protocol (exhaust server resources - SYN flood), Application (legitimate-looking requests - HTTP flood). Amplification: attacker spoofs victim IP, sends small request to reflectors, reflectors send large response to victim (magnification). Mitigation: DDoS scrubbing service, rate limiting, traffic filtering, CDN, redundancy, blackhole routing. Questions test DDoS goal (availability not confidentiality) and mitigation (scrubbing service, CDN)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Botnet", "SYN Flood", "Amplification", "Availability"]
    }
  },
  {
    "id": "d2-014",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Password Attacks",
    "back": {
      "level1": "Techniques to guess, crack, or steal user passwords",
      "level2": "Methods to compromise passwords: Brute force (try all combinations), Dictionary attack (common words), Rainbow table (precomputed hashes), Credential stuffing (reused passwords from breaches), Password spraying (common password against many accounts), Keylogging (capture keystrokes). Each method has different speed/success rates.",
      "level3": "Exam tip: Know different password attack methods. Brute force: tries ALL combinations (slow but guaranteed if enough time). Dictionary: tries common words (faster, effective on weak passwords). Rainbow table: precomputed hash lookup (fast but needs storage, defeated by salting). Credential stuffing: uses leaked passwords from other sites (effective due to password reuse). Password spraying: tries common password ('Password123') against many accounts (avoids lockout). Defenses: strong passwords, MFA, account lockout, password managers, check breached password lists, salted hashes."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Brute Force", "Dictionary Attack", "Rainbow Table", "Credential Stuffing"]
    }
  },
  {
    "id": "d2-015",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Social Engineering",
    "back": {
      "level1": "Psychological manipulation to trick people into revealing information or performing actions",
      "level2": "Non-technical attacks exploiting human psychology rather than technical vulnerabilities. Techniques: pretexting (fabricated scenario), baiting (offer something enticing), tailgating (physical unauthorized entry), quid pro quo (offer service for information), authority (impersonate authority figure), urgency/fear, scarcity. Most effective attack vector due to human element.",
      "level3": "Exam tip: Social engineering exploits PEOPLE not technology. Key principles: authority (pretend to be boss/IT), urgency (create time pressure), fear (threaten consequences), trust (build rapport), scarcity (limited opportunity). Common scenarios: fake tech support calls, CEO impersonation emails (whaling), USB drops (baiting), following employees into building (tailgating/piggybacking). Defense: security awareness training, verification procedures, challenge strangers, don't trust caller ID, escalation processes. Questions test social engineering techniques and knowing training is primary defense."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Pretexting", "Baiting", "Tailgating", "Human Element", "Security Awareness"]
    }
  },
  {
    "id": "d2-016",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Trojan Horse",
    "back": {
      "level1": "Malicious software disguised as legitimate program to trick users into installing it",
      "level2": "Malware masquerading as desirable software (game, utility, update) to deceive users into execution. Unlike viruses, doesn't self-replicate. Once installed: creates backdoor, steals data, downloads additional malware, establishes remote access. Common types: Remote Access Trojan (RAT), Banking Trojan, Downloader Trojan.",
      "level3": "Exam tip: Trojans use DECEPTION - appear legitimate but malicious. Delivery: software downloads, email attachments (fake invoice), fake updates, pirated software. RATs give attackers remote control. Banking trojans steal financial credentials. Downloaders fetch additional payloads. Prevention: download only from trusted sources, antivirus, user training, application whitelisting, verify digital signatures. Know difference: virus (self-replicates), worm (self-propagates), trojan (disguised, requires user action). Questions test knowing trojan = disguised malware requiring user to execute it."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["RAT", "Malware", "Backdoor", "Deception"]
    }
  },
  {
    "id": "d2-017",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Rootkit",
    "back": {
      "level1": "Malware designed to hide its presence and maintain privileged access to a system",
      "level2": "Stealthy malware providing persistent, privileged access while hiding from detection. Types: User-mode (application level), Kernel-mode (OS level - most powerful), Bootkit (boot sector), Firmware (BIOS/UEFI). Capabilities: hide processes, files, network connections, registry keys; intercept system calls; disable security software.",
      "level3": "Exam tip: Rootkits emphasize STEALTH and PERSISTENCE. Kernel rootkits operate at OS level with full system control, very difficult to detect/remove. Bootkits load before OS, even more persistent. Detection challenges: rootkit hides itself from OS, standard tools can't see it. Detection methods: memory analysis, behavioral monitoring, integrity checking, offline scanning (boot from clean media). Removal often requires OS reinstall. Prevention: Secure Boot (prevents bootkits), UEFI protection, kernel protections, antivirus. Questions test knowing rootkit = stealthy + privileged + hard to detect/remove."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Kernel Malware", "Bootkit", "Stealth", "Persistence"]
    }
  },
  {
    "id": "d2-018",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Keylogger",
    "back": {
      "level1": "Tool that records keystrokes to capture sensitive information like passwords",
      "level2": "Spyware monitoring and recording keyboard input. Types: Software (malware-based, installed via trojan), Hardware (physical device between keyboard and computer). Captures: passwords, credit cards, emails, messages. Sophisticated versions: screenshot capture, clipboard monitoring, form grabbing (capture before encryption).",
      "level3": "Exam tip: Keyloggers steal CREDENTIALS and sensitive typed data. Software keyloggers: installed via malware, runs in background, sends logs to attacker. Hardware keyloggers: physical device (USB adapter, keyboard circuit modification), can't be detected by antivirus. Detection: antivirus (software), physical inspection (hardware), unusual network traffic, unexpected processes. Prevention: antivirus, avoid untrusted software, physical security, virtual keyboards (for sensitive input), MFA (limits stolen credential value). Questions test keylogger types (software vs hardware) and knowing they capture credentials."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Spyware", "Credential Theft", "Hardware Keylogger", "Monitoring"]
    }
  },
  {
    "id": "d2-019",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Logic Bomb",
    "back": {
      "level1": "Malicious code that executes when specific conditions are met",
      "level2": "Malware programmed to trigger based on specific conditions: date/time, system event, user action, attacker command. Often planted by disgruntled insiders as retaliation (triggers after they leave). Payload: data deletion, system corruption, sabotage. Lies dormant until trigger condition met.",
      "level3": "Exam tip: Logic bomb has TRIGGER CONDITION and lies dormant until activated. Common triggers: specific date (time bomb - variant), user account deleted (insider revenge), file accessed, system reboot. Classic scenario: disgruntled IT employee plants logic bomb to trigger 30 days after termination. Detection: code review, behavior monitoring, integrity checking. Prevention: code reviews, separation of duties, monitoring privileged users, proper offboarding. Questions test knowing logic bomb = triggered by condition and often associated with insider threat."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Time Bomb", "Insider Threat", "Conditional Malware", "Sabotage"]
    }
  },
  {
    "id": "d2-020",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Buffer Overflow",
    "back": {
      "level1": "Vulnerability where program writes data beyond allocated memory buffer, potentially allowing code execution",
      "level2": "Programming error where input exceeds buffer size, overwriting adjacent memory. Consequences: crash program, overwrite return address to redirect execution, inject and execute malicious code (shellcode). Types: Stack overflow (stack memory), Heap overflow (heap memory). Classic vulnerability in C/C++ lacking automatic bounds checking.",
      "level3": "Exam tip: Buffer overflow OVERWRITES MEMORY to hijack execution. Attack process: find vulnerable input, send oversized input, overflow buffer into return address, redirect execution to attacker's code. Prevention: input validation (length checks), use safe functions (strncpy vs strcpy), memory protections (DEP/NX - prevents code execution in data areas, ASLR - randomizes memory addresses), bounds checking, modern languages (Java, Python have automatic bounds checking). Questions test buffer overflow allows code execution and knowing input validation + memory protections prevent it."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Memory Corruption", "Code Execution", "DEP", "ASLR", "Input Validation"]
    }
  },
  {
    "id": "d2-021",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Cross-Site Request Forgery (CSRF)",
    "back": {
      "level1": "Attack forcing authenticated user to execute unwanted actions on web application",
      "level2": "Exploits web application trust in user's browser. Attacker tricks victim's browser into sending malicious request to application where user is authenticated. Attack leverages existing session/cookies. Example: user logged into bank, visits malicious site, site triggers fund transfer using user's active session. Works because browser automatically sends cookies.",
      "level3": "Exam tip: CSRF exploits APPLICATION'S TRUST in user's browser. Key: victim is authenticated, attack uses victim's credentials/session, victim doesn't intend the action. Attack vector: malicious link, image tag, form auto-submit. Example: <img src='bank.com/transfer?to=attacker&amount=1000'> triggers when victim views page. Prevention: anti-CSRF tokens (random value checked server-side), SameSite cookie attribute, verify referer header, re-authentication for sensitive actions. Questions test CSRF uses existing session and anti-CSRF tokens prevent it."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Web Application", "Session Riding", "OWASP", "Anti-CSRF Token"]
    }
  },
  {
    "id": "d2-022",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "XML External Entity (XXE)",
    "back": {
      "level1": "Attack exploiting XML parsers to access files, execute code, or cause DoS",
      "level2": "Vulnerability in applications parsing XML input. Attacker includes malicious external entity reference in XML. Consequences: read local files (passwd, config), SSRF (server-side request to internal systems), denial of service (billion laughs attack - recursive entity expansion), remote code execution.",
      "level3": "Exam tip: XXE exploits XML PARSER to access server resources. Attack example: XML with <!ENTITY xxe SYSTEM 'file:///etc/passwd'> reads system files. SSRF variant: access internal services. Billion laughs: nested entities cause exponential expansion (DoS). Prevention: disable external entities in parser, use simple data formats (JSON), input validation, patch XML libraries, least privilege for parser process. Questions test knowing XXE allows file access through XML and prevention is disabling external entities."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": false,
      "relatedTerms": ["XML", "SSRF", "File Disclosure", "OWASP"]
    }
  },
  {
    "id": "d2-023",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Directory Traversal",
    "back": {
      "level1": "Attack manipulating file path references to access files outside intended directory",
      "level2": "Exploits insufficient input validation to access files/directories outside web root. Uses path manipulation: ../ (parent directory), absolute paths, URL encoding. Example: http://site.com/file.php?page=../../../../etc/passwd. Consequences: read sensitive files (passwords, config, source code), execute files, information disclosure.",
      "level3": "Exam tip: Directory traversal uses '../' to ESCAPE web root. Attack strings: ../../etc/passwd, ..\\..\\windows\\system32, URL-encoded %2e%2e%2f. Prevention: input validation (whitelist allowed files), canonicalization (resolve paths to prevent ../ tricks), chroot jail (restrict file access), least privilege (web server can't read sensitive files), avoid file parameter in URLs. Questions test knowing directory traversal accesses unauthorized files using ../ sequences and input validation prevents it."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Path Traversal", "File Inclusion", "Input Validation", "Web Application"]
    }
  },
  {
    "id": "d2-024",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Privilege Escalation",
    "back": {
      "level1": "Exploiting vulnerabilities to gain higher access privileges than authorized",
      "level2": "Attacker elevates permissions beyond intended level. Types: Vertical (low privilege to admin/root), Horizontal (access another user's resources at same level). Methods: exploit OS vulnerabilities, misconfigurations, weak permissions, SUID binaries (Unix), DLL hijacking (Windows), credential theft.",
      "level3": "Exam tip: Privilege escalation moves from LOW to HIGH privilege. Vertical examples: standard user → admin/root. Horizontal: User A → User B data. Common techniques: exploit unpatched vulnerabilities (kernel exploits), abuse SUID/sudo misconfigurations, DLL hijacking, token impersonation, exploit service misconfigurations. Prevention: patch systems, least privilege, remove unnecessary SUID, proper file permissions, UAC/sudo, monitor privileged activity. Questions test vertical vs horizontal escalation and knowing it follows initial compromise (attacker gets low access first, then escalates)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Lateral Movement", "SUID", "UAC", "Access Control"]
    }
  },
  {
    "id": "d2-025",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Watering Hole Attack",
    "back": {
      "level1": "Compromising websites frequently visited by target group to infect visitors",
      "level2": "Targeted attack strategy: identify websites target organization frequents, compromise those sites with malware, wait for targets to visit and get infected. Analogous to predator waiting at watering hole. More effective than direct attack as targets trust these sites. Often uses zero-day exploits for stealthy infection.",
      "level3": "Exam tip: Watering hole is INDIRECT targeted attack. Process: reconnaissance (identify target's browsing habits), compromise trusted sites they visit (industry forums, news sites, vendor sites), inject exploit, victims infected when visiting. Used by APTs for strategic targets. Prevention: patch browsers/plugins, browser isolation, threat intelligence (known compromised sites), network segmentation, EDR, user awareness. Questions test knowing watering hole compromises trusted sites frequented by targets, distinguishing from direct phishing."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Targeted Attack", "APT", "Strategic Compromise", "Indirect Attack"]
    }
  },
  {
    "id": "d2-026",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Supply Chain Attack",
    "back": {
      "level1": "Compromising third-party vendor or software supplier to attack ultimate targets",
      "level2": "Infiltrating target organization by compromising less-secure supplier/vendor. Attack types: compromised software updates (SolarWinds), malicious hardware (implants), compromised vendor access, third-party breaches exposing data. Affects many organizations through single compromise. Difficult to detect as compromised component is trusted.",
      "level3": "Exam tip: Supply chain attacks target WEAKEST LINK in chain. Famous examples: SolarWinds (compromised software updates infected 18,000+ orgs), Target breach (HVAC vendor credentials), NotPetya (accounting software update). Attack surfaces: software updates, hardware, managed services, vendor access. Prevention: vendor security assessments, code signing verification, software composition analysis, network segmentation for vendor access, zero trust, supply chain risk management. Questions test knowing supply chain compromises trusted vendor/software to reach ultimate targets."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Third-Party Risk", "SolarWinds", "Vendor Compromise", "Software Update"]
    }
  },
  {
    "id": "d2-027",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "DNS Poisoning (DNS Spoofing)",
    "back": {
      "level1": "Corrupting DNS cache to redirect victims to malicious sites",
      "level2": "Attack inserting fake DNS records into resolver cache, causing users to be directed to attacker-controlled sites when requesting legitimate domains. Methods: exploit vulnerable DNS servers, MitM to intercept/modify DNS responses, compromise local hosts file. Consequences: phishing (fake banking site), malware distribution, traffic interception.",
      "level3": "Exam tip: DNS poisoning REDIRECTS traffic by corrupting DNS. Attack targets: DNS resolver cache, local hosts file (/etc/hosts, C:\\Windows\\System32\\drivers\\etc\\hosts). Kaminsky attack: exploits DNS protocol to poison caches. Prevention: DNSSEC (cryptographic DNS authentication), secure DNS resolvers, monitor DNS for anomalies, host file integrity monitoring, use DNS over HTTPS (DoH). Detection: unexpected DNS responses, certificate warnings (HTTPS to fake site). Questions test DNS poisoning redirects users via fake DNS entries and DNSSEC prevents it."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["DNS Spoofing", "Cache Poisoning", "DNSSEC", "Pharming"]
    }
  },
  {
    "id": "d2-028",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "ARP Poisoning (ARP Spoofing)",
    "back": {
      "level1": "Sending fake ARP messages to associate attacker's MAC with victim's IP address",
      "level2": "Layer 2 attack on local network. Attacker sends spoofed ARP replies associating their MAC address with target IP (gateway or another host). Traffic meant for victim flows through attacker enabling MitM. Consequences: intercept traffic, session hijacking, DoS (drop packets), inject packets.",
      "level3": "Exam tip: ARP poisoning enables MitM on LOCAL NETWORK. Process: attacker sends fake ARP replies, victims update ARP cache with attacker's MAC, traffic flows through attacker. Tools: Ettercap, Cain & Abel. Uses: intercept credentials, modify traffic, DoS. Prevention: static ARP entries (impractical), Dynamic ARP Inspection (DAI - switch feature validating ARP), port security (MAC limiting), network segmentation, encryption (limits interception value). Questions test ARP poisoning enables MitM on LAN and DAI prevents it."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["MitM", "ARP Spoofing", "DAI", "Layer 2 Attack"]
    }
  },
  {
    "id": "d2-029",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Evil Twin",
    "back": {
      "level1": "Rogue Wi-Fi access point impersonating legitimate network to intercept traffic",
      "level2": "Attacker sets up fake access point with same SSID as legitimate network. Victims unknowingly connect to evil twin instead of real network. Attacker can: intercept all traffic, perform MitM, capture credentials, inject malware, redirect to phishing sites. Often combined with deauth attack (disconnect users from real AP forcing reconnection).",
      "level3": "Exam tip: Evil twin is ROGUE ACCESS POINT with legitimate-looking name. Setup: attacker near target network (coffee shop, airport), creates AP with same SSID, stronger signal or deauth real AP users, victims connect automatically. Consequences: capture credentials, intercept data, downgrade encryption (SSL strip). Prevention: verify network legitimacy, VPN (encrypt traffic end-to-end), verify certificates, disable auto-connect, use WPA2/3 Enterprise (mutual auth), 802.1X authentication. Questions test evil twin = fake AP with same SSID and VPN protects against it."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Rogue AP", "MitM", "Wi-Fi Attack", "Deauth Attack"]
    }
  },
  {
    "id": "d2-030",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Replay Attack",
    "back": {
      "level1": "Intercepting and retransmitting valid data to gain unauthorized access",
      "level2": "Attacker captures legitimate communication (authentication, transaction) and replays it later to impersonate user or duplicate action. Example: capture authentication token, replay to gain access. Works when system doesn't verify communication freshness. Can affect: authentication, transactions, commands.",
      "level3": "Exam tip: Replay attack RETRANSMITS captured legitimate data. Attack: intercept valid session/auth token → replay later to authenticate/perform action. Example: capture Kerberos ticket, replay to access resources. Prevention: timestamps (reject old messages), nonce (one-time random value), sequence numbers, session tokens (expire quickly), mutual authentication, encryption (prevents capture but doesn't stop replay alone - need freshness mechanism). Questions test replay attack uses previously valid data and timestamps/nonces prevent it."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Session Hijacking", "Nonce", "Timestamp", "Authentication"]
    }
  },
  {
    "id": "d2-031",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Pass-the-Hash",
    "back": {
      "level1": "Using stolen password hash to authenticate without cracking the password",
      "level2": "Attack where attacker extracts password hash from compromised system and uses it directly for authentication without needing plaintext password. Works because some protocols (NTLM, older Kerberos) accept hash for auth. Enables lateral movement in Windows environments after initial compromise.",
      "level3": "Exam tip: Pass-the-Hash authenticates with HASH not password (no cracking needed). Process: compromise system, extract hashes from memory/SAM, use hash for authentication to other systems. Common in Windows with NTLM. Tools: Mimikatz, Metasploit. Prevention: restrict admin accounts, credential guard (Windows protects LSASS), least privilege, network segmentation, monitor for lateral movement, require Kerberos, privileged access management (PAM). Questions test pass-the-hash uses stolen hash for auth and knowing it enables lateral movement in Windows."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Lateral Movement", "NTLM", "Windows", "Mimikatz", "Credential Theft"]
    }
  },
  {
    "id": "d2-032",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Fileless Malware",
    "back": {
      "level1": "Malware operating in memory without writing files to disk, evading traditional detection",
      "level2": "Advanced malware executing entirely in RAM using legitimate system tools (PowerShell, WMI, VBScript). Leaves no traditional file-based artifacts making it difficult to detect with signature-based antivirus. Persistence: registry, WMI event subscriptions, scheduled tasks pointing to scripts. Examples: living-off-the-land (LoL) attacks.",
      "level3": "Exam tip: Fileless malware is MEMORY-RESIDENT and uses LEGITIMATE TOOLS. Techniques: PowerShell empire, WMI for persistence, macros downloading/executing in memory, DLL injection, reflective loading. Advantages for attacker: evades file-based detection, leverages trusted tools (whitelisted), harder to forensically analyze. Detection: behavioral analysis, EDR (monitors process activity), memory scanning, PowerShell logging, script block logging. Prevention: application whitelisting, PowerShell Constrained Language Mode, disable macros. Questions test fileless = memory-based + legitimate tools + hard to detect."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Memory-Based", "PowerShell", "Living-off-the-Land", "EDR"]
    }
  },
  {
    "id": "d2-033",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Zero-Day Vulnerability",
    "back": {
      "level1": "Previously unknown vulnerability with no patch available",
      "level2": "Software vulnerability unknown to vendor and public, therefore no patch exists. 'Zero-day' = zero days to fix before exploitation. Highly valuable: used by APTs, sold on black market, hoarded by intelligence agencies. When actively exploited before patch, called zero-day exploit. Difficult to defend against.",
      "level3": "Exam tip: Zero-day = UNKNOWN + NO PATCH available. Lifecycle: vulnerability exists → discovered by researcher/attacker → (if attacker) exploited in wild → vendor learns of it → patch developed → patch deployed. Time between discovery and patch = window of vulnerability. Defense without patch: IPS signatures (if exploit pattern known), behavioral detection, WAF, segmentation, least privilege, disable vulnerable features. Questions test zero-day means no patch exists and defense relies on behavior-based detection not signatures."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["APT", "Exploit", "Vulnerability", "Unknown Threat"]
    }
  },
  {
    "id": "d2-034",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Race Condition",
    "back": {
      "level1": "Vulnerability where system behavior depends on timing and sequence of events",
      "level2": "Flaw occurring when multiple processes access shared resource and outcome depends on execution order. Time-of-check to time-of-use (TOCTOU): check authorization, brief delay, use resource - state changes between check and use. Example: check file permissions (authorized) → attacker replaces file → system uses new file (unauthorized).",
      "level3": "Exam tip: Race condition exploits TIMING between check and use. Classic example: ATM withdrawal - check balance (sufficient) → simultaneously withdraw from two ATMs → both succeed before balance update → overdraft. TOCTOU in file systems: check file is safe → symbolic link swap → system uses malicious file. Prevention: atomic operations (check+use together), proper locking, avoiding shared state, mutex/semaphores, transaction isolation. Questions test race condition = timing-dependent vulnerability and prevention uses atomic operations/locking."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": false,
      "relatedTerms": ["TOCTOU", "Timing Attack", "Concurrency"]
    }
  },
  {
    "id": "d2-035",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Insecure Direct Object Reference (IDOR)",
    "back": {
      "level1": "Access control vulnerability where application exposes internal object references without authorization checks",
      "level2": "Web vulnerability exposing direct references to internal objects (files, database keys, URLs). Attacker modifies reference to access unauthorized data. Example: /viewInvoice?id=123 → change to id=124 to view another user's invoice. Occurs when application doesn't verify user authorized for referenced object.",
      "level3": "Exam tip: IDOR is broken ACCESS CONTROL through predictable references. Examples: sequential IDs (increment to access others' data), file paths in URLs, database keys exposed. Attack: observe pattern, modify reference, access unauthorized resources. Prevention: indirect references (session-specific mapping), access control checks (verify ownership), unpredictable IDs (UUIDs), post-authentication authorization checks. Common in APIs and web apps. Questions test IDOR = accessing unauthorized data by changing reference parameter and prevention requires access control checks."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["OWASP", "Access Control", "Web Application", "Authorization"]
    }
  },
  {
    "id": "d2-036",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Improper Error Handling",
    "back": {
      "level1": "Verbose error messages revealing sensitive system information to attackers",
      "level2": "Application displaying detailed error messages to users revealing: stack traces, database structure, file paths, software versions, internal logic. Information helps attackers: understand system architecture, identify vulnerabilities, craft targeted attacks. Example: SQL error showing table schema or database version.",
      "level3": "Exam tip: Verbose errors provide INFORMATION DISCLOSURE aiding attackers. Examples: stack traces (file paths, code flow), database errors (table names, query structure), version info (known vulnerabilities for that version). Prevention: generic error messages to users ('An error occurred'), detailed logging server-side only, custom error pages, disable debug mode in production, exception handling. Know difference: users see generic message, logs contain details for troubleshooting. Questions test improper error handling reveals system info and solution is generic user-facing messages with detailed server logs."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Information Disclosure", "Stack Trace", "Error Messages"]
    }
  },
  {
    "id": "d2-037",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Weak Cipher Suites",
    "back": {
      "level1": "Use of outdated or vulnerable encryption algorithms enabling decryption or exploitation",
      "level2": "Supporting weak cryptographic algorithms: DES, 3DES, RC4, MD5, SHA-1, SSL, TLS 1.0/1.1. Vulnerabilities: insufficient key length, algorithm weaknesses, known attacks. Allows: traffic decryption, MitM attacks, downgrade attacks (force weaker cipher). Compliance violations (PCI DSS requires TLS 1.2+).",
      "level3": "Exam tip: Weak ciphers enable DECRYPTION and downgrade attacks. Deprecated: DES (56-bit key), 3DES (legacy), RC4 (stream cipher vulnerabilities), MD5 (collisions), SHA-1 (collisions), SSL (all versions), TLS 1.0/1.1. Current: AES (128/256-bit), SHA-256/384/512, TLS 1.2/1.3, ECDHE (forward secrecy). Attacks: BEAST, POODLE, CRIME (exploit weak SSL/TLS). Prevention: disable weak ciphers, enforce modern TLS 1.2+, prefer forward secrecy (ECDHE), scan for weak ciphers. Questions test weak ciphers enable decryption and TLS 1.2+ with strong ciphers required."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Encryption", "TLS", "SSL", "Cryptography", "Downgrade Attack"]
    }
  },
  {
    "id": "d2-038",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Unpatched Systems",
    "back": {
      "level1": "Systems missing security updates, leaving known vulnerabilities exploitable",
      "level2": "Failure to apply vendor patches creates exposure to known, documented vulnerabilities with public exploits. Reasons for not patching: testing requirements, change management delays, legacy systems, lack of awareness. Consequences: ransomware (WannaCry/EternalBlue), remote code execution, privilege escalation, data breaches.",
      "level3": "Exam tip: Unpatched = KNOWN exploitable vulnerabilities. Famous examples: WannaCry (SMBv1), Equifax breach (Apache Struts), Exchange ProxyLogon. Vulnerability window: disclosure → patch release → deployment. Attackers scan for unpatched systems (easy targets). Patch prioritization: CVSS score, exploitability, criticality, exposure. Challenges: testing time, downtime requirements, legacy unsupported systems. Compensating controls when can't patch: network segmentation, IPS signatures, disable vulnerable features, virtual patching. Questions test unpatched systems = known vulnerabilities and patch management critical."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Patch Management", "Vulnerability", "CVE", "Security Updates"]
    }
  },
  {
    "id": "d2-039",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Default Credentials",
    "back": {
      "level1": "Systems using manufacturer's default usernames and passwords",
      "level2": "Devices/applications shipped with preset credentials (admin/admin, admin/password) that users fail to change. Easily exploited as defaults are publicly known (manufacturer documentation, online databases). Common in: network devices, IoT, industrial systems, applications. Attackers scan for devices and try default credentials.",
      "level3": "Exam tip: Default credentials are PUBLICLY KNOWN and easily exploited. Vulnerable devices: routers, IP cameras, IoT devices, printers, industrial control systems (SCADA). Databases of defaults: DefaultPassword.us, manufacturer docs. Mirai botnet exploited IoT default credentials. Prevention: force password change on first login, security baselines requiring changes, automated scanning for defaults, disable default accounts. Questions test default credentials = easy unauthorized access and force change on first use prevents it."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["IoT Security", "Hardening", "Misconfiguration", "Password Security"]
    }
  },
  {
    "id": "d2-040",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Open Ports and Services",
    "back": {
      "level1": "Unnecessary network services and ports increasing attack surface",
      "level2": "Running unneeded services expands attack surface. Each service is potential vulnerability entry point. Examples: telnet, FTP, SMB, RDP exposed to internet. Attackers scan for open ports (nmap), identify services, exploit known vulnerabilities. Principle: disable everything not required.",
      "level3": "Exam tip: Open services = increased ATTACK SURFACE. Common vulnerable services: telnet (unencrypted, port 23), FTP (unencrypted, port 21), SMB (port 445 - ransomware target), RDP (port 3389 - brute force target), unnecessary HTTP/HTTPS admin interfaces. Discovery: port scanning (nmap, Masscan). Prevention: disable unnecessary services, firewall (block unused ports), change default ports (security through obscurity - weak but additive), network segmentation, principle of least functionality. Questions test unnecessary services = increased attack surface and disable/firewall prevents exploitation."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Port Scanning", "Attack Surface", "Hardening", "Service Hardening"]
    }
  },
  {
    "id": "d2-041",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Network Segmentation",
    "back": {
      "level1": "Dividing network into isolated segments to limit lateral movement and contain breaches",
      "level2": "Creating separate network zones with controlled communication between them. Implementations: VLANs (virtual LANs), firewalls between segments, DMZ for external-facing services, microsegmentation (granular isolation). Benefits: limit breach scope, enforce access policies, reduce attack surface, regulatory compliance (PCI DSS requires segmentation).",
      "level3": "Exam tip: Segmentation contains breaches and prevents LATERAL MOVEMENT. Common segments: user network, server network, DMZ (internet-facing), guest Wi-Fi, management (SCADA/ICS), development. Traffic between segments flows through firewall/access controls. Microsegmentation: software-defined isolation (even within same VLAN). Zero trust architecture relies on segmentation. Benefits: contain ransomware spread, protect critical assets, reduce compliance scope. Questions test segmentation limits lateral movement and DMZ isolates external-facing services."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["VLAN", "DMZ", "Lateral Movement", "Microsegmentation", "Zero Trust"]
    }
  },
  {
    "id": "d2-042",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Application Whitelisting",
    "back": {
      "level1": "Allowing only approved applications to execute, blocking all others by default",
      "level2": "Security control permitting only explicitly authorized software to run. Default deny approach - everything blocked except whitelist. Prevents: malware execution, unauthorized software, ransomware, fileless attacks using unauthorized tools. Implementations: AppLocker (Windows), Software Restriction Policies, application control solutions.",
      "level3": "Exam tip: Whitelisting uses DEFAULT DENY (opposite of blacklist/antivirus). Implementation methods: file path, file hash, digital signature, publisher certificate. Benefits: stops unknown malware (including zero-days), prevents unauthorized software, limits attack tools. Challenges: maintenance overhead (must approve legitimate updates), user resistance (can't install whatever they want), false positives. Know difference: antivirus blacklists known bad, whitelisting allows known good. Questions test whitelisting = default deny + approved apps only and stops unknown malware."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["AppLocker", "Default Deny", "Execution Control", "Zero-Day Defense"]
    }
  },
  {
    "id": "d2-043",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Input Validation",
    "back": {
      "level1": "Verifying user input meets expected format and constraints before processing",
      "level2": "Security control checking input for proper format, type, length, range, allowed characters before using it. Prevents injection attacks (SQL, command, XSS, XXE). Two approaches: whitelist (allow only expected - better) vs blacklist (block known bad - incomplete). Validates: data type, length, format, range, allowed characters.",
      "level3": "Exam tip: Input validation prevents INJECTION ATTACKS. Implementation: whitelist approach (regex for expected format), type checking (integer not string), length limits (prevent buffer overflow), allowed characters only (alphanumeric), range validation (1-100). Server-side validation required (client-side bypassable). Prevents: SQL injection, XSS, command injection, buffer overflow, directory traversal. Parameterized queries complement validation for SQL injection. Questions test input validation prevents injection attacks and whitelist approach (allow good) better than blacklist (block bad)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["SQL Injection", "XSS", "Whitelist", "Secure Coding"]
    }
  },
  {
    "id": "d2-044",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Web Application Firewall (WAF)",
    "back": {
      "level1": "Security appliance filtering HTTP traffic to protect web applications from attacks",
      "level2": "Firewall specifically for web applications analyzing HTTP/HTTPS traffic. Protects against: SQL injection, XSS, CSRF, DDoS, bot attacks. Deployment: reverse proxy (inline), bridge mode, cloud-based. Uses: signature rules (known attacks), behavioral analysis, rate limiting. Virtual patching capability.",
      "level3": "Exam tip: WAF protects WEB APPLICATIONS at Layer 7. Defends against: injection attacks, XSS, CSRF, DDoS (application layer), broken authentication, data exposure. Virtual patching: WAF blocks exploit while waiting for code patch (compensating control). Deployment modes: inline (blocks attacks), monitor (alerts only), cloud WAF (CDN-integrated). Configuration: OWASP ModSecurity Core Rule Set, custom rules. Limitations: can't fix vulnerable code (defense in depth), requires tuning (false positives). Questions test WAF protects web apps from OWASP Top 10 attacks and provides virtual patching."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["ModSecurity", "OWASP", "Virtual Patching", "Layer 7 Firewall"]
    }
  },
  {
    "id": "d2-045",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Sandboxing",
    "back": {
      "level1": "Isolating applications in restricted environment to prevent system-wide damage",
      "level2": "Execution environment with limited access to system resources. Untrusted code runs in sandbox isolated from OS and other apps. If malware executes in sandbox, contained without spreading. Uses: browser tabs, mobile apps, malware analysis, email attachment scanning. Technologies: containers, VMs, OS-level isolation.",
      "level3": "Exam tip: Sandboxing provides ISOLATION limiting blast radius. Examples: browser sandbox (compromised tab can't access OS), mobile app sandbox (apps can't access each other's data), email sandbox (detonate attachments safely). Malware analysis: execute suspicious files in sandbox to observe behavior without risk. Technologies: Docker/containers, virtual machines, Windows Sandbox, SELinux, AppArmor, Chrome/Firefox process isolation. Benefits: zero-day protection (malware contained even if unknown), safe testing. Questions test sandboxing isolates untrusted code preventing system compromise."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Isolation", "Containerization", "Browser Security", "Malware Analysis"]
    }
  },
  {
    "id": "d2-046",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Security Awareness Training",
    "back": {
      "level1": "Educating users about security threats and safe practices",
      "level2": "Regular training teaching employees to recognize and respond to security threats. Topics: phishing recognition, password security, social engineering, physical security, data handling, incident reporting. Methods: mandatory training (hire/annual), simulated phishing, role-based content, ongoing awareness campaigns. Most cost-effective control addressing human element.",
      "level3": "Exam tip: Training addresses HUMAN element - weakest link. Effective programs: mandatory at hire and annually, simulated phishing (measure and improve), real-world examples, role-specific (developers get secure coding), engaging not just slides, metrics tracked. Key topics: identifying phishing emails, reporting suspicious activity, password best practices, social engineering tactics, physical security (tailgating, clean desk), mobile device security. Know: training reduces successful phishing, creates security culture, required by many regulations. Questions test training is primary defense against social engineering and phishing."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Human Element", "Phishing", "Social Engineering", "Security Culture"]
    }
  },
  {
    "id": "d2-047",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Patch Management",
    "back": {
      "level1": "Systematic process for identifying, testing, and deploying security updates",
      "level2": "Structured approach to keeping systems updated with security patches. Process: identify missing patches (vulnerability scans), prioritize (CVSS, exploitability), test (non-production), deploy (staged rollout), verify. Balance: security urgency vs stability risk. Emergency patches for active exploitation may skip/accelerate testing.",
      "level3": "Exam tip: Patch management is CRITICAL vulnerability mitigation. Challenges: testing time (patch may break things), downtime (production impact), legacy systems (unsupported), change management. Prioritization factors: CVSS score, exploit availability (CISA KEV catalog), system criticality, exposure (internet-facing). Process: scan for vulnerabilities → prioritize → test in dev/staging → deploy to production (staged) → verify. Virtual patching (WAF/IPS) when can't patch immediately. Questions test patch management reduces known vulnerabilities and testing before production deployment important."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Vulnerability Management", "Change Management", "CVE", "CVSS"]
    }
  },
  {
    "id": "d2-048",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Encryption at Rest and in Transit",
    "back": {
      "level1": "Protecting data with encryption when stored and when transmitted over networks",
      "level2": "At Rest: encrypting stored data (databases, files, backups, drives). Prevents data theft from stolen devices/media. Technologies: full disk encryption (FDE), database encryption, file-level encryption. In Transit: encrypting data moving across networks. Prevents interception. Technologies: TLS/SSL, VPN, SSH, IPSec.",
      "level3": "Exam tip: Encryption protects CONFIDENTIALITY if data stolen/intercepted. At Rest examples: BitLocker (Windows), FileVault (Mac), LUKS (Linux), database TDE (Transparent Data Encryption). Protects against: stolen laptops, discarded drives, physical theft. In Transit examples: HTTPS (TLS), VPN, SSH, SFTP. Protects against: network sniffing, MitM. Key management critical: encryption useless if keys compromised. Know: encrypt sensitive data (PII, PHI, financial), required by regulations (GDPR, HIPAA). Questions test encryption at rest protects stored data and encryption in transit prevents interception."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["TLS", "FDE", "Data Protection", "Confidentiality"]
    }
  },
  {
    "id": "d2-049",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Multi-Factor Authentication (MFA)",
    "back": {
      "level1": "Requiring multiple forms of verification before granting access",
      "level2": "Authentication using two or more factors from different categories: Something you know (password), Something you have (token, phone), Something you are (biometric). Prevents account compromise even with stolen passwords. Common implementations: SMS codes, authenticator apps, hardware tokens (YubiKey), push notifications.",
      "level3": "Exam tip: MFA prevents access with JUST stolen password. Authentication factors: knowledge (password, PIN), possession (phone, token, smart card), inherence (fingerprint, face, retina), location (GPS), behavior (typing pattern). Two-factor (2FA) is subset of MFA. Best practices: use for privileged accounts, VPN access, cloud services, admin panels. MFA fatigue attacks: bombardment with push notifications until user approves. Phishing-resistant MFA: FIDO2/WebAuthn, hardware tokens (can't be phished). Questions test MFA requires multiple factor types and prevents credential theft damage."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["2FA", "Authentication", "Token", "Biometric", "FIDO2"]
    }
  },
  {
    "id": "d2-050",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Disabling Unnecessary Services",
    "back": {
      "level1": "Removing or turning off unneeded network services and features to reduce attack surface",
      "level2": "Security hardening practice: disable services/features not required for system function. Each service is potential vulnerability. Examples: disable guest accounts, remove unnecessary protocols (telnet, FTP), stop unused services (print spooler on server), remove unnecessary software. Implements principle of least functionality.",
      "level3": "Exam tip: Disabling unnecessary services reduces ATTACK SURFACE. Common removals: telnet (use SSH instead), FTP (use SFTP/FTPS), guest accounts, default shares, unnecessary Windows features, unused network protocols, sample/demo applications. Benefits: fewer vulnerabilities to patch, reduced complexity, better performance, compliance (minimize functionality). Process: inventory services, determine business necessity, disable unnecessary, document changes. Hardening guides: CIS Benchmarks, DISA STIGs specify services to disable. Questions test disabling unnecessary services = attack surface reduction following least functionality principle."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Hardening", "Attack Surface", "Least Functionality", "CIS Benchmarks"]
    }
  },
  {
    "id": "d2-051",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Security Groups and ACLs",
    "back": {
      "level1": "Access control lists defining allowed/denied network traffic based on rules",
      "level2": "Network access controls filtering traffic. ACLs: rules on routers/firewalls permitting/denying traffic based on IP, port, protocol. Security Groups (cloud): virtual firewall for instances specifying inbound/outbound rules. Both implement network-level access control. Default deny recommended (explicitly allow only required traffic).",
      "level3": "Exam tip: ACLs/Security Groups enforce NETWORK access control. ACLs: stateless (each direction separate rule), router/firewall, permit/deny based on source/dest IP, port, protocol. Security Groups (AWS, Azure): stateful (return traffic auto-allowed), instance-level firewall, allow rules (implicit deny). Best practices: default deny, least privilege (only required traffic), document rules, regular review, logging. Questions test ACLs control network access and default deny (allow only required) is secure approach."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Firewall", "Network Security", "Cloud Security", "Default Deny"]
    }
  },
  {
    "id": "d2-052",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "System Hardening",
    "back": {
      "level1": "Reducing system attack surface by applying security configurations and removing unnecessary components",
      "level2": "Process of securing system by minimizing vulnerabilities and attack surface. Activities: disable unnecessary services, remove unused software, apply security patches, configure secure settings, implement least privilege, enable logging, change defaults. Standards: CIS Benchmarks, DISA STIGs provide hardening guidance.",
      "level3": "Exam tip: Hardening REDUCES attack surface through secure configuration. OS hardening: disable unnecessary services/accounts, strong passwords, file permissions, encrypt drives, enable firewall, audit policies, security updates. Application hardening: remove default accounts, disable debugging, secure configurations, input validation. Network hardening: ACLs, disable unused ports/protocols, segmentation. Process: baseline image (gold image), automated scanning (SCAP), continuous compliance. Questions test hardening reduces vulnerabilities through configuration and CIS Benchmarks/DISA STIGs provide hardening standards."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["CIS Benchmarks", "DISA STIG", "Attack Surface", "Gold Image"]
    }
  },
  {
    "id": "d2-053",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Email Security (SPF, DKIM, DMARC)",
    "back": {
      "level1": "Email authentication protocols preventing spoofing and phishing",
      "level2": "SPF (Sender Policy Framework): DNS record listing IPs authorized to send for domain. DKIM (DomainKeys Identified Mail): cryptographic signature proving email authenticity. DMARC (Domain-based Message Authentication): policy telling receivers what to do with failed SPF/DKIM (reject, quarantine). Together prevent email spoofing.",
      "level3": "Exam tip: SPF, DKIM, DMARC prevent EMAIL SPOOFING. SPF: receiving server checks if sending IP authorized for sender domain. DKIM: cryptographic signature in header verified by receiver. DMARC: combines SPF+DKIM, provides reporting, specifies failure action (none/quarantine/reject). Benefits: reduce phishing, prevent domain spoofing, improve deliverability. Implementation: publish DNS records, monitor reports, enforce policy. Questions test these protocols prevent email spoofing and DMARC uses SPF+DKIM results to enforce policy."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Phishing", "Email Spoofing", "SPF", "DKIM", "DMARC"]
    }
  },
  {
    "id": "d2-054",
    "domain": 2,
    "section": "Threat Actors",
    "type": "concept",
    "front": "Competitor",
    "back": {
      "level1": "Business rivals conducting corporate espionage to gain competitive advantage",
      "level2": "Threat actor from competing organization seeking trade secrets, customer lists, pricing, product plans, or proprietary information. Methods: hiring insiders, social engineering, hacking, dumpster diving, physical surveillance. Motivation: market advantage, undermining competition. May use third-party contractors to avoid attribution.",
      "level3": "Exam tip: Competitors seek BUSINESS ADVANTAGE through information theft. Targets: intellectual property, M&A plans, customer data, pricing strategies, product roadmaps, R&D. Methods: recruit disgruntled employees, plant spies, cyber intrusion, attend conferences (social engineering). Defense: NDAs, data classification, insider threat program, employee awareness, physical security, clean desk policy, competitive intelligence monitoring. Questions test competitor threat = corporate espionage for business advantage and NDA + data classification help protect."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": false,
      "relatedTerms": ["Corporate Espionage", "Intellectual Property", "Trade Secrets"]
    }
  },
  {
    "id": "d2-055",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Pharming",
    "back": {
      "level1": "Redirecting users from legitimate websites to fraudulent ones without their knowledge",
      "level2": "Attack manipulating DNS or host files to redirect traffic to fake sites. Unlike phishing (requires clicking link), pharming redirects automatically. Methods: DNS poisoning, malware modifying hosts file, compromised router DNS settings. Victims enter credentials on fake site thinking it's legitimate.",
      "level3": "Exam tip: Pharming is automated REDIRECTION (vs phishing = clickbait). Attack methods: DNS cache poisoning (corrupt resolver), modify local hosts file via malware, compromise home router (change DNS to attacker's server). Result: user types legitimate URL, gets redirected to fake site. More dangerous than phishing (no suspicious email to notice). Prevention: DNSSEC, secure home routers (change default passwords, firmware updates), antivirus, verify SSL certificates, bookmark important sites. Questions test pharming = automatic redirect vs phishing = requires user click."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["DNS Poisoning", "Phishing", "Redirection", "Hosts File"]
    }
  },
  {
    "id": "d2-056",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Typosquatting (URL Hijacking)",
    "back": {
      "level1": "Registering domain names similar to legitimate sites to trick users via typos",
      "level2": "Cybersquatting variant registering misspelled domains (gooogle.com, faceboook.com) capturing traffic from typos. Also: different TLD (facebook.net vs .com), character substitution (zero for O). Malicious uses: phishing, malware distribution, brand damage. Legitimate uses: defensive registration by companies.",
      "level3": "Exam tip: Typosquatting exploits USER TYPING ERRORS. Techniques: common misspellings (gogle.com), doubled letters (paypall.com), wrong TLD (.net vs .com), homograph attacks (use similar-looking characters from different alphabets), missing letter (goole.com). Uses: collect credentials, serve malware, ad revenue, resell domain. Prevention: user awareness, bookmark important sites, defensive domain registration (buy common typos), trademark monitoring. Questions test typosquatting = registering misspelled domains to capture typo traffic."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Cybersquatting", "Phishing", "Domain Hijacking", "Homograph Attack"]
    }
  },
  {
    "id": "d2-057",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Credential Stuffing",
    "back": {
      "level1": "Using stolen username/password pairs from one breach to access other services",
      "level2": "Automated attack using lists of credentials from data breaches attempting to log into other services. Succeeds due to password reuse - users use same password across multiple sites. Attackers use botnets to avoid rate limiting. Different from brute force (tries many passwords for one account).",
      "level3": "Exam tip: Credential stuffing exploits PASSWORD REUSE across sites. Process: obtain breach data (millions of username/password pairs), use automated tools/bots, attempt logins on target sites (banks, email, shopping), successful logins = account takeover. High success rate due to widespread password reuse. Prevention: user education (unique passwords), password managers, MFA (limits damage), monitor for breached passwords (haveibeenpwned.com API), CAPTCHA, rate limiting, bot detection. Questions test credential stuffing = reused passwords from breaches and MFA prevents account takeover."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Password Reuse", "Data Breach", "Account Takeover", "Botnet"]
    }
  },
  {
    "id": "d2-058",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Spear Phishing",
    "back": {
      "level1": "Targeted phishing attack using personalized information to trick specific individuals",
      "level2": "Highly targeted phishing using research about victim to craft convincing message. Attackers gather info from social media, company websites, LinkedIn. Email appears relevant and legitimate (references projects, colleagues, interests). Higher success rate than generic phishing. Often first stage of APT attacks.",
      "level3": "Exam tip: Spear phishing is TARGETED using personal info (vs mass phishing). Process: select target, research victim (social media, LinkedIn, public records), craft personalized message (reference real projects/people), send convincing email. Whaling is spear phishing targeting executives/VIPs. Success factors: appears from known contact, timely/relevant content, creates urgency. Prevention: training (recognize even targeted attacks), email authentication (SPF/DKIM/DMARC), verify requests out-of-band (phone call), limit public information sharing. Questions test spear phishing = personalized/targeted vs generic phishing = mass distribution."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Whaling", "Targeted Attack", "Social Engineering", "APT"]
    }
  },
  {
    "id": "d2-059",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Vishing and Smishing",
    "back": {
      "level1": "Vishing: voice/phone phishing; Smishing: SMS/text message phishing",
      "level2": "Vishing (Voice Phishing): phone calls impersonating legitimate organizations (bank, IRS, tech support) to steal information or money. Uses urgency, fear, authority. Smishing (SMS Phishing): phishing via text messages with malicious links or requesting sensitive info. Mobile users more susceptible (smaller screen, less security awareness).",
      "level3": "Exam tip: Vishing = PHONE, Smishing = SMS variants of phishing. Vishing scenarios: fake IRS demanding payment, bank fraud alert requesting verification, tech support scam. Caller ID spoofing makes calls appear legitimate. Smishing: fake delivery notifications, account alerts, prize winnings with malicious links. Mobile considerations: harder to verify URLs on small screen, less security software. Prevention: verify caller independently (call back official number), don't click text links (go to site directly), awareness training, don't trust caller ID. Questions test vishing/smishing = phone/SMS phishing variants."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Phishing", "Social Engineering", "Mobile Security", "Caller ID Spoofing"]
    }
  },
  {
    "id": "d2-060",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Cryptojacking",
    "back": {
      "level1": "Unauthorized use of victim's computing resources to mine cryptocurrency",
      "level2": "Malware or malicious scripts using victim's CPU/GPU to mine cryptocurrency (Monero, Bitcoin) for attacker's profit. Infection: malicious websites (JavaScript miners), malware, compromised ads. Symptoms: high CPU usage, slow performance, overheating, increased electricity. Often goes unnoticed if miner throttles usage.",
      "level3": "Exam tip: Cryptojacking steals COMPUTING RESOURCES for cryptocurrency mining. Delivery: browser-based (JavaScript like Coinhive while visiting site), persistent malware (stays after closing browser), IoT devices, cloud instances. Impact: degraded performance, hardware wear, increased costs (electricity, cloud compute). Detection: unusual CPU usage, unknown processes, network traffic to mining pools. Prevention: browser extensions blocking miners, antivirus, script blockers, monitor resource usage, patch systems. Questions test cryptojacking = unauthorized resource use for crypto mining and high CPU usage is indicator."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Cryptocurrency", "Mining Malware", "Resource Hijacking", "Performance"]
    }
  },
  {
    "id": "d2-061",
    "domain": 2,
    "section": "Attack Vectors",
    "type": "attack",
    "front": "Business Email Compromise (BEC)",
    "back": {
      "level1": "Sophisticated scam targeting businesses to transfer funds or data through email fraud",
      "level2": "Targeted attack compromising or impersonating business email accounts for financial fraud. Common scenarios: CEO fraud (fake executive email requesting wire transfer), invoice scam (altered vendor payment details), W-2 scam (HR targeted for employee data), real estate wire fraud. Often combines social engineering and technical compromise.",
      "level3": "Exam tip: BEC targets BUSINESSES for wire transfer fraud. Attack types: CEO fraud/whaling (impersonate executive urgently requesting transfer), vendor email compromise (actual vendor account hacked, sends invoice with attacker's bank details), attorney impersonation, account compromise (actual employee account hacked). Success factors: urgency, authority, appears legitimate. FBI reports billions in losses. Prevention: multi-person approval for wire transfers, verify requests out-of-band (phone call), email authentication (DMARC), financial controls, training. Questions test BEC = executive impersonation for wire fraud and out-of-band verification prevents it."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["CEO Fraud", "Wire Transfer Fraud", "Email Compromise", "Financial Fraud"]
    }
  },
  {
    "id": "d2-062",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "Misconfiguration",
    "back": {
      "level1": "Insecure system settings creating vulnerabilities through improper configuration",
      "level2": "Security weakness from incorrect or insecure configuration. Examples: default credentials, open storage buckets (S3), excessive permissions, unnecessary services, exposed admin interfaces, missing security headers, debug mode in production, unencrypted communications. Often easier to exploit than software vulnerabilities.",
      "level3": "Exam tip: Misconfiguration is HUMAN ERROR in system setup. Common issues: cloud storage publicly accessible (S3 buckets), databases exposed to internet, default passwords unchanged, overly permissive firewall rules, unnecessary services enabled, missing security patches, directory listing enabled, verbose errors in production. OWASP A05:2021 - Security Misconfiguration. Prevention: security baselines (CIS, DISA STIGs), automated configuration scanning, infrastructure as code (consistent deployments), least privilege, security hardening, regular audits. Questions test misconfiguration = improper settings and automated scanning/baselines prevent it."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Cloud Security", "S3 Bucket", "Default Credentials", "Hardening"]
    }
  },
  {
    "id": "d2-063",
    "domain": 2,
    "section": "Vulnerability Types",
    "type": "concept",
    "front": "End-of-Life (EOL) Systems",
    "back": {
      "level1": "Unsupported systems no longer receiving security updates from vendor",
      "level2": "Hardware/software past manufacturer support date. No security patches, updates, or vendor assistance. Vulnerabilities remain unpatched, attackers target EOL systems knowing they won't be fixed. Examples: Windows 7/XP, outdated server OS, legacy applications, old network devices. Common in healthcare, industrial control systems.",
      "level3": "Exam tip: EOL systems have UNPATCHED vulnerabilities forever. Risks: known exploits never fixed, no vendor support, compliance violations, targeted by attackers (easy targets). Why still used: business-critical legacy apps, cost of replacement, testing/certification requirements (medical devices), specialized hardware dependencies. Mitigations when can't replace: network segmentation (isolate), application whitelisting, enhanced monitoring, compensating controls, virtual patching (IPS/WAF). Questions test EOL = no patches/support and segmentation/isolation mitigates risk when can't replace."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Legacy Systems", "Unsupported Software", "Segmentation", "Compensating Controls"]
    }
  },
  {
    "id": "d2-064",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Configuration Management",
    "back": {
      "level1": "Systematically managing system configurations to maintain security and consistency",
      "level2": "Process ensuring systems configured securely and consistently. Includes: baseline configurations (gold images), change control, configuration drift detection, automated deployment, version control for configs. Tools: Ansible, Puppet, Chef, Infrastructure as Code (Terraform). Prevents misconfigurations and ensures compliance.",
      "level3": "Exam tip: Configuration management ensures CONSISTENT secure state. Components: Configuration baselines (approved secure settings), CMDB (tracks all config items), automation (Ansible/Puppet deploy consistent configs), drift detection (alert when deviates from baseline), version control (Git for configs), change management (controlled updates). Benefits: reduce misconfigurations, consistent security, faster deployment, compliance, easy rollback. Infrastructure as Code (IaC): configs in version-controlled files. Questions test configuration management maintains secure consistent state and prevents drift from baselines."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Baseline", "CMDB", "Ansible", "IaC", "Drift Detection"]
    }
  },
  {
    "id": "d2-065",
    "domain": 2,
    "section": "Mitigation Techniques",
    "type": "concept",
    "front": "Secure Coding Practices",
    "back": {
      "level1": "Development techniques preventing common vulnerabilities in software",
      "level2": "Security-focused programming practices. Key practices: input validation, output encoding, parameterized queries (prevent SQL injection), error handling (no sensitive info disclosure), authentication/authorization checks, secure session management, cryptographic standards, dependency management. Follows OWASP guidance, security by design principles.",
      "level3": "Exam tip: Secure coding PREVENTS vulnerabilities during development. OWASP Top 10 prevention: input validation + parameterized queries (SQLi), output encoding (XSS), anti-CSRF tokens (CSRF), proper auth/authz (broken access), secure password storage (hashing + salting), updated dependencies (known vulnerabilities), secure session management, error handling (no stack traces to users). Processes: code review, static analysis (SAST), developer training, security testing (DAST), threat modeling. Questions test secure coding prevents OWASP vulnerabilities and input validation + parameterized queries prevent injection."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["OWASP", "SAST", "DAST", "Input Validation", "Parameterized Queries"]
    }
  }
]
