[
  {
    "id": "d5-001",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Security Governance",
    "back": {
      "level1": "Framework of policies, procedures, and controls that guide security decision-making",
      "level2": "The system by which an organization directs and controls its information security activities. Governance establishes accountability, assigns roles and responsibilities, ensures alignment with business objectives, and provides oversight of security programs through policies, standards, and procedures.",
      "level3": "Exam tip: Governance is about WHO makes decisions and HOW (strategy, oversight). Different from management which is WHAT gets done (tactical execution). Key elements: board/executive oversight, security policies, defined roles (CISO, security committee), metrics and reporting. Know the hierarchy: Governance (board) → Management (executives) → Operations (staff). Questions often test distinguishing governance vs management, or identifying proper oversight roles."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["GRC", "Policies", "CISO", "Board Oversight"]
    }
  },
  {
    "id": "d5-002",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Management Process",
    "back": {
      "level1": "Identify → Assess → Respond → Monitor",
      "level2": "The cyclical process of managing organizational risk: (1) Identify threats, vulnerabilities, and assets, (2) Assess likelihood and impact to determine risk level, (3) Respond by accepting, mitigating, transferring, or avoiding risk, (4) Monitor for changes and effectiveness of controls. Continuous cycle.",
      "level3": "Exam tip: Know this is a continuous cycle, not one-time activity. Identify uses threat modeling, vulnerability assessments, asset inventory. Assess uses qualitative (high/medium/low) or quantitative (dollar values, probabilities) methods. Response strategies: Accept (acknowledge and live with it), Mitigate (implement controls to reduce), Transfer (insurance, outsource), Avoid (eliminate the activity). Monitor ensures controls remain effective. Questions test proper sequence and which response strategy for scenarios."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Risk Assessment", "Risk Response", "NIST RMF"]
    }
  },
  {
    "id": "d5-003",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Response Strategies",
    "back": {
      "level1": "Accept, Mitigate (Reduce), Transfer, Avoid",
      "level2": "Accept: acknowledge risk and take no action. Mitigate: implement controls to reduce likelihood or impact. Transfer: shift risk to third party via insurance or outsourcing. Avoid: eliminate the activity causing risk. Choice depends on risk level, cost of controls, and risk appetite.",
      "level3": "Exam tip: MEMORIZE these four strategies. Accept is used for low-risk or when cost of controls exceeds impact (but must be formally documented and approved). Mitigate is most common - deploying firewalls, encryption, training. Transfer includes cyber insurance and outsourcing to cloud providers (they assume some risk). Avoid is most extreme - don't offer the risky service, shut down vulnerable system. Can't transfer or avoid all risks. Questions test selecting appropriate strategy for scenarios based on risk level and cost."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Risk Management", "Risk Mitigation", "Cyber Insurance", "Risk Acceptance"]
    }
  },
  {
    "id": "d5-004",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Qualitative vs Quantitative Risk Assessment",
    "back": {
      "level1": "Qualitative: subjective ratings (High/Medium/Low); Quantitative: numerical values (dollars, probabilities)",
      "level2": "Qualitative uses descriptive scales and expert judgment to rate risk (e.g., High likelihood, Medium impact). Faster and easier but subjective. Quantitative uses numerical calculations like ALE (Annual Loss Expectancy) = SLE × ARO. More precise but requires extensive data and is time-consuming.",
      "level3": "Exam tip: Know when to use each. Qualitative: faster, good for initial assessments, when data is limited, comparing many risks. Quantitative: for high-value assets, cost-benefit analysis of controls, regulatory requirements. Common quantitative formulas: SLE (Single Loss Expectancy) = Asset Value × Exposure Factor; ALE (Annual Loss Expectancy) = SLE × ARO (Annual Rate of Occurrence). Questions often require calculating ALE or choosing assessment type for scenarios. Remember: most organizations use qualitative for efficiency."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Risk Assessment", "ALE", "SLE", "ARO", "Exposure Factor"]
    }
  },
  {
    "id": "d5-005",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "GDPR",
    "back": {
      "level1": "General Data Protection Regulation",
      "level2": "European Union privacy regulation protecting personal data of EU residents. Applies to any organization processing EU citizen data regardless of organization location. Requires consent for data processing, right to access/deletion, breach notification within 72 hours, and Data Protection Officer for large-scale processing.",
      "level3": "Exam tip: GDPR has EXTRATERRITORIAL reach - applies to US companies processing EU citizen data. Key requirements: lawful basis for processing (consent, contract, legal obligation), data minimization, breach notification in 72 hours, right to be forgotten (erasure), data portability. Fines up to 4% of global revenue or €20M. Know the difference from other privacy laws: GDPR is strictest with highest penalties. Questions test requirements, scope, and key rights (access, erasure, portability, restriction)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "PII", "Data Protection", "DPO", "Right to be Forgotten"]
    }
  },
  {
    "id": "d5-006",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "HIPAA",
    "back": {
      "level1": "Health Insurance Portability and Accountability Act",
      "level2": "US federal law protecting health information privacy and security. Applies to covered entities (healthcare providers, insurers, clearinghouses) and business associates. Requires administrative, physical, and technical safeguards for PHI (Protected Health Information), breach notification, and patient rights to access records.",
      "level3": "Exam tip: HIPAA protects PHI (Protected Health Information). Key rules: Privacy Rule (patient rights, minimum necessary use), Security Rule (administrative/physical/technical safeguards for ePHI), Breach Notification Rule (notify within 60 days). Applies to covered entities AND business associates (vendors handling PHI). Security Rule requires: risk assessment, encryption of ePHI at rest and in transit, access controls, audit logs. Violations result in tiered penalties. Questions test PHI protection requirements and who HIPAA applies to."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["PHI", "ePHI", "Privacy", "Healthcare", "Business Associate"]
    }
  },
  {
    "id": "d5-007",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "PCI DSS",
    "back": {
      "level1": "Payment Card Industry Data Security Standard",
      "level2": "Security standard for organizations that handle credit card information. Mandated by card brands (Visa, Mastercard, etc.) not government. Requires: secure network, protect cardholder data with encryption, vulnerability management, access controls, monitoring, and security policy. Annual assessment required.",
      "level3": "Exam tip: PCI DSS has 12 requirements across 6 goals: (1-2) Build and maintain secure network/systems, (3-4) Protect cardholder data, (5-6) Maintain vulnerability management program, (7-9) Implement access controls, (10-11) Monitor and test networks, (12) Maintain security policy. Key requirements: encrypt card data in transit and storage (or don't store it), restrict access on need-to-know basis, assign unique ID to each person with computer access, log and monitor all access. Questions test requirements and scope (applies to anyone storing/processing/transmitting card data)."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Compliance", "Credit Cards", "Cardholder Data", "Encryption"]
    }
  },
  {
    "id": "d5-008",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "Security Policy Types",
    "back": {
      "level1": "Organizational (high-level), System-specific (technical), Issue-specific (focused)",
      "level2": "Organizational: broad, strategic policies from leadership covering entire security program. System-specific: technical policies for particular systems (firewall policy, encryption policy). Issue-specific: addresses specific security topics (acceptable use, remote access, incident response).",
      "level3": "Exam tip: Know the hierarchy: Policies (high-level mandatory rules) → Standards (specific mandatory requirements) → Guidelines (recommended practices) → Procedures (step-by-step instructions). Organizational policies are board-approved and broad ('protect information assets'). System-specific are technical ('all databases must use AES-256'). Issue-specific address behaviors ('users must not share passwords'). Questions test distinguishing policy levels and knowing which type addresses specific situations."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Policies", "Standards", "Guidelines", "Procedures"]
    }
  },
  {
    "id": "d5-009",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "Acceptable Use Policy (AUP)",
    "back": {
      "level1": "Defines proper and improper use of organizational IT resources",
      "level2": "Policy that specifies what users can and cannot do with company systems, networks, and data. Covers: internet usage, email, software installation, personal use, prohibited activities (hacking, illegal downloads), and consequences for violations. Users typically must acknowledge upon hiring and annually.",
      "level3": "Exam tip: AUP is one of the most common security policies. Key elements: scope (who it applies to), acceptable uses (business purposes, limited personal use), prohibited activities (illegal content, unauthorized access, malware distribution, excessive personal use), monitoring notice (users should be informed), consequences of violations. Know that AUP helps establish reasonable expectation of privacy and supports legal action against violators. Questions test what belongs in AUP and why users must acknowledge it."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Policies", "User Behavior", "Monitoring", "Legal"]
    }
  },
  {
    "id": "d5-010",
    "domain": 5,
    "section": "Security Awareness",
    "type": "concept",
    "front": "Security Awareness Training",
    "back": {
      "level1": "Education program to teach employees about security threats and proper practices",
      "level2": "Regular training covering: phishing recognition, password security, physical security, social engineering, data handling, incident reporting. Should be: mandatory for all users, conducted at hire and annually, tailored to roles, include testing (simulated phishing), and track completion.",
      "level3": "Exam tip: Security awareness addresses the human element - weakest link in security. Key topics: identifying phishing emails, creating strong passwords, recognizing social engineering, securing devices, reporting suspicious activity, data classification handling. Know that effectiveness measured through: training completion rates, simulated phishing click rates, reported incidents. Best practices: ongoing (not one-time), role-based content (developers get different training than finance), engaging (not just PowerPoint), measured. Questions test components of effective training programs."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Training", "Phishing", "Human Element", "Social Engineering"]
    }
  },
  {
    "id": "d5-011",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Register",
    "back": {
      "level1": "Document that identifies and tracks organizational risks and their treatments",
      "level2": "A living document cataloging identified risks with details: risk description, likelihood, impact, risk score, owner, current controls, residual risk, treatment plan, and status. Used for risk tracking, prioritization, and communication to stakeholders.",
      "level3": "Exam tip: Risk register is a key risk management tool. Typical fields: Risk ID, Description, Category (strategic/operational/financial/compliance), Likelihood (probability), Impact (severity), Inherent Risk (before controls), Current Controls, Residual Risk (after controls), Treatment (accept/mitigate/transfer/avoid), Owner (accountable person), Status, Review Date. Updated regularly as new risks emerge and treatments are implemented. Used for reporting to executives and board. Questions test understanding of what goes in risk register and how it's used in risk management process."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Risk Management", "Risk Tracking", "Residual Risk", "Inherent Risk"]
    }
  },
  {
    "id": "d5-012",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Business Impact Analysis (BIA)",
    "back": {
      "level1": "Process to identify critical business functions and impact of disruptions",
      "level2": "Analyzes business processes to determine: criticality, dependencies, Maximum Tolerable Downtime (MTD), Recovery Time Objective (RTO), Recovery Point Objective (RPO), and impact of outages (financial, operational, reputational). Used for business continuity and disaster recovery planning.",
      "level3": "Exam tip: BIA drives BC/DR planning by identifying WHAT needs to be recovered and HOW FAST. Key metrics: MTD (maximum time business can survive without function), RTO (target recovery time), RPO (maximum acceptable data loss measured in time). Example: Email system might have MTD=24hrs, RTO=4hrs, RPO=1hr. BIA process: identify critical functions, determine dependencies, assess impacts (quantitative and qualitative), define recovery priorities. Output feeds into DR planning. Questions test understanding of MTD/RTO/RPO and BIA process."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["BCP", "DRP", "RTO", "RPO", "MTD", "Business Continuity"]
    }
  },
  {
    "id": "d5-013",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "concept",
    "front": "Data Classification",
    "back": {
      "level1": "Categorizing data based on sensitivity to determine appropriate protection levels",
      "level2": "Process of labeling data according to sensitivity and impact if disclosed. Common classifications: Public (no harm), Internal (limited harm), Confidential (significant harm), Restricted/Highly Confidential (severe harm). Each level has required security controls for handling, storage, transmission, and disposal.",
      "level3": "Exam tip: Data classification drives security controls. Government uses: Unclassified, Confidential, Secret, Top Secret. Private sector often uses: Public, Internal, Confidential, Restricted. Each level requires specific controls - e.g., Restricted data requires encryption at rest/transit, strict access controls, detailed audit logging. Know that data should be classified by DATA OWNER (not IT), and classification should be reviewed periodically. Labels can be manual or automatic (DLP). Questions test matching controls to classification levels and knowing who classifies data."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Data Handling", "DLP", "Data Owner", "Confidentiality"]
    }
  },
  {
    "id": "d5-014",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Separation of Duties (SoD)",
    "back": {
      "level1": "Security principle requiring multiple people to complete sensitive tasks",
      "level2": "Control that divides critical functions among different people to prevent fraud and error. No single person should be able to complete a sensitive transaction alone. Example: person who approves payments cannot also execute them; developer cannot deploy code to production without review.",
      "level3": "Exam tip: SoD prevents fraud, errors, and abuse of privilege. Classic example: accounts payable - different people should: create vendor, approve purchase, issue payment, reconcile accounts. In IT: developers shouldn't have production access, change approval should be separate from implementation, backup/restore should be different from daily admin. When SoD isn't feasible due to small staff, implement COMPENSATING CONTROLS like detailed logging, management review, dual approval. Questions test identifying where SoD is needed and recognizing violations."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Security Controls", "Fraud Prevention", "Least Privilege", "Compensating Controls"]
    }
  },
  {
    "id": "d5-015",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Change Management",
    "back": {
      "level1": "Formal process for requesting, reviewing, approving, and documenting system changes",
      "level2": "Structured approach to modifying IT systems: (1) Submit change request with details and justification, (2) Review by Change Advisory Board (CAB), (3) Approve/reject based on risk and impact, (4) Schedule change during maintenance window, (5) Implement with backout plan, (6) Verify and document. Reduces unplanned outages.",
      "level3": "Exam tip: Change management prevents unauthorized or untested changes that cause outages. Key elements: formal request process, risk assessment, testing in non-prod, CAB approval, scheduled maintenance windows, backout plan (how to reverse if it fails), documentation. Know emergency change process (expedited approval for urgent security patches). Common failure: changes without approval causing outages. Questions test proper change management process and identifying what requires change control (answer: nearly everything except emergency security patches may have expedited process)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["CAB", "Configuration Management", "ITIL", "Backout Plan"]
    }
  },
  {
    "id": "d5-016",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "concept",
    "front": "Data Retention Policy",
    "back": {
      "level1": "Rules defining how long to keep data and when to securely delete it",
      "level2": "Policy specifying retention periods for different data types based on legal, regulatory, and business requirements. Includes: what data to retain, how long (emails 7 years, logs 1 year), storage location, and secure disposal method. Balances compliance requirements against storage costs and legal discovery risks.",
      "level3": "Exam tip: Retention policy addresses two competing concerns: retain long enough for compliance/legal but not longer than necessary (storage costs, discovery risk). Requirements come from: regulations (SOX requires 7 years for financial records, HIPAA 6 years for medical), legal statutes of limitations, business needs. Must include SECURE DISPOSAL procedures (degaussing, shredding, cryptographic erasure). Applies to all media: electronic, paper, backups. Know that retaining too long increases eDiscovery costs and risk. Questions test knowing retention requirements and proper disposal."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Data Lifecycle", "Disposal", "Compliance", "eDiscovery"]
    }
  },
  {
    "id": "d5-017",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "Clean Desk Policy",
    "back": {
      "level1": "Requirement to secure sensitive materials when leaving workspace",
      "level2": "Security policy requiring employees to clear desks of sensitive documents and lock computers when away. Prevents unauthorized access to information via shoulder surfing or theft of unattended materials. Part of physical security controls addressing human behavior.",
      "level3": "Exam tip: Clean desk is a simple but effective physical security control. Requirements typically include: lock away sensitive documents, lock computer when leaving (Windows+L), don't leave passwords visible, secure removable media, clear whiteboards of sensitive info. Related: clean screen policy (no sensitive info on displays visible to others). Easy to implement and enforce. Often combined with clear screen policy. Questions test identifying this as appropriate control for physical security scenarios like preventing information disclosure to visitors or cleaning crew."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Physical Security", "Data Protection", "Security Policies"]
    }
  },
  {
    "id": "d5-018",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Third-Party Risk Management",
    "back": {
      "level1": "Process for assessing and managing risks from vendors and partners",
      "level2": "Evaluating security risks introduced by third parties who access systems, data, or facilities. Includes: vendor risk assessments before contracts, security requirements in agreements, ongoing monitoring, and right to audit. Addresses supply chain risks and vendor security incidents.",
      "level3": "Exam tip: Third-party risk is significant because vendor breach can compromise your organization (Target breach via HVAC vendor). Key activities: pre-contract security assessment, require security standards in contracts (SLAs), ongoing monitoring of vendor security posture, incident notification requirements, right to audit clauses, business continuity validation. Know that cloud providers, SaaS vendors, contractors, and service providers all introduce risk. Common issues: vendor has weaker security, shared responsibility confusion, lack of visibility. Questions test vendor risk assessment and contract requirements."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Vendor Management", "Supply Chain", "SLA", "Risk Assessment"]
    }
  },
  {
    "id": "d5-019",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "SOC 2",
    "back": {
      "level1": "Service Organization Control 2 - Audit report on service provider's controls",
      "level2": "Voluntary compliance standard for service providers (SaaS, cloud, data centers) demonstrating controls over security, availability, processing integrity, confidentiality, and privacy. Type I (controls designed properly at point in time) or Type II (controls operating effectively over period - preferred). Third-party CPA audited.",
      "level3": "Exam tip: SOC 2 is for SERVICE PROVIDERS to prove security to CUSTOMERS. Based on Trust Services Criteria: Security (required), Availability, Processing Integrity, Confidentiality, Privacy (optional). Type I is snapshot (controls exist), Type II covers 6-12 months (controls work). Different from SOC 1 (financial controls for auditors). Know that SOC 2 reports are confidential (shared under NDA with customers), unlike SOC 3 (public summary). Questions test knowing SOC 2 purpose, Type I vs Type II difference, and that it's for service providers."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Compliance", "Audit", "Service Provider", "Trust Services Criteria"]
    }
  },
  {
    "id": "d5-020",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Mandatory Vacation",
    "back": {
      "level1": "Security control requiring employees to take consecutive days off",
      "level2": "Policy requiring employees, especially those in sensitive positions, to take mandatory consecutive time off (typically 1-2 weeks annually) during which someone else performs their duties. Fraud detection control - continuous schemes often require daily attention to conceal, so forced absence exposes irregularities.",
      "level3": "Exam tip: Mandatory vacation is a DETECTIVE control for insider fraud. Requires actual absence (not just off but checking email) and someone else performing duties. Most effective when combined with job rotation. Classic use cases: financial roles, system administrators, privileged users. Historical examples: fraud discovered when person on mandatory vacation and replacement finds discrepancies. Know this is different from regular vacation - must be CONSECUTIVE days and duties MUST be reassigned. Questions test identifying this control for fraud detection scenarios."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Detective Controls", "Fraud Prevention", "Job Rotation", "Insider Threat"]
    }
  },
  {
    "id": "d5-021",
    "domain": 5,
    "section": "Security Awareness",
    "type": "concept",
    "front": "Phishing Simulation",
    "back": {
      "level1": "Controlled test sending fake phishing emails to employees to measure awareness",
      "level2": "Security awareness program component that sends simulated phishing emails to employees to test their ability to recognize and report phishing attempts. Tracks metrics like click rate and report rate. Those who click receive immediate training (teachable moment). Used to measure training effectiveness and target additional education.",
      "level3": "Exam tip: Phishing simulation is a MEASUREMENT tool for security awareness effectiveness. Best practices: start easy and increase difficulty, immediate training for clickers (not punishment), vary phishing types (credential harvest, malware, urgency), run regularly (quarterly), track trends, celebrate reporters. Know that goal is EDUCATION not punishment - shaming users is counterproductive. Metrics tracked: click rate (lower is better), report rate (higher is better), improvement over time. Questions test knowing this measures awareness and proper use (educational not punitive)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Security Awareness", "Training", "Phishing", "Metrics"]
    }
  },
  {
    "id": "d5-022",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Security Metrics and KPIs",
    "back": {
      "level1": "Measurable values demonstrating security program effectiveness",
      "level2": "Quantitative measures used to track security performance and communicate status to stakeholders. Examples: mean time to detect (MTTD), mean time to respond (MTTR), patch compliance percentage, number of critical vulnerabilities, phishing click rate, security training completion. Should be actionable, measurable, and aligned with business objectives.",
      "level3": "Exam tip: Metrics demonstrate security program value and drive improvement. Good metrics are SMART: Specific, Measurable, Actionable, Relevant, Time-bound. Common metrics: MTTD (faster is better), MTTR (faster is better), number of incidents (context needed), patching compliance % (higher is better), critical vulns open (lower is better). Know difference between LEADING indicators (predict future - training completion, vulnerability scans) and LAGGING indicators (past performance - incidents, breaches). Questions test selecting appropriate metrics for scenarios and understanding metric value."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["KPI", "MTTD", "MTTR", "Reporting", "Performance Measurement"]
    }
  },
  {
    "id": "d5-023",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Appetite vs Risk Tolerance",
    "back": {
      "level1": "Appetite: Amount of risk willing to accept; Tolerance: Acceptable deviation from appetite",
      "level2": "Risk Appetite is the broad amount and type of risk an organization is willing to take to achieve objectives (set by board/executives). Risk Tolerance is the acceptable level of variation from appetite for specific risks (operational limits). Appetite is strategic, tolerance is tactical.",
      "level3": "Exam tip: Appetite is HIGH-LEVEL strategic direction from leadership. Example: 'We accept moderate cybersecurity risk to enable innovation.' Tolerance sets SPECIFIC LIMITS. Example: 'No critical vulnerabilities older than 30 days.' Think: Appetite is policy, Tolerance is enforcement threshold. Risk Threshold is specific point triggering action. Know that these guide risk response decisions - risks within tolerance may be accepted, beyond tolerance must be addressed. Questions test distinguishing between appetite and tolerance, or identifying which stakeholder sets each (board sets appetite, management sets tolerance)."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Risk Management", "Risk Threshold", "Governance", "Executive"]
    }
  },
  {
    "id": "d5-024",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "concept",
    "front": "Privacy Impact Assessment (PIA)",
    "back": {
      "level1": "Analysis of how personally identifiable information is collected, used, shared, and maintained",
      "level2": "Systematic evaluation performed before implementing systems that collect, store, or process PII. Identifies privacy risks and ensures compliance with privacy regulations. Documents: what PII is collected, why, how it's protected, who has access, retention period, and user rights. Required by many privacy regulations.",
      "level3": "Exam tip: PIA is done BEFORE implementing new systems handling PII (proactive, not reactive). Key questions answered: Is PII collection necessary? Is collection minimized? How is PII protected? How long retained? Are users informed? Can users access/delete data? Required by GDPR (called DPIA - Data Protection Impact Assessment), federal systems, and many privacy laws. Know that PIA helps identify privacy risks early when they're cheaper to fix. Questions test knowing when PIA is required and what it assesses."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "PII", "GDPR", "DPIA", "Risk Assessment"]
    }
  },
  {
    "id": "d5-025",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "Information Security Roles",
    "back": {
      "level1": "Data Owner, Data Custodian, Data Processor, Data Controller",
      "level2": "Data Owner: business executive with authority over data classification and access decisions. Data Custodian: IT staff implementing and maintaining technical protections. Data Processor: entity processing data on behalf of controller. Data Controller: determines purposes and means of processing (GDPR term).",
      "level3": "Exam tip: MEMORIZE role distinctions. Owner (business) DECIDES sensitivity and who gets access. Custodian (IT) IMPLEMENTS controls like encryption and backups. User ACCESSES data per owner's permissions. Processor HANDLES data per controller's instructions (think cloud provider). Controller DETERMINES how data is used (think company using cloud). Know that Owner is accountable (business risk), Custodian is responsible (technical implementation). Questions test identifying proper role for specific activities: classifying data = Owner, configuring encryption = Custodian, defining data processing purposes = Controller."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Data Governance", "GDPR", "Data Classification", "Accountability"]
    }
  },
  {
    "id": "d5-026",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "SOX",
    "back": {
      "level1": "Sarbanes-Oxley Act",
      "level2": "US federal law requiring public companies to implement controls over financial reporting to prevent corporate fraud. Section 404 requires assessment of internal controls. IT implications: separation of duties, change management, access controls, and audit logging for financial systems. CFO and CEO must personally certify accuracy of financial reports.",
      "level3": "Exam tip: SOX was response to Enron/WorldCom scandals. IT security requirements stem from Section 404 (internal controls assessment). Key IT controls: separation of duties (developers can't access production financial systems), change management (all changes to financial systems documented/approved), access controls (who can modify financial data), audit logging (track all changes). Retention requirement: 7 years for financial records. Know that SOX applies to PUBLIC companies and their auditors. Questions test knowing SOX requires IT controls for financial data integrity."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Compliance", "Financial", "Audit", "Internal Controls"]
    }
  },
  {
    "id": "d5-027",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Security Baselines",
    "back": {
      "level1": "Minimum security settings required for systems to be deployed",
      "level2": "Documented set of mandatory security configurations applied to systems. Examples: CIS Benchmarks, DISA STIGs, vendor hardening guides. Covers: patching, password policies, disabled services, encryption, logging. Systems must meet baseline before production deployment. Verified through automated scanning (SCAP).",
      "level3": "Exam tip: Baselines define MINIMUM required security - starting point, not end point. Common sources: CIS Benchmarks (consensus community standards), DISA STIGs (DoD), vendor guides (Microsoft Security Baselines). Benefits: consistent security across fleet, compliance demonstration, reduce attack surface. Implemented via: golden images (templates), configuration management tools (Ansible, GPO), automated scanning (SCAP). Know that baselines should be: documented, approved by management, enforced technically, verified regularly. Questions test knowing baseline purpose and implementation methods."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Configuration Management", "CIS Benchmarks", "STIG", "Hardening", "SCAP"]
    }
  },
  {
    "id": "d5-028",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Inherent vs Residual Risk",
    "back": {
      "level1": "Inherent: risk before controls; Residual: risk after controls applied",
      "level2": "Inherent risk is the level of risk present before any controls or mitigations (raw risk). Residual risk is what remains after implementing security controls. Goal is to reduce residual risk to acceptable level within risk appetite. Residual risk that exceeds tolerance requires additional controls or risk acceptance.",
      "level3": "Exam tip: MEMORIZE the difference. Inherent = BEFORE controls (worst case). Residual = AFTER controls (current state). Formula: Residual Risk = Inherent Risk - Control Effectiveness. Example: inherent risk of laptop theft is HIGH. After implementing encryption and tracking software, residual risk is LOW (data protected even if stolen). Know that: you ASSESS inherent risk, APPLY controls, MEASURE residual risk, and ACCEPT, transfer, or further mitigate residual. Questions test calculating residual risk or identifying which type is described."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Risk Management", "Security Controls", "Risk Assessment"]
    }
  },
  {
    "id": "d5-029",
    "domain": 5,
    "section": "Security Awareness",
    "type": "concept",
    "front": "Insider Threat Indicators",
    "back": {
      "level1": "Behavioral and technical signs that may indicate malicious insider activity",
      "level2": "Warning signs include: accessing data outside normal job duties, attempting to bypass security controls, downloading large amounts of data, working odd hours, financial difficulties, disgruntlement, policy violations, resigned but still accessing systems. Detected through UEBA, access monitoring, and manager awareness.",
      "level3": "Exam tip: Insider threats are hard to detect because insiders have legitimate access. Red flags: unusual access patterns (data not related to job, access during off-hours), bulk data downloads, accessing data shortly before resignation, repeated security policy violations, attempting to disable logging, excessive use of removable media. Detection requires: access logging, UEBA, manager training to spot behavioral changes, exit interview security checklist. Know that addressing requires sensitivity - investigate before accusing. Questions test identifying insider threat indicators from scenarios."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Insider Threat", "UEBA", "Behavioral Analysis", "Access Monitoring"]
    }
  },
  {
    "id": "d5-030",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "concept",
    "front": "Data Sovereignty",
    "back": {
      "level1": "Concept that data is subject to laws of the country where it is stored",
      "level2": "Legal principle that data stored in a country is subject to that country's laws regarding access, privacy, and security. Critical for cloud computing where data may be stored internationally. Some regulations (GDPR, Russian data localization law) require citizen data to remain in-country or restrict international transfers.",
      "level3": "Exam tip: Data sovereignty creates compliance challenges for global organizations. Key issues: GDPR restricts transfers outside EU unless adequate protections (Standard Contractual Clauses, adequacy decisions), some countries require data localization (Russia, China), government access to data varies by jurisdiction (US CLOUD Act, EU privacy protections). Know that organizations must: understand where cloud data is stored, ensure compliance with all applicable jurisdictions, use regional cloud instances if needed. Questions test knowing sovereignty implications for cloud storage and cross-border data transfers."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Cloud", "GDPR", "Data Localization", "Privacy", "Jurisdiction"]
    }
  },
  {
    "id": "d5-031",
    "domain": 5,
    "section": "Security Governance",
    "type": "standard",
    "front": "NIST Cybersecurity Framework (CSF)",
    "back": {
      "level1": "Identify, Protect, Detect, Respond, Recover - Five core functions",
      "level2": "Voluntary framework for managing cybersecurity risk developed by NIST. Five functions provide structure for cybersecurity programs: Identify (understand risks, assets, capabilities), Protect (implement safeguards), Detect (find cybersecurity events), Respond (take action on detected incidents), Recover (restore capabilities after incident). Each function has categories and subcategories with specific outcomes.",
      "level3": "Exam tip: MEMORIZE the five functions in order: Identify → Protect → Detect → Respond → Recover. Know that CSF is VOLUNTARY (not regulatory) but widely adopted. Framework Core has three components: Functions (five core areas), Categories (subdivisions - Asset Management, Access Control, etc.), Subcategories (specific outcomes). Framework helps organizations: assess current posture, set goals, prioritize improvements, communicate risk. Questions test knowing the five functions, understanding CSF is voluntary risk management framework, and knowing it's iterative/continuous improvement model."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["NIST", "Risk Management", "Framework", "Cybersecurity"]
    }
  },
  {
    "id": "d5-032",
    "domain": 5,
    "section": "Risk Management",
    "type": "standard",
    "front": "NIST Risk Management Framework (RMF)",
    "back": {
      "level1": "7-step process: Prepare → Categorize → Select → Implement → Assess → Authorize → Monitor",
      "level2": "NIST SP 800-37 framework for integrating security and risk management into system development lifecycle. Seven steps: (1) Prepare organization and systems, (2) Categorize information and systems by impact, (3) Select appropriate security controls, (4) Implement controls and document, (5) Assess control effectiveness, (6) Authorize system operation based on acceptable risk, (7) Monitor controls continuously. Mandatory for federal systems.",
      "level3": "Exam tip: MEMORIZE all 7 steps in order. RMF is more prescriptive than CSF - tells exactly what to do. Key points: Step 2 uses FIPS 199 categorization (Low/Moderate/High impact). Step 3 selects controls from NIST SP 800-53. Step 6 requires Authorizing Official (AO) to accept risk and authorize operation. Step 7 is continuous monitoring (not one-time). Know that RMF is MANDATORY for federal systems, CSF is voluntary. Questions test knowing the seven steps, understanding it's for federal systems, and knowing each step's purpose."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["NIST", "Federal", "FISMA", "SP 800-53", "Risk Management"]
    }
  },
  {
    "id": "d5-033",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "ISO/IEC 27001",
    "back": {
      "level1": "International standard for Information Security Management Systems (ISMS)",
      "level2": "Specification for establishing, implementing, maintaining, and continually improving an ISMS. Provides systematic approach to managing sensitive information. Requires: risk assessment, statement of applicability (selecting controls), management commitment, internal audits, continual improvement. Organizations can be certified by accredited auditors. Companion standard ISO 27002 provides control implementation guidance.",
      "level3": "Exam tip: ISO 27001 specifies requirements for ISMS certification. Key components: Annex A lists 93 controls organized in 14 categories. Organizations perform risk assessment, select applicable controls, document in Statement of Applicability (SOA). Know the PDCA cycle: Plan (establish ISMS), Do (implement controls), Check (monitor/review), Act (maintain/improve). Certification requires third-party audit. Differences: ISO 27001 is CERTIFICATION standard (what you must do), ISO 27002 is GUIDANCE (how to do it). Questions test knowing ISO 27001 is international ISMS standard and certification is possible."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["ISO 27002", "ISMS", "Certification", "International Standard"]
    }
  },
  {
    "id": "d5-034",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "ISO/IEC 27002",
    "back": {
      "level1": "Code of practice for information security controls - Implementation guidance for ISO 27001",
      "level2": "Provides detailed guidance and best practices for implementing information security controls. Companion to ISO 27001, offering practical advice on control selection and implementation. Organized into 14 control categories including: access control, cryptography, physical security, operations security, communications security, supplier relationships. Not a certification standard - used as reference for implementing controls.",
      "level3": "Exam tip: ISO 27002 is the HOW-TO guide for ISO 27001 controls. 14 control domains: Information security policies, Organization of information security, Human resource security, Asset management, Access control, Cryptography, Physical and environmental security, Operations security, Communications security, System acquisition/development/maintenance, Supplier relationships, Incident management, Business continuity, Compliance. Remember: 27001 = requirements for ISMS certification, 27002 = implementation guidance (not certifiable). Questions test distinguishing 27001 (certification) from 27002 (guidance)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["ISO 27001", "Security Controls", "Best Practices"]
    }
  },
  {
    "id": "d5-035",
    "domain": 5,
    "section": "Business Continuity",
    "type": "concept",
    "front": "Hot Site, Warm Site, Cold Site",
    "back": {
      "level1": "Disaster recovery site types: Hot (ready immediately), Warm (requires setup), Cold (empty facility)",
      "level2": "Hot Site: fully equipped and operational alternate facility with current data, ready for immediate failover (hours). Warm Site: equipped with hardware/network but requires data restoration and configuration (days). Cold Site: empty facility with power/cooling, requires equipment installation and data recovery (weeks). Mobile Site: transportable recovery facility. Cloud-based: virtual recovery environment.",
      "level3": "Exam tip: MEMORIZE recovery times and costs. Hot Site: RTO hours, most expensive, current data mirrored, immediate failover. Warm Site: RTO days, moderate cost, hardware ready but data needs restore. Cold Site: RTO weeks, least expensive, just space and utilities. Questions test selecting appropriate site for RTO requirements and cost. Example: critical system with 4-hour RTO = Hot Site. Know trade-off: faster recovery = higher cost. Cloud becoming popular as cost-effective hot/warm site alternative."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Disaster Recovery", "BCP", "RTO", "Failover"]
    }
  },
  {
    "id": "d5-036",
    "domain": 5,
    "section": "Business Continuity",
    "type": "concept",
    "front": "Backup Types",
    "back": {
      "level1": "Full, Incremental, Differential - backup strategies with different recovery trade-offs",
      "level2": "Full: Complete copy of all data (slowest backup, fastest restore). Incremental: Backs up only data changed since last backup (any type) - fast backup, slower restore (need full + all incrementals). Differential: Backs up data changed since last full backup (medium speed, restores from full + last differential). Snapshot: Point-in-time image of system state.",
      "level3": "Exam tip: Know backup/restore trade-offs. Full: backs up everything, simple restore (just latest full), but slow and storage-intensive. Incremental: fastest backup (only changes), minimal storage, but slowest restore (need full + every incremental in sequence). Differential: compromise (only changes since last full), moderate backup time (grows until next full), faster restore than incremental (just full + last differential). Common strategy: Full weekly + Daily incrementals, or Full weekly + Daily differentials. Questions test selecting backup type for RTO/RPO requirements and understanding restore procedures."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Backup", "Disaster Recovery", "RTO", "RPO"]
    }
  },
  {
    "id": "d5-037",
    "domain": 5,
    "section": "Business Continuity",
    "type": "concept",
    "front": "Business Continuity Plan (BCP) vs Disaster Recovery Plan (DRP)",
    "back": {
      "level1": "BCP: maintaining business operations during disruptions; DRP: restoring IT systems after disasters",
      "level2": "BCP is broader strategy for continuing business functions during/after disruption - includes people, processes, facilities, communications. DRP is subset of BCP focused specifically on recovering IT infrastructure and data. BCP addresses: alternate work sites, succession planning, vendor alternatives. DRP addresses: backup restoration, system recovery, alternate processing sites.",
      "level3": "Exam tip: BCP is BUSINESS-FOCUSED (keep business running), DRP is IT-FOCUSED (restore systems). BCP developed by business units with IT input. DRP developed by IT. BCP addresses: how to continue operations with reduced staff, alternate vendors, manual processes. DRP addresses: restore priority, backup locations, recovery sites, system dependencies. Know that DRP is component of BCP. Questions test distinguishing between them: customer service continuity = BCP, database restoration = DRP. Both require testing, documented procedures, and regular updates."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Business Continuity", "Disaster Recovery", "BIA", "Resilience"]
    }
  },
  {
    "id": "d5-038",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Service Level Agreement (SLA)",
    "back": {
      "level1": "Contract defining service expectations, performance metrics, and penalties between provider and customer",
      "level2": "Formal agreement specifying: service performance targets (uptime percentage, response time), measurement methods, responsibilities, penalties for non-compliance, remedies. Common metrics: uptime (99.9% = 43 minutes/month downtime), response time, resolution time. Penalties often include service credits. Critical for cloud services, ISPs, MSPs, and vendors.",
      "level3": "Exam tip: SLA defines MEASURABLE service commitments. Key elements: performance metrics (uptime %, response time), measurement period (monthly, quarterly), penalties/credits for violations, exclusions (scheduled maintenance), customer responsibilities. Know common uptime levels: 99% (3.65 days/year down), 99.9% (8.76 hours/year), 99.99% (52 minutes/year), 99.999% (5 minutes/year - 'five nines'). Questions test understanding SLA is contract with penalties, knowing it should include metrics and consequences, and distinguishing from MOU (no penalties)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Cloud", "Vendor Management", "Uptime", "Service Credits"]
    }
  },
  {
    "id": "d5-039",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "MOU vs MOA",
    "back": {
      "level1": "Memorandum of Understanding: non-binding agreement; Memorandum of Agreement: binding commitment",
      "level2": "MOU: Informal agreement expressing intent to work together, outlines general cooperation, not legally binding, no penalties for non-compliance. MOA: More formal agreement with specific obligations, deliverables, and responsibilities, may be legally binding, includes consequences for non-performance. Both used between organizations to define collaboration before formal contracts.",
      "level3": "Exam tip: MOU = INTENT to collaborate (handshake agreement, non-binding). MOA = COMMITMENT with obligations (more formal, may be binding). Key differences: MOU broad and general, MOA specific and detailed. MOU no penalties, MOA may include consequences. Example: two agencies sign MOU to share threat intelligence (general cooperation), then MOA specifying data formats, sharing frequency, security requirements. Questions test distinguishing them: if describes penalties/obligations = MOA, if describes cooperation/intent = MOU. Both precede formal contracts/SLAs."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Agreements", "Contracts", "SLA", "Vendor Management"]
    }
  },
  {
    "id": "d5-040",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "BPA and ISA",
    "back": {
      "level1": "Business Partnership Agreement and Interconnection Security Agreement for partnerships and system connections",
      "level2": "BPA: Agreement between business partners defining relationship terms, responsibilities, profit sharing, dispute resolution, confidentiality. ISA: Technical agreement for connecting information systems, specifying security requirements, data flows, access controls, monitoring, incident response. ISA required when two organizations' systems interconnect (common in government/federal environments).",
      "level3": "Exam tip: BPA is BUSINESS relationship (partners sharing risk/reward, joint ventures). ISA is TECHNICAL connection security (system-to-system interconnection requirements). ISA components: system security plans, MOUs/MOAs, connection diagrams, data sensitivity levels, security controls each side provides, monitoring requirements. Common scenario: government agency connecting to contractor system requires ISA documenting security measures. Questions test knowing ISA is for system interconnections and knowing it specifies technical security requirements for connections. BPA rarely tested, ISA more common on exam."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": false,
      "relatedTerms": ["Agreements", "System Interconnection", "Federal", "FISMA"]
    }
  },
  {
    "id": "d5-041",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "Password Policy",
    "back": {
      "level1": "Rules governing password creation, management, and lifecycle",
      "level2": "Defines requirements for password security: minimum length (12+ characters recommended), complexity (mix of character types), expiration (90 days traditional, but NIST now recommends no routine expiration), history (prevent reuse), lockout after failed attempts, no sharing, secure storage (encrypted). Modern guidance favors length and passphrases over complexity and frequent changes.",
      "level3": "Exam tip: Know evolving password guidance. Traditional (outdated): 8 characters, complexity, 90-day expiration. NIST SP 800-63B (current): minimum 8 characters (12+ recommended), allow all characters, check against breach lists, NO routine expiration (only change when compromised), screen for common passwords. Length > complexity. Passphrases encouraged. Questions may test either approach, context determines. Most exams still include traditional requirements. Key points: minimum length, complexity requirements, expiration period, account lockout threshold, password history preventing reuse."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Authentication", "NIST SP 800-63", "Passwords", "Security Policy"]
    }
  },
  {
    "id": "d5-042",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "BYOD Policy",
    "back": {
      "level1": "Bring Your Own Device - rules for using personal devices for work",
      "level2": "Policy governing personal device (phones, tablets, laptops) usage for business purposes. Addresses: allowed devices, security requirements (MDM enrollment, encryption, passcode), acceptable use, data access/storage, company rights (remote wipe), support responsibilities, privacy expectations. Balances employee convenience with organizational security and data protection.",
      "level3": "Exam tip: BYOD policies address security vs convenience trade-off. Key components: security requirements (device encryption, screen lock, OS updates, MDM enrollment), acceptable use (no jailbreak/root), company rights (remote wipe lost devices, inspect for compliance), data separation (containerization - work apps isolated from personal), privacy (what company can access), support (company doesn't support personal use issues). Know risks: data leakage, lost/stolen devices, malware, compliance challenges. Mitigations: MDM/MAM, encryption, remote wipe, VPN for access. Questions test policy components and security controls for BYOD."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["MDM", "MAM", "Mobile Security", "Personal Devices"]
    }
  },
  {
    "id": "d5-043",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "ALE, SLE, ARO Calculations",
    "back": {
      "level1": "Annual Loss Expectancy = Single Loss Expectancy × Annual Rate of Occurrence",
      "level2": "Quantitative risk formulas. SLE (Single Loss Expectancy) = Asset Value × Exposure Factor (% of asset lost). ARO (Annual Rate of Occurrence) = expected frequency per year. ALE (Annual Loss Expectancy) = SLE × ARO. Used for cost-benefit analysis of security controls - if control costs less than ALE, it's justified.",
      "level3": "Exam tip: MEMORIZE formulas and how to calculate. Example: Server worth $100K, 30% would be lost in fire (EF=0.3), fire expected every 10 years (ARO=0.1). SLE = $100K × 0.3 = $30K. ALE = $30K × 0.1 = $3K/year. If sprinkler system costs $2K/year, it's cost-effective (saves $3K, costs $2K). Know that ALE helps justify security spending. Questions often give values and ask to calculate ALE, or ask which formula to use. Remember: EF is percentage (0-1), ARO can be fraction (0.1 = once per 10 years) or multiple (2 = twice per year)."
    },
    "metadata": {
      "difficulty": "hard",
      "commonlyTested": true,
      "relatedTerms": ["Quantitative Risk", "Risk Assessment", "Cost-Benefit", "Exposure Factor"]
    }
  },
  {
    "id": "d5-044",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Job Rotation",
    "back": {
      "level1": "Security control requiring employees to periodically change roles/positions",
      "level2": "Personnel security control where employees rotate between different jobs or responsibilities on scheduled basis. Serves multiple purposes: detect fraud (new person discovers irregularities), reduce single points of failure, cross-training (business continuity), prevent collusion, reduce burnout. Especially important for sensitive positions like system administrators and financial roles.",
      "level3": "Exam tip: Job rotation is DETECTIVE control (like mandatory vacation) for fraud/error detection. Benefits: fraud detection (schemes require continuous attention, rotation exposes them), knowledge sharing (multiple people know critical processes), reduced dependency (continuity if key person leaves), fresh perspectives. Challenges: training costs, temporary productivity loss, resistance from employees. Know that job rotation differs from separation of duties (SoD divides one process across people, rotation moves people between different complete processes). Questions test job rotation purpose (fraud detection, cross-training) and distinguishing from SoD."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Mandatory Vacation", "Fraud Detection", "Personnel Security", "SoD"]
    }
  },
  {
    "id": "d5-045",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Least Privilege",
    "back": {
      "level1": "Users should have minimum access rights necessary to perform job functions",
      "level2": "Fundamental security principle requiring users, processes, and systems to operate with minimum privileges required - no more, no less. Reduces risk from: insider threats, malware (runs with user's privileges), compromised accounts, accidental damage. Implemented through: role-based access control (RBAC), just-in-time access, privilege escalation only when needed, regular access reviews.",
      "level3": "Exam tip: Least privilege limits BLAST RADIUS of compromise. Example: developer shouldn't have production admin access, users shouldn't have local admin rights, service accounts should have minimal permissions. Implementation: default deny, grant only required access, use RBAC/groups, time-limited elevated access (JIT - Just In Time admin), review regularly (attestation). Know related concepts: need-to-know (data access), separation of duties (no one person completes critical task alone). Questions test identifying least privilege violations (user has unnecessary access) and knowing remediation (remove excess privileges, implement RBAC)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["RBAC", "Access Control", "Privilege Escalation", "JIT Access"]
    }
  },
  {
    "id": "d5-046",
    "domain": 5,
    "section": "Privacy",
    "type": "concept",
    "front": "Personally Identifiable Information (PII)",
    "back": {
      "level1": "Information that can identify an individual, alone or combined with other data",
      "level2": "Data that identifies or can be used to identify, contact, or locate a specific individual. Includes: name, SSN, driver's license, passport, email, phone, address, biometrics, IP address, financial account numbers. PII requires protection under privacy regulations (GDPR, CCPA, state laws). Sensitivity varies: SSN is more sensitive than name.",
      "level3": "Exam tip: PII is any data identifying person. Direct identifiers (alone identify): SSN, driver's license, passport, biometric, full name+address. Indirect identifiers (combined identify): birthdate + zip code, employee ID + department. Know that PII protection requirements: encryption at rest/transit, access controls, data minimization, breach notification, user consent. Differs from PHI (health information specifically). Questions test identifying what is PII in scenarios and knowing protection requirements. Remember: pseudonymization reduces but doesn't eliminate PII (can still re-identify)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "GDPR", "PHI", "Data Protection", "Breach Notification"]
    }
  },
  {
    "id": "d5-047",
    "domain": 5,
    "section": "Privacy",
    "type": "concept",
    "front": "De-identification and Anonymization",
    "back": {
      "level1": "De-identification: removing/masking identifiers; Anonymization: irreversibly removing identity linkage",
      "level2": "De-identification removes or obscures direct identifiers (name, SSN) making re-identification harder but not impossible. Anonymization irreversibly removes any linkage to individual, preventing re-identification even with additional data. Techniques include: data masking, aggregation, generalization, perturbation. Anonymized data often exempt from privacy regulations.",
      "level3": "Exam tip: Anonymization is IRREVERSIBLE, de-identification is REVERSIBLE. De-identification methods: pseudonymization (replace identifiers with pseudonyms - reversible with key), masking (hide parts - xxx-xx-1234), generalization (age 47 → age group 40-50). Anonymization: aggregation (individual records combined), differential privacy (add statistical noise). Know that truly anonymous data is VERY difficult - research shows records can be re-identified by combining public data. Questions test distinguishing anonymization (irreversible, exempt from regulations) vs de-identification (reversible, still regulated)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "Pseudonymization", "Data Masking", "GDPR"]
    }
  },
  {
    "id": "d5-048",
    "domain": 5,
    "section": "Privacy",
    "type": "concept",
    "front": "Data Minimization",
    "back": {
      "level1": "Collecting and retaining only data necessary for specified purposes",
      "level2": "Privacy principle requiring organizations to limit data collection to what's directly relevant and necessary for legitimate purposes. Don't collect data 'just in case' or 'might be useful later'. Includes: minimal collection, limited retention (delete when no longer needed), purpose limitation (use only for stated purpose). Core principle in GDPR and privacy-by-design.",
      "level3": "Exam tip: Data minimization = collect ONLY what's needed, keep ONLY as long as needed. Benefits: reduced breach impact (less data to lose), lower compliance burden, reduced storage costs, privacy protection. Implementation: define data collection purposes, question if each field necessary, anonymize when possible, delete after retention period. Know this conflicts with big data analytics (wants all data forever) and litigation holds (requires data preservation). Questions test understanding minimization reduces privacy risk and knowing it's GDPR principle requiring justification for data collection."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "GDPR", "Privacy by Design", "Data Collection"]
    }
  },
  {
    "id": "d5-049",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Due Diligence vs Due Care",
    "back": {
      "level1": "Due Diligence: research/planning; Due Care: implementing and maintaining protections",
      "level2": "Due Diligence is investigation and planning phase - identifying risks, researching solutions, understanding threats, assessing options. Due Care is action phase - implementing controls, following policies, maintaining systems, exercising reasonable care to protect assets. Both needed to demonstrate legal responsibility and avoid negligence.",
      "level3": "Exam tip: Due Diligence = IDENTIFY risks and solutions (research, assessment, planning). Due Care = IMPLEMENT and maintain protections (action, follow-through). Example: researching firewall options and vendors = due diligence; deploying firewall and keeping it patched = due care. Legal significance: both required to show reasonable effort in security. Lack of either can indicate negligence. Questions test distinguishing them: planning/assessment = diligence, implementation/maintenance = care. Remember: you can't have due care without due diligence (can't implement well without planning)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Legal", "Negligence", "Governance", "Compliance"]
    }
  },
  {
    "id": "d5-050",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Background Checks and NDA",
    "back": {
      "level1": "Pre-employment screening and confidentiality agreements for personnel security",
      "level2": "Background checks verify candidate credentials, criminal history, credit (for financial positions), education, references before granting access. Depth varies by position sensitivity and legal restrictions. Non-Disclosure Agreement (NDA) is legal contract prohibiting disclosure of confidential information, signed at hiring, protects trade secrets and sensitive data. NDA survives employment termination.",
      "level3": "Exam tip: Background checks are PREVENTIVE control for personnel security. Types: criminal history, credit check (financial positions), education/credential verification, reference checks, social media review, drug testing. Legal considerations: Fair Credit Reporting Act (FCRA) requirements, state/country restrictions, candidate must consent. NDA (confidentiality agreement) protects: trade secrets, proprietary information, customer data, business strategies. Know that NDA violations have legal consequences. Questions test knowing background checks appropriate for high-trust positions and understanding NDA protects confidential information even after employment ends."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Personnel Security", "Onboarding", "Confidentiality", "Legal"]
    }
  },
  {
    "id": "d5-051",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Onboarding and Offboarding",
    "back": {
      "level1": "Onboarding: provisioning new employees; Offboarding: secure removal of departing employees",
      "level2": "Onboarding process: background check, NDA signing, account creation, access provisioning (least privilege), asset assignment (laptop, badge), security training, policy acknowledgment. Offboarding process: access revocation, asset return, exit interview, knowledge transfer, account disabling, badge deactivation. Security focuses on: timely access removal, data protection, preventing insider threats.",
      "level3": "Exam tip: Offboarding is CRITICAL security control. Offboarding checklist: disable accounts immediately (separation day, not after), revoke physical access (badges, keys), collect company assets (laptop, phone, documents), change shared passwords employee knew, remove from email groups, backup employee data, conduct exit interview (security awareness, no copying data). Know risks: terminated employees with lingering access, disgruntled employees, data theft before departure. Best practice: automate offboarding with HR system integration, disable not delete accounts (preserve audit trail). Questions test offboarding steps and timing (immediate access revocation)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Personnel Security", "Access Revocation", "Insider Threat", "HR"]
    }
  },
  {
    "id": "d5-052",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Chief Information Security Officer (CISO)",
    "back": {
      "level1": "Executive responsible for organization's information security program and strategy",
      "level2": "C-level executive managing cybersecurity strategy, team, and budget. Responsibilities: develop security strategy aligned with business, manage security operations, communicate risk to board/executives, ensure compliance, incident response oversight, security awareness programs, vendor risk management. Reports to CEO, CIO, or CRO. Bridges technical security and business objectives.",
      "level3": "Exam tip: CISO is EXECUTIVE role (strategic, not tactical). Key responsibilities: security strategy and vision, board/executive risk communication, budget management, compliance oversight, security team leadership. Know that CISO doesn't configure firewalls (that's operations) - sets policies and direction. Challenges: communicating technical risk to business, balancing security with business enablement, talent acquisition, demonstrating ROI. Questions test knowing CISO is strategic executive role responsible for security program and understanding distinction from security engineer/analyst (tactical roles)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Executive", "Governance", "Security Program", "Leadership"]
    }
  },
  {
    "id": "d5-053",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Data Protection Officer (DPO)",
    "back": {
      "level1": "Required GDPR role responsible for data protection compliance and privacy oversight",
      "level2": "Position mandated by GDPR for organizations doing large-scale processing of sensitive data or public authorities. Responsibilities: monitor GDPR compliance, conduct DPIAs, serve as contact for data subjects and supervisory authorities, advise on data protection, train staff. Must be independent and report to highest management. Can be internal employee or external contractor.",
      "level3": "Exam tip: DPO is GDPR-specific requirement (not all organizations need one). When required: public authorities, large-scale regular monitoring, large-scale processing of special category data (health, biometric, racial). DPO must: have expert privacy knowledge, be independent (not receive instructions on privacy matters), have resources to perform duties, be accessible to data subjects. Know DPO differs from CISO: DPO focuses on privacy/data protection compliance, CISO focuses on broader security program. Questions test knowing when DPO required and understanding role is GDPR privacy compliance."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["GDPR", "Privacy", "Compliance", "Data Protection"]
    }
  },
  {
    "id": "d5-054",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "FISMA",
    "back": {
      "level1": "Federal Information Security Management Act - US law requiring federal agency security programs",
      "level2": "Federal law requiring civilian agencies to develop, document, and implement information security programs. Requires: annual FISMA reporting to OMB, security controls from NIST SP 800-53, systems categorized by FIPS 199 (Low/Moderate/High), continuous monitoring, independent audits. OMB provides FISMA implementation guidance. NIST provides technical standards via Special Publications.",
      "level3": "Exam tip: FISMA applies to FEDERAL AGENCIES and contractors handling federal data. Key requirements: implement NIST RMF, select controls from SP 800-53 based on FIPS 199 categorization, continuous monitoring, annual security assessments, report to OMB. Know that FISMA compliance uses: FIPS 199 for categorization, FIPS 200 for minimum controls, SP 800-53 for control catalog, SP 800-37 for RMF. Compliance verified through independent audits. Questions test knowing FISMA is federal requirement and understanding it mandates NIST RMF/controls."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Federal", "NIST RMF", "SP 800-53", "FIPS 199", "Government"]
    }
  },
  {
    "id": "d5-055",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "FERPA",
    "back": {
      "level1": "Family Educational Rights and Privacy Act - protects student education records",
      "level2": "US federal law protecting privacy of student education records. Applies to schools receiving federal funding. Gives parents/eligible students (18+) rights to: inspect records, request corrections, control disclosure. Schools must have written permission to release records except to: school officials with legitimate interest, other schools student transfers to, audits, emergencies. Violations risk loss of federal funding.",
      "level3": "Exam tip: FERPA protects STUDENT EDUCATION RECORDS (grades, transcripts, disciplinary records, financial aid). Key points: parents have rights until student turns 18 (then student controls), schools need consent to disclose except specific exceptions (safety emergencies, subpoena, school officials with legitimate need, directory information if student didn't opt-out). Know that FERPA applies to schools (K-12, colleges), violations investigated by Department of Education, penalties include loss of federal funding. Questions test knowing FERPA protects student records and understanding consent requirements with specific exceptions."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "Education", "Student Records", "Compliance"]
    }
  },
  {
    "id": "d5-056",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "GLBA",
    "back": {
      "level1": "Gramm-Leach-Bliley Act - requires financial institutions to protect customer information",
      "level2": "US law requiring financial institutions to explain information sharing practices and protect sensitive data. Three main provisions: Financial Privacy Rule (disclose privacy practices), Safeguards Rule (implement security program protecting customer data), Pretexting Provisions (protect against social engineering for customer info). Applies to banks, credit unions, insurance companies, investment firms.",
      "level3": "Exam tip: GLBA applies to FINANCIAL INSTITUTIONS. Safeguards Rule requires: designate security coordinator, risk assessment, design/implement safeguards, oversee service providers, evaluate/adjust program. Must protect 'nonpublic personal information' (NPI): SSN, account numbers, credit history. Privacy notices must be provided: at account opening, annually, before sharing with non-affiliates. Know that FTC enforces for non-banking institutions. Questions test knowing GLBA requires financial data protection, privacy notices, and security program implementation."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Financial Privacy", "Banking", "Privacy Notice", "Compliance"]
    }
  },
  {
    "id": "d5-057",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "CCPA/CPRA",
    "back": {
      "level1": "California Consumer Privacy Act - grants California residents rights over their personal information",
      "level2": "California privacy law giving residents rights to: know what personal information collected, know if sold/shared, access their data, delete data, opt-out of sale, non-discrimination for exercising rights. Applies to for-profit businesses meeting thresholds (revenue $25M+, 50K+ consumers, or 50%+ revenue from selling data). CPRA (2023) strengthened CCPA with additional protections and enforcement.",
      "level3": "Exam tip: CCPA is California's GDPR-like law but less strict. Consumer rights (CCPA): right to know, access, delete, opt-out of sale, non-discrimination. Business obligations: privacy notice, response to requests within 45 days, verified request process, don't discriminate against exercisers. CPRA added: right to correct, right to limit use of sensitive data, California Privacy Protection Agency (enforcement). Know that unlike GDPR (requires consent for processing), CCPA allows processing with opt-out option. Questions test consumer rights and business obligations under CCPA."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "California", "Consumer Rights", "Data Protection"]
    }
  },
  {
    "id": "d5-058",
    "domain": 5,
    "section": "Compliance and Regulations",
    "type": "standard",
    "front": "COPPA",
    "back": {
      "level1": "Children's Online Privacy Protection Act - protects online privacy of children under 13",
      "level2": "US law requiring websites/online services directed at children under 13 (or with actual knowledge of child users) to obtain verifiable parental consent before collecting personal information. Requirements: privacy notice, parental consent for collection, parental access to child's info, option to delete, reasonable security, data retention limits. FTC enforces with significant fines for violations.",
      "level3": "Exam tip: COPPA protects CHILDREN UNDER 13 online. Triggers: site directed at kids (content, design, advertising), OR actual knowledge collecting from kids. Requirements: verifiable parental consent (not just checkbox - methods include credit card, government ID, video conference), parents can review/delete child's data, reasonable security for child data, retain only as long as needed. Know many sites avoid COPPA by prohibiting users under 13 (like social media). Violations result in FTC fines ($thousands per child per violation). Questions test age threshold (under 13) and parental consent requirement."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "Children", "Parental Consent", "Online Services"]
    }
  },
  {
    "id": "d5-059",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Matrix (Heat Map)",
    "back": {
      "level1": "Visual representation plotting risks by likelihood and impact to prioritize responses",
      "level2": "Grid showing risks plotted with likelihood (probability) on one axis and impact (severity) on other. Typically color-coded: red (high risk - high likelihood + high impact), yellow (medium), green (low). Helps visualize risk landscape, prioritize remediation efforts, and communicate risk to stakeholders. Common sizes: 3×3 or 5×5 grids.",
      "level3": "Exam tip: Risk matrix provides VISUAL risk prioritization. Axes: Likelihood (rare, unlikely, possible, likely, almost certain) vs Impact (negligible, minor, moderate, major, catastrophic). Quadrants: High likelihood + High impact = CRITICAL (red - address immediately). Low likelihood + Low impact = ACCEPT (green - low priority). Questions test interpreting matrix: if risk in red zone = high priority remediation, green = accept/monitor. Know that matrix placement determines risk response: red/high = mitigate or avoid, yellow/medium = mitigate or transfer, green/low = accept. Useful for executive communication (visual, simple)."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Risk Assessment", "Risk Prioritization", "Qualitative Risk", "Visualization"]
    }
  },
  {
    "id": "d5-060",
    "domain": 5,
    "section": "Business Continuity",
    "type": "concept",
    "front": "Business Continuity Testing Types",
    "back": {
      "level1": "Tabletop, Walkthrough, Simulation, Full Interruption - increasing levels of BCP/DRP testing",
      "level2": "Tabletop: discussion-based, review procedures in meeting. Walkthrough: step through plan without execution. Simulation: execute plan with simulated disaster but no real cutover. Full Interruption: actual failover to alternate site/systems with real downtime. Parallel Test: run backup systems alongside production without switching over.",
      "level3": "Exam tip: Tests progress from DISCUSSION to ACTUAL EXECUTION. Tabletop: lowest risk/cost, discussion only, identifies plan gaps. Walkthrough: talk through steps, may inspect sites. Simulation: hands-on but simulated (test DR site functionality without switching). Parallel: run both production and DR simultaneously (expensive). Full interruption: actual failover (highest confidence but business disruption). Know testing frequency: tabletop annually minimum, full interruption rarely due to risk. Questions test selecting appropriate test type for risk tolerance and ordering tests by disruption level (tabletop < walkthrough < simulation < full)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["BCP", "DRP", "Testing", "Business Continuity"]
    }
  },
  {
    "id": "d5-061",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Master Service Agreement (MSA)",
    "back": {
      "level1": "Umbrella contract defining general terms for ongoing business relationship",
      "level2": "Framework agreement establishing general terms, conditions, and legal framework for future transactions between parties. Contains: payment terms, liability limits, confidentiality, dispute resolution, termination clauses. Individual projects governed by Statements of Work (SOW) under the MSA. Avoids renegotiating terms for each project.",
      "level3": "Exam tip: MSA is UMBRELLA agreement for multiple projects. Structure: MSA sets general terms (liability, payment, confidentiality, IP rights), SOWs define specific project scope/deliverables/pricing. Benefits: faster project initiation (legal terms already agreed), consistent terms across projects, reduced negotiation time. Common in: IT services, consulting, software development, cloud services. Know that MSA is long-term framework, SOW is project-specific. Questions test understanding MSA purpose (ongoing relationship framework) and knowing it works with SOWs for specific engagements."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": false,
      "relatedTerms": ["Contracts", "SOW", "Vendor Management", "Legal"]
    }
  },
  {
    "id": "d5-062",
    "domain": 5,
    "section": "Security Awareness",
    "type": "concept",
    "front": "Role-Based Security Training",
    "back": {
      "level1": "Tailoring security education to specific job functions and risk levels",
      "level2": "Customized training based on employee role. General users: phishing, passwords, physical security, acceptable use. Developers: secure coding, OWASP Top 10, code review. Administrators: privilege management, patching, configuration hardening. Executives: risk management, regulatory compliance, incident communication. More relevant and effective than one-size-fits-all training.",
      "level3": "Exam tip: Role-based training provides RELEVANT content for each audience. Examples: General users (basic security hygiene - phishing, passwords, device security), IT admins (change management, least privilege, logging), Developers (secure coding, input validation, OWASP), Finance (wire transfer fraud, financial data protection), Executives (strategic risk, board reporting, incident communication), Privileged users (extra scrutiny due to access level). Benefits: more engaging (relevant to job), better retention, addresses role-specific risks. Questions test understanding training should be tailored to roles, not generic for all."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Security Awareness", "Training", "Personnel Security"]
    }
  },
  {
    "id": "d5-063",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Vendor Assessment and Questionnaires",
    "back": {
      "level1": "Evaluating third-party security posture before and during business relationship",
      "level2": "Process of assessing vendor security through questionnaires, audits, and certifications. Pre-contract: security questionnaires (SIG, CAIQ), compliance certifications (SOC 2, ISO 27001), pentesting results. Ongoing: annual reassessments, right to audit, incident notification requirements. Questions cover: security controls, data protection, incident response, BCP/DR, compliance.",
      "level3": "Exam tip: Vendor assessment manages THIRD-PARTY risk. Common questionnaires: SIG (Standardized Information Gathering), CAIQ (Consensus Assessments Initiative Questionnaire - for cloud), custom security questionnaires. Assessment areas: access controls, encryption, vulnerability management, incident response, business continuity, compliance, sub-processor management. Evidence requests: SOC 2 report, ISO 27001 certificate, penetration test results, security policies. Know that assessment rigor should match vendor risk (critical vendor = thorough assessment). Questions test understanding vendor security review importance and knowing common assessment methods (questionnaires, certifications, audits)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Third-Party Risk", "SOC 2", "Vendor Management", "Due Diligence"]
    }
  },
  {
    "id": "d5-064",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Penetration Testing Types",
    "back": {
      "level1": "Black Box, White Box, Gray Box - pentesting approaches with varying information disclosure",
      "level2": "Black Box (unknown environment): no prior knowledge given to testers, simulates external attacker. White Box (known environment): full knowledge of systems, architecture, credentials provided, comprehensive assessment. Gray Box (partial knowledge): some information given (architecture but not credentials), balances realism and coverage. Each has different time, cost, and coverage trade-offs.",
      "level3": "Exam tip: Know testing approaches and when to use each. Black box: tests security from external threat perspective, discovers what attacker sees, longer time needed, may miss internal issues. White box: most thorough, tests all components, faster, requires collaboration. Gray box: realistic balance, common for web apps. Related concepts: Internal vs External (network perspective), Announced vs Unannounced (surprise factor). Questions test selecting appropriate approach: external threat simulation = black box, comprehensive coverage = white box, balanced approach = gray box. Know rules of engagement define scope, timing, contacts."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Pentesting", "Security Assessment", "Red Team", "Vulnerability Assessment"]
    }
  },
  {
    "id": "d5-065",
    "domain": 5,
    "section": "Privacy",
    "type": "concept",
    "front": "Privacy by Design",
    "back": {
      "level1": "Embedding privacy considerations into system design from the beginning",
      "level2": "Proactive approach integrating privacy into technology design, business practices, and physical infrastructure from inception. Seven foundational principles: proactive not reactive, privacy as default setting, privacy embedded in design, full functionality (positive-sum not zero-sum), end-to-end security, visibility and transparency, respect for user privacy. Prevents privacy issues rather than fixing after implementation.",
      "level3": "Exam tip: Privacy by Design = build privacy IN from START (not bolt-on after). Key principles: default to maximum privacy (user must opt-in to share more, not opt-out), minimize data collection, strong security throughout lifecycle, transparent privacy practices, user-centric. Examples: encryption by default, data minimization built into forms, deletion automated after retention period, granular privacy controls. Know that GDPR encourages privacy by design but it's a concept (not regulatory requirement per se). Questions test understanding privacy by design means proactive privacy integration from beginning, not after-the-fact fixes."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Privacy", "GDPR", "Data Protection", "Secure Design"]
    }
  },
  {
    "id": "d5-066",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Ownership and Assignment",
    "back": {
      "level1": "Assigning accountability for managing specific risks to responsible individuals",
      "level2": "Process of designating risk owners who are accountable for monitoring and managing assigned risks. Risk owner (typically business unit leader or process owner) responsible for: understanding the risk, implementing mitigations, monitoring effectiveness, reporting status, escalating when risk exceeds tolerance. Separates accountability from the risk management team who facilitates the process.",
      "level3": "Exam tip: Risk OWNER is accountable for managing the risk. Owner responsibilities: accept/reject risk, fund/approve mitigations, monitor risk levels, ensure controls operate effectively. Owner is typically BUSINESS role (has authority over the process/asset at risk), not security team. Security team facilitates, provides expertise, tracks register, but business owns risk. Know that risk ownership ensures accountability - someone responsible for each identified risk. Questions test understanding risk owner is business person accountable for specific risk and knowing owner decides risk treatment (accept/mitigate/transfer/avoid)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Risk Management", "Accountability", "Risk Register", "Governance"]
    }
  },
  {
    "id": "d5-067",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Risk Exceptions and Exemptions",
    "back": {
      "level1": "Formal process for accepting specific risks that violate security policies or standards",
      "level2": "Documented approval to deviate from security requirements when business need justifies accepting the risk. Requires: business justification, risk assessment, compensating controls (if possible), approval by risk owner/CISO/leadership, time limit (temporary exception) or conditions, documented in risk register. Used when compliance isn't feasible or business benefit outweighs risk.",
      "level3": "Exam tip: Exceptions acknowledge risk acceptance for BUSINESS REASONS. Process: requestor submits business justification, security reviews and documents risks, compensating controls identified (if possible), executive/risk owner approves, exception documented with expiration date and conditions, tracked in risk register, periodic review. Common scenarios: legacy system can't be patched (business critical, replacement planned), vendor can't meet security requirement (only viable vendor, mitigations added). Know that exceptions aren't permanent free passes - require approval, documentation, review. Questions test exception process (justification, approval, documentation, time-bound)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Risk Acceptance", "Policy Exceptions", "Risk Management", "Compensating Controls"]
    }
  },
  {
    "id": "d5-068",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Configuration Management Database (CMDB)",
    "back": {
      "level1": "Repository containing information about IT infrastructure components and their relationships",
      "level2": "Database storing configuration items (CIs) - hardware, software, network devices, applications, documentation, people - and their attributes, relationships, and dependencies. Used for: change impact analysis (what's affected by changes), incident troubleshooting (understand dependencies), asset management, compliance. Core component of ITIL configuration management process.",
      "level3": "Exam tip: CMDB is single source of truth for IT INFRASTRUCTURE. Contains: configuration items (servers, applications, network devices), attributes (hostname, IP, OS, location, owner), relationships (server hosts app, app connects to database). Benefits: change impact analysis (if we patch this server, what's affected?), incident response (what dependencies does failed system have?), compliance reporting. Challenges: keeping updated, accuracy of relationships, integration with discovery tools. Questions test understanding CMDB purpose (IT infrastructure inventory with relationships) and use for change/incident management."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["ITIL", "Change Management", "Configuration Management", "Asset Inventory"]
    }
  },
  {
    "id": "d5-069",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Change Advisory Board (CAB)",
    "back": {
      "level1": "Group of stakeholders who review and approve IT changes",
      "level2": "Committee that evaluates proposed changes for: technical feasibility, security impact, business risk, timing, resources, rollback plans. Typical members: IT management, operations, security, application owners, affected business units. CAB approves/rejects changes, prioritizes, schedules. Emergency changes may bypass CAB with post-implementation review. Part of ITIL change management.",
      "level3": "Exam tip: CAB provides GOVERNANCE for IT changes. Responsibilities: review change requests, assess risk/impact, approve or reject, schedule changes, review emergency changes post-implementation. CAB considers: business impact (will change affect operations?), security implications, timing (avoid critical periods), dependencies (other changes in progress), backout plan (can it be reversed?). Know emergency changes may skip CAB approval but still need justification and post-review. Questions test understanding CAB role in change approval and knowing it's part of change management governance."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Change Management", "ITIL", "Governance", "Approval Process"]
    }
  },
  {
    "id": "d5-070",
    "domain": 5,
    "section": "Risk Management",
    "type": "concept",
    "front": "Threat Assessment",
    "back": {
      "level1": "Identifying and analyzing potential threat actors, motivations, and capabilities",
      "level2": "Process of determining what threats organization faces: threat actors (nation-states, cybercriminals, hacktivists, insiders), their motivations (financial gain, espionage, disruption, ideology), capabilities (sophistication, resources, access), and likelihood of attack. Internal threats (insiders, negligence) vs External threats (hackers, competitors). Informs risk assessment and security strategy.",
      "level3": "Exam tip: Threat assessment identifies WHO might attack and WHY. Threat actor types: Nation-state APTs (espionage, sabotage, high sophistication), Organized crime (financial motivation, moderate-high skill), Hacktivists (ideology/protest, variable skill), Script kiddies (recognition, low skill), Insiders (revenge/financial, authorized access). Assessment factors: intent (target your industry?), capability (technical sophistication), opportunity (attack surface). Output: threat profile guiding security priorities. Questions test knowing different threat actor types and understanding threat assessment identifies adversaries to prioritize defenses."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["Threat Actors", "Risk Assessment", "Threat Intelligence", "APT"]
    }
  },
  {
    "id": "d5-071",
    "domain": 5,
    "section": "Business Continuity",
    "type": "concept",
    "front": "Succession Planning",
    "back": {
      "level1": "Identifying and developing internal personnel to fill key leadership positions",
      "level2": "Process ensuring continuity of critical roles if key personnel leave, retire, or become unavailable. Identifies: critical positions, required competencies, potential successors, development needs. Includes: cross-training, mentoring, knowledge transfer, documentation of critical procedures. Part of business continuity preventing single points of failure in organizational knowledge and leadership.",
      "level3": "Exam tip: Succession planning prevents single person dependencies. Critical for: executive roles (CISO replacement if departure), key technical roles (only person knowing legacy system), specialized skills (rare expertise). Activities: identify critical roles, document responsibilities/knowledge, identify potential successors, create development plans, cross-train team members, knowledge transfer (documentation, mentoring). Know that succession planning reduces: business disruption from departures, insider threat risk (exclusive knowledge = power), continuity risk. Questions test understanding succession planning importance for business continuity and reducing single points of failure."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Business Continuity", "Knowledge Transfer", "Cross-Training", "Single Point of Failure"]
    }
  },
  {
    "id": "d5-072",
    "domain": 5,
    "section": "Security Awareness",
    "type": "concept",
    "front": "Security Champions Program",
    "back": {
      "level1": "Network of security advocates embedded in business units to promote security culture",
      "level2": "Program designating security champions - employees (non-security role) in each department who receive advanced security training and act as security liaisons. Champions: promote security awareness in their teams, provide security perspective in projects, report concerns to security team, help roll out security initiatives. Extends security team's reach and builds security culture.",
      "level3": "Exam tip: Security champions EMBED security in business units. Champion characteristics: security-interested (volunteers typically), respected by peers, good communicator. Responsibilities: advocate security in their area, answer basic questions (escalate complex), promote awareness, provide feedback to security team on business needs. Benefits: scales security team (can't be everywhere), improves communication (champions speak business language), builds culture (security = everyone's job). Program needs: training for champions, recognition, regular meetings, clear escalation path. Questions test understanding champions program extends security culture across organization."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": false,
      "relatedTerms": ["Security Awareness", "Security Culture", "Training", "Program"]
    }
  },
  {
    "id": "d5-073",
    "domain": 5,
    "section": "Privacy",
    "type": "concept",
    "front": "Right to be Forgotten (Erasure)",
    "back": {
      "level1": "GDPR right allowing individuals to request deletion of their personal data",
      "level2": "GDPR data subject right to have personal information erased when: no longer necessary for original purpose, consent withdrawn, unlawful processing, legal obligation to delete. Organizations must respond within 30 days. Exceptions: legal obligations, public interest, freedom of expression, legal claims. Organizations must notify data processors and third parties of deletion request.",
      "level3": "Exam tip: Right to erasure (right to be forgotten) is GDPR requirement. When erasure required: purpose fulfilled (original collection reason no longer applies), consent withdrawn (and no other legal basis), objection to processing, unlawful processing, legal requirement. When can refuse: legal obligation to retain, public health interest, legal claims/defense, freedom of expression. Implementation challenges: identifying all data copies, third-party notification, backups (mark for deletion, purge when rotated). Questions test knowing this is GDPR right, when it applies, and understanding organizations must delete unless exception applies."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["GDPR", "Privacy", "Data Subject Rights", "Data Deletion"]
    }
  },
  {
    "id": "d5-074",
    "domain": 5,
    "section": "Security Policies",
    "type": "concept",
    "front": "Incident Response Policy",
    "back": {
      "level1": "High-level requirements for detecting, reporting, and responding to security incidents",
      "level2": "Policy establishing incident response program requirements: IR team structure and roles, incident classification and severity, reporting procedures, escalation criteria, communication protocols, documentation requirements, legal/regulatory notification, post-incident review. Provides authority and mandate for IR activities. Detailed procedures documented separately in IR plan.",
      "level3": "Exam tip: IR policy is high-level (requirements and authority), IR plan is detailed (procedures). Policy content: IR team charter and authority, incident definition and categories, reporting requirements (who reports what, when), escalation paths (when to notify executives/legal/law enforcement), communication guidelines, evidence preservation, cooperation with investigations, metrics and reporting. Know policy requires management approval (grants authority), reviewed annually. Questions test understanding policy provides IR framework and authority, distinguishing from detailed IR plan procedures."
    },
    "metadata": {
      "difficulty": "easy",
      "commonlyTested": true,
      "relatedTerms": ["Incident Response", "Security Policy", "NIST", "IR Plan"]
    }
  },
  {
    "id": "d5-075",
    "domain": 5,
    "section": "Security Governance",
    "type": "concept",
    "front": "Security Program Metrics and Reporting",
    "back": {
      "level1": "Measuring and communicating security program effectiveness to stakeholders",
      "level2": "Systematic collection and reporting of security metrics to demonstrate value, track progress, identify gaps. Metrics categories: operational (vulnerabilities patched, incidents responded), risk (risk scores, exposure), compliance (audit findings, policy violations), financial (security spend, incident costs). Tailored reporting: executives want strategic/risk view, technical teams want operational details.",
      "level3": "Exam tip: Security metrics demonstrate program VALUE and drive decisions. Good metrics: measurable, actionable, relevant to audience. Executive metrics: overall risk score, major incidents, compliance status, security spend vs industry, third-party risk. Technical metrics: MTTD, MTTR, vulnerability remediation SLAs, patch compliance %, phishing click rates, coverage gaps. Know reporting frequency varies: executives quarterly/annually, management monthly, operations daily/weekly. Visualizations (dashboards, trends) improve communication. Questions test selecting appropriate metrics for audience and understanding metrics purpose (measure effectiveness, communicate value, drive improvement)."
    },
    "metadata": {
      "difficulty": "medium",
      "commonlyTested": true,
      "relatedTerms": ["KPI", "Metrics", "Reporting", "Security Program", "Dashboard"]
    }
  }
]
